[{"id": "shell", "label": "Shell", "category": "Объектілер", "meaning": "(Қабық, қабық, қабық, шелпек, тері) Түсіндегі бадам, грек жаңғағы немесе сол сияқты жаңғақ қабығы киімді немесе ризықты білдіреді. Егер жүкті әйел түсінде жаңғақ қабығын көрсе, олар түсік түсіруді білдіреді. Түсіндегі қабық немесе қабық екіжүзділікті, сүйіспеншілікті, көрнектілікті және ісінген басты білдіреді. (Сонымен қатар Теріні қараңыз)"}, {"id": "slingshot", "label": "Slingshot", "category": "Құралдар", "meaning": "(Итарқа, Катапульт) Түсінде науқастың алдына итарқа әкелу - оны жаңа жерге апару немесе оның өліп, жерлеуін білдіруі мүмкін. Түсіндегі тайғақ қамқоршыны кеңседен шығаруды немесе нашақорлықтан айығуды білдіреді немесе хабаршы болуы мүмкін. Түсінде басқаларға тас лақтыру үшін итарқаны пайдалану да оларға қатты қарғыс айтуды білдіреді. Түсінде әйелдің өзіне тас лақтыру үшін тайғақпен лақтырғанын көрсе, бұл сиқырлық немесе бақсылық дегенді білдіреді. Түсіндегі илан - бұл әділ және ауыр сөздерді білдіреді. Түсінде тайғақ ұстап, атуға дайындалу - адамның әділ және шындықты айтуға деген күші мен табандылығын білдіреді. Түсінде тайғақ ұстаса, бірақ оны тас лақтыру үшін қолданбаса, күнәсі үшін өкінетінін білдіреді."}, {"id": "spadix", "label": "Spadix", "category": "Өсімдіктер", "meaning": "(Пальма бұтағын, пальма жапырақтарын, тозаңды қараңыз)"}, {"id": "spathe", "label": "Spathe", "category": "Өсімдіктер", "meaning": "(Тозаңды қараңыз)"}, {"id": "spica", "label": "Spica", "category": "Аспан денелері", "meaning": "(Шоқжұлдыздарды қараңыз)"}, {"id": "spireas", "label": "Spireas", "category": "Өсімдіктер", "meaning": "(Шалғынды қараңыз)"}, {"id": "squill", "label": "Squill", "category": "Өсімдіктер", "meaning": "(Пияз) Түсінде шыбын-шіркей еркелігімен аты шыққан ұятсыз және жемқор адамды бейнелейді. Түсінде қолында шибер ұстау - оған ең нашар беделге ие болатын нәрсені іздеуді білдіреді."}, {"id": "starling", "label": "Starling", "category": "Жануарлар", "meaning": "(зоол.) Түсінде жұлдызды балық аскет, Алланың қалауына мойынсұнушы, шынайы иманды, сабырлы, саяхатшы немесе жолда серік болатын адамды бейнелейді. Кімде-кім түсінде жұлдызды ұстап тұрғанын көрсе, бұл оның осындай дәрежедегі адамды кездестіретінін білдіреді. Түсінде оның етін жесе немесе қауырсындарын жұлып алады, яғни пайда көреді. Түсіндегі жұлдызша жақсы істерді жаман нәрселермен араластыру элементін немесе бай да, кедей де емес, адал да, арам да емес адамды білдіруі мүмкін. Түсінде жұлдызды көру қорлауды, азға қанағат етуді білдіреді немесе жазушыны бейнелеуі мүмкін. (Сонымен қатар қарлығашты қараңыз)"}]