[{"id": "a-bunch-of-grapes", "label": "A bunch of grapes", "category": "Food", "meaning": "(See Grapes)"}, {"id": "ai-azhar-mosque", "label": "AI-Azhar mosque", "category": "Objects", "meaning": "(See Masjid)"}, {"id": "aaron", "label": "Aaron", "category": "Prophets", "meaning": "Seeing the Prophet Aaron (upon whom be peace) in a dream means exaltedness, leadership, or that one may become an Imam, a vice-regent of a great person, and perhaps suffer from many adversities because of it. Finally, he will triumph and attain his goals, or he may destroy a tyrant and an unjust ruler. If a warrior sees God's prophet Moses or his brother the prophet Aaron, upon both of them be peace and blessings, in a dream, it means that he will be victorious and triumph over his enemy."}, {"id": "abacus", "label": "Abacus", "category": "Tools", "meaning": "(Calculator) In a dream, an abacus represents social order, conformity, and uprightness. Seeing an abacus in a dream also reflects one's own state and conduct. If the frame and beads are in good condition, operate smoothly and smell fragrant in the dream, the abacus then denotes one's uprightness and good conduct. If they look dirty, greasy and rough to handle in the dream, then they denote the ill management of one's life or business. If one sees an abacus in such a condition in his dream, it may also represent unsanitary food preparation, a greasy spoon restaurant, or it could mean abating the declared weight or value of a merchandise. An abacus in a dream also may represent a well behaved child, a student, a teacher, or a judge. If one turns into an abacus in a dream, it means an illness or a calamity. An abacus in a dream also means that one's patience, contentment and trust in God Almighty will reserve him a generous reward. (Also see Record keepers)"}, {"id": "abandoned-infant", "label": "Abandoned infant", "category": "Types of People", "meaning": "(See Orphan)"}, {"id": "abattoir", "label": "Abattoir", "category": "Objects", "meaning": "(See Slaughterhouse)"}, {"id": "abdomen", "label": "Abdomen", "category": "Human Body", "meaning": "(Venter) The surface part of the body between the chest and the pelvis in a dream represents one's strength and health condition, wealth, or poverty. (Also see Body)"}, {"id": "abel", "label": "Abel", "category": "Types of People", "meaning": "Seeing Abel, the second son of Adam, in a dream signifies suffering from people's jealousy, grievances, or chicanery, or the possibility of being killed by one's enemy. It also means that an unjust person will envy him. Seeing Abel in a dream also means piety, devotion to God Almighty, feebleness toward a woman, or making an offering to please God Almighty and entering the heavenly paradise as a reward. One who sees Abel in a dream should beware of his brethren and close friends, and he should fear for his life."}, {"id": "abhor", "label": "Abhor", "category": "Feelings", "meaning": "(See Hate)"}, {"id": "ablution", "label": "Ablution", "category": "Action", "meaning": "Taking an ablution and completing it by giving careful attention to details in a dream means fulfilling one's needs. Taking a second ablution to perform one's prayers without the ritual need to do so in a dream means an increase in one's light. Taking ablution with milk or honey in a dream means debts. Ablution is a proper deed in all religions. It is a guard, a clemency, assurance of the divine protection, and immunity from punishment. Taking an ablution to perform one's prayers in a dream means entering under God's protection against what one may fear. It is reported in the traditions that God Almighty has said to Moses, upon whom be peace: \"When you are seized by fear, take your ablution and direct your family to enter the sacrament of prayers.\" Washing one's body in a dream is either performed in preparation for prayers or to wash away impurities. Taking ablution inside a tunnel, or taking a complete ritual bath in a dream, means recovering a stolen object. Taking one's ablution and engaging in prayers in a dream means relief from distress and offering thanks to God Almighty for His protection and guidance. If a merchant sees himself praying without ablution in a dream, it means that he has entered into a business venture without capital. If a worker sees that dream, it means that he has no home to shelter him. If a ruler sees that dream, it means that he has no soldiers to protect him. If a sick person sees himself taking ablution while in bed in a dream, it means separation from his wife or a close friend. Taking ablution inside one's house in a dream means that one will move to a new house. Taking ablution in the street or the marketplace in public or in a bathhouse in a dream means a scandal, loss, and a curse. Taking ablution at the seashore or in a proper ablution area in a dream means dispelling one's fear, sorrow, or distress. Taking ablution while standing over a friend's head in a dream means inheriting him. Seeing a friend taking his ablution over one's head in a dream means suffering harm or a scandal that will be caused by such a friend. Taking ablution in a dream also means dispelling fears, recovering from an illness, paying one's debts, or repenting from sin. Taking ablution with hot water in a dream means falling sick. Wanting to take ablution and failing to find the proper means to perform it in a dream means failure of a project or facing adversities. (Also see Tayammum, Enacting, Prayers, Ritual bath)."}, {"id": "abode", "label": "Abode", "category": "Objects", "meaning": "(See Dwellings, House)"}, {"id": "abominable", "label": "Abominable", "category": "Mood", "meaning": "(See Shameful act)"}, {"id": "abraham", "label": "Abraham", "category": "Prophets", "meaning": "To see the Prophet Abraham, upon whom be peace, in a dream is a good sign of wealth, blessings, glad tidings, devotion, long life, assiduousness, healing of a sick, noble goals, righteous progeny, commanding good and forbidding evil, discarding bad company, compliance with the divine ruling, knowledge, guidance, success after failure and separation from one's family and kin to seek God's nearness and pleasure. In a dream, Abraham represents the element of compassion toward one's son and family, and sometimes he represents the element of adversities and finally reaching safety. (Also see Feast of Immolation, Station of Abraham)."}, {"id": "abscess", "label": "Abscess", "category": "Human Body", "meaning": "(Boil, Tumour, Ulcer, See Pimple)"}, {"id": "absolution", "label": "Absolution", "category": "Action", "meaning": "(See Amnesty, Pardon)"}, {"id": "abstention", "label": "Abstention", "category": "Action", "meaning": "(See Justice)"}, {"id": "abstinence", "label": "Abstinence", "category": "Action", "meaning": "(See Ascetic detachment)"}, {"id": "abundance", "label": "Abundance", "category": "Mood", "meaning": "(See Kawthar)"}, {"id": "abuse", "label": "Abuse", "category": "Action", "meaning": "(See Insult)"}, {"id": "acacia-tree", "label": "Acacia tree", "category": "Trees", "meaning": "(Arabic Gum, Dyes, Mimosa tree, Ornamental flowers, Perfume) Seeing this tree in a dream means stinginess, evil, and behaving with the actions of the dwellers of hellfire."}, {"id": "accolade", "label": "Accolade", "category": "Action", "meaning": "(See Embrace)"}, {"id": "accomplished", "label": "Accomplished", "category": "Mood", "meaning": "(See Finished business)"}, {"id": "accoucheuse", "label": "Accoucheuse", "category": "Types of People", "meaning": "(See Dromedary rider. Midwife)"}, {"id": "accountability", "label": "Accountability", "category": "Action", "meaning": "In a dream, accountability has various levels of interpretation. If an employee sees that he has received his account promptly in a dream, it means a rise in rank and an increase of one's income. If one sees himself under strict supervision or reckoning in a dream, it means humiliation, distress, or perhaps loss of his job. If a person is investigated in a court of people he does not know in a dream, it means that he has strayed into innovation and will remain accountable for his deeds. (Also see Reckoning)"}, {"id": "accountant", "label": "Accountant", "category": "Types of People", "meaning": "In a dream, an accountant represents a stern person who also has the power to carry out sentences. If his accounting is strict and detailed in the dream, it means that his sentence will be severe and painful. (Also see Accountability)"}, {"id": "accumulating-debts", "label": "Accumulating debts", "category": "Action", "meaning": "(See Tripping)"}, {"id": "accursed-son", "label": "Accursed son", "category": "Types of People", "meaning": "(See Recalcitrant child)"}, {"id": "ache", "label": "Ache", "category": "Human Body", "meaning": "(See Pain)"}, {"id": "acknowledging-devotion", "label": "Acknowledging devotion", "category": "Action", "meaning": "If one sees himself acknowledging devotion or worship of another human being in a dream, it means enmity with that person. But if one sees himself confessing his wrongdoing in a dream, it means regaining honour, dignity, and true repentance. To confess to a murder in a dream means that one will attain peace, leadership, or advancement to a supervisory job."}, {"id": "acknowledgment", "label": "Acknowledgment", "category": "Action", "meaning": "(See Fame)"}, {"id": "acorn", "label": "Acorn", "category": "Plants", "meaning": "(See Gullnuts)"}, {"id": "acquaintances", "label": "Acquaintances", "category": "Types of People", "meaning": "(See Connections)"}, {"id": "acquittal", "label": "Acquittal", "category": "Action", "meaning": "(See Amnesty. Pardon)"}, {"id": "acrimony", "label": "Acrimony", "category": "Feelings", "meaning": "(See Teeth)"}, {"id": "acumen", "label": "Acumen", "category": "Mood", "meaning": "(See Perspicacity)"}, {"id": "adam", "label": "Adam", "category": "Prophets", "meaning": "Father of humanity, upon whom be peace. In a dream, Adam represents the elements of sin and repentance. He also represents one's father or the governor of the land. When seen standing nobly, Adam also represents attainment and honour. If Adam addresses the person in question in the dream, it means that the latter will acquire knowledge. If one becomes Adam or a companion of his, and should he qualify for such promotion, it means that he will attain it. Adam also represents the element of temporal existence. Seeing him in a dream also implies understanding, for he was the first to see dreams in this world and to interpret the names of things. Adam also represents reunion with one's family, concerns, forgetfulness, and worries."}, {"id": "adjuration", "label": "Adjuration", "category": "Action", "meaning": "(Ingratitude. See Uncertainty)"}, {"id": "adjuring", "label": "Adjuring", "category": "Action", "meaning": "(To command solemnly, to swear by God, or to take an oath.) If one sees himself swearing in God's Name before someone in a dream, it means that the other person will deceive him. To swear solemnly by the stars, the celestial signs, or by any physical sign in a dream means arrogance, deception, humiliation, hypocrisy, or heedlessness. If one is truthful in his oath in a dream, it means that he will win his argument, speak the truth, or perform an act that pleases God Almighty. To swear by God in a dream when failure to perform requires atonement means following the truth and emulating the leading example of God's Prophet, upon whom be peace."}, {"id": "adjust", "label": "Adjust", "category": "Action", "meaning": "(See Organize)"}, {"id": "admonition", "label": "Admonition", "category": "Action", "meaning": "(Destruction, Harvest) To impel one's animal to drive faster in a dream means heeding admonition. (Also see Washing)"}, {"id": "adobe", "label": "Adobe", "category": "Objects", "meaning": "(Money, Sun-dried bricks) Seeing blocks of adobe in a dream signifies money. Each adobe represents a denomination of often thousands or one hundred thousand units of money, depending on the type of work one does in wakefulness. If adobes are used for construction in a dream, then they mean good work, good deeds, or they could represent a religious person. An adobe in a dream also represents a servant. Building a house with adobes in a dream means unity and love between the father and his children. If an adobe falls to the ground in a dream, it means the death of a sick person, or disunity in the family, or dispersal of one's children. Manufacturing adobes in a dream means an increase in the number of one's workers or employees. Each adobe represents a worker. Building a house with adobe in a dream also means leadership. A pile of adobes in a dream means a pile of money. (Also see Adobe maker, Bricks)"}, {"id": "adobe-maker", "label": "Adobe maker", "category": "Types of People", "meaning": "In a dream, an adobe maker represents someone who earns his money from his sweat and saves his earnings. Moulding these bricks and drying them in the sun in a dream means prosperity. Handling wet adobes or stampeding a wet adobe mix and smoothing it in a dream means distress, toiling, sorrow, or corruption. Half-dried moulds of adobes placed under the sun in a dream represent workers or servants. (Also see Adobe, Bricks)"}, {"id": "adornment", "label": "Adornment", "category": "Objects", "meaning": "(See Apparel)"}, {"id": "adulation", "label": "Adulation", "category": "Mood", "meaning": "(Flattery, Sociability, Sycophancy) Adulation and sociability in a dream mean showing respect and esteem, lauding someone, being true to oneself or being charitable. (Also see Flattery)"}, {"id": "adultery", "label": "Adultery", "category": "Action", "meaning": "(Rape) Committing the abominable and forbidden act of adultery in a dream means betrayal. If one sees himself doing so in a dream, it means that he will betray his wife. An unknown woman is better here than a known woman. Adultery in a dream also means theft. If one sees an adulteress soliciting him for fornication in a dream, it means that he might be lured to earn unlawful money. If one commits adultery with a young and beautiful woman in a dream, it means that he will place his earnings in a well-guarded place or a coffer. If a strong person commits adultery in his dream and if he has to face the divine ordinance and chastisement for his sin in the dream, it means that his authority will expand. If the person in the dream qualifies for leadership, then he will be endowed with one. If one sees himself committing adultery with the wife of a close friend in a dream, it means that he will take some money from him. If one reads the ruling of the divine ordinance concerning the punishment of adulterers in a dream, it means that he is an adulterer. If one deals with an adulteress or with a woman who has committed adultery in a dream, then such a woman represents the world and its seekers. If a student on the path of God Almighty, who is known to have piety, good conduct, and who has the look of a believer, sees himself dealing with an adulteress or a woman who has committed adultery in a dream, it means that he will join the company of a gnostic and learn wisdom at his hand. If one sees a man and a woman sitting alone in an intimate setting in his dream, and if he recognizes them, it means that he desires some worldly interests from such a man. If a man sees himself raping a young woman in a dream, it means that he hides his savings in an unknown place. If he is caught after that, and if the divine ordinance is exacted in the dream, his dream means that he will follow the path of knowledge and understanding of religious jurisprudence. If one commits adultery with an adulteress in a dream, it means that he will face severe trials. If one enters a brothel in his dream and finds it impossible to leave that place, it means that he may die shortly. If one sees himself sleeping with someone else's wife, while the husband is not minding in a dream, it means that the husband will entrust him with his home to manage. If one marries an adulteress in a dream, it means that he is an adulterer. (Also see Sexual intercourse)"}, {"id": "advantage", "label": "Advantage", "category": "Mood", "meaning": "(See Booty)"}, {"id": "adversary", "label": "Adversary", "category": "Types of People", "meaning": "(See Cheese. Opponent)"}, {"id": "adverse", "label": "Adverse", "category": "Mood", "meaning": "(See Opponent)"}, {"id": "advice", "label": "Advice", "category": "Action", "meaning": "If one receives advice from his enemy in a dream, it means deception, trickery, cheating, duplicity, stratagem, dishonesty, and arrogance. (Also see Soliciting advice)"}, {"id": "adze", "label": "Adze", "category": "Tools", "meaning": "(Ax) Seeing an adze in a dream signifies continuing progress, permanence, stability, livelihood, profits, money, and benefits from one's wife or child. An adze in a dream also could represent the head of a project or the manager to whom one must report about the progress of his work, or it could represent a teacher, a wise man, an educator, one's mouth, one's servant, a greedy person, a sharp tongued woman or it could represent the arrival of a traveller. (Also see Ax)"}, {"id": "affectation", "label": "Affectation", "category": "Mood", "meaning": "Witnessing affectation in a dream is a sign of committing a forbidden act or an evil act in wakefulness. (Also see Shell)"}, {"id": "affection", "label": "Affection", "category": "Feelings", "meaning": "(See Amity)"}, {"id": "affiliation", "label": "Affiliation", "category": "Action", "meaning": "(See Partnership)"}, {"id": "affinity", "label": "Affinity", "category": "Feelings", "meaning": "(See Correspondence)"}, {"id": "affront", "label": "Affront", "category": "Feelings", "meaning": "(See Digging up the past)"}, {"id": "african-dances", "label": "African dances", "category": "Action", "meaning": "(See Tap)"}, {"id": "african-rue", "label": "African rue", "category": "Plants", "meaning": "(See Rue)"}, {"id": "agate", "label": "Agate", "category": "Objects", "meaning": "(Quartz. See Stone)"}, {"id": "agent", "label": "Agent", "category": "Types of People", "meaning": "(See Bodyguard)"}, {"id": "aggrandizement", "label": "Aggrandizement", "category": "Action", "meaning": "(See Giant)"}, {"id": "agitation", "label": "Agitation", "category": "Mood", "meaning": "A man's agitation or explosion toward inanimate objects in a dream means either business losses or seizure of one's property by the authority. Agitation in a dream also means a calamity of an unknown disease or a worrisome illness."}, {"id": "agony", "label": "Agony", "category": "Mood", "meaning": "(See Agony of death. Death. Distress. Gambling. Uptight. Worries)"}, {"id": "agony-of-death", "label": "Agony of death", "category": "Mood", "meaning": "If one sees himself struggling with death in a dream, it means arguing about his religion, or doubt about God's revelations. Death rattling in a dream also signifies preparing to take a journey, marriage of an unmarried person, moving from one house to a new one, changing one's trade or repaying one's debt, or divorcing one's wife. If one sees himself in agony on his deathbed, combating the throes and pangs of death in a dream, it means that he is unjust toward himself or others. (Also see Death)"}, {"id": "agreement", "label": "Agreement", "category": "Action", "meaning": "(See Conformance)"}, {"id": "air", "label": "Air", "category": "Other", "meaning": "Standing in the air in a dream means being honoured or acknowledged by a governor, though it will not last. If one has exaggerated hopes, arrogance, pride, or if he is a self-centred individual, then his floating in the air represents mere disturbed dreams. Walking in the air without ascending or descending in a dream means receiving dignity, honour, and earning lawful money. If one does not qualify for it, then walking in the air in his dream means traveling. Hanging in the air between the heavens and the earth in a dream represents a concerned heart and uncertainty about what to do! Falling in the air in a dream means despair or loss of status in wakefulness. Falling in a dream also means relief from distress, wantonness, or satisfying one's needs. Clear, fresh, and pure air in a dream represents a good time to take a trip for business or pleasure. Air in a dream also represents one's desire and passion. Thus, disobeying one's mind, desire, and passion in a dream means entering the heavenly paradise. Following one's desires in a dream means negligence of one's religious duties. Standing up in the air and speaking loudly in a dream means blessings, favours, money, honour, and fame. Sitting in the air in a dream means arrogance and self-deception regarding religious opinions. Building a house up in the air or placing a mat in the air, or raising a tent in the air, means the death of a sick person, and what is built in this case is one's coffin. If a governor sees that dream, it means his dismissal from his office or his death. Seeing that dream after a wedding or after having marital relations with one's wife means mistrust and loss. It also means involvement in an uncouth action, lacking knowledge of the Holy Book and prophetic traditions, because what one has built lacks a foundation. Flying in the air in a dream may mean traveling. Flying with wings in a dream has stronger connotations and is safer. The wings here will represent money or power. Swimming in the air means benefits or business travels. If the air looks opaque in one's eyes, so that he cannot see the skies in his dream, it means problems with one's superior. If one does not have a boss, then it means that they may lose sight. If all the people witnessed the air as opaque or red in the dream, then it means a major calamity and a trying adversity. (Also see Ascending in the Skies, Flying)"}, {"id": "air-blower", "label": "Air blower", "category": "Tools", "meaning": "(See Bellows. Fan)"}, {"id": "aircraft", "label": "Aircraft", "category": "Objects", "meaning": "(Airplane, Coffin, Flying ship, Knowledge. Also see Kite, Ship)"}, {"id": "airplane", "label": "Airplane", "category": "Objects", "meaning": "(Aircraft, Coffin, Flying ship, Knowledge. Also see Kite, Ship)"}, {"id": "aisha", "label": "Aisha", "category": "Types of People", "meaning": "(Wife of God's Messenger, upon whom be peace, and Mother of the believers, God be pleased with her) Seeing her in a dream means blessings and bounty. If a woman sees 'Aisha in a dream, it means earning a high station, a blessed fame, developing righteousness, and earning the love of one's husband and parents."}, {"id": "alarm-clock", "label": "Alarm clock", "category": "Objects", "meaning": "(Timepiece) Seeing an alarm clock in a dream means exposing ills, the richness of a poor person, or fulfilling a promise. (Also see Clock)"}, {"id": "albino", "label": "Albino", "category": "Types of People", "meaning": "(See Elf)"}, {"id": "alcohol", "label": "Alcohol", "category": "Drinks", "meaning": "(See Beer, Intoxicants, Nonalcoholic wine)"}, {"id": "alcoholic", "label": "Alcoholic", "category": "Types of People", "meaning": "(Drunkard, Enmity, Evil, Hatred, Inebriate, Temptation, Tippler. Also see Beer, Intoxicants, Non-alcoholic wine, Wine)"}, {"id": "alcyone", "label": "Alcyone", "category": "Celestial Bodies", "meaning": "(See Constellations)"}, {"id": "aldebran", "label": "Aldebran", "category": "Celestial Bodies", "meaning": "(See Constellations)"}, {"id": "aldromeda", "label": "Aldromeda", "category": "Celestial Bodies", "meaning": "(See Constellations)"}, {"id": "alertness", "label": "Alertness", "category": "Mood", "meaning": "(See Wakefulness)"}, {"id": "alhena", "label": "Alhena", "category": "Celestial Bodies", "meaning": "(See Constellations)"}, {"id": "ali", "label": "Ali", "category": "Types of People", "meaning": "('Ali bin 'Abi Tiilib, God bless his countenance, cousin and son-in-law of God's Messenger, upon whom be peace.) Seeing him in a dream means victory over one's enemy. Seeing him in a place or a mosque where people are mourning him, or performing the funeral prayer on him, or carrying his coffin, or prostrating to him in a dream means becoming a Shahid or gathering one's strength for a rebellion or to create divisiveness, or it could mean hypocrisy. If a scholar sees him in a dream, it means that he will earn increased knowledge, asceticism, reverence, and strength. Seeing him in a dream also means capture by one's enemy, migrating from one country to another, and mostly to die as a martyr. Seeing 'Ali in a dream also means having a blessed progeny, vanquishing one's enemy, presiding over the believers, hardships during travels, booty, manifestation of blessings and miracles, acquiring extraordinary knowledge, following the leading practices of God's Messenger, upon whom be peace, or fulfilment of one's commands. If one sees him as an old man in a dream, it means establishing a connection with the leadership of the land and profiting from it. Seeing him with wounds over his body in a dream means that one will become subject to people's slander and defamation."}, {"id": "aliment", "label": "Aliment", "category": "Food", "meaning": "(See Product)"}, {"id": "alimony", "label": "Alimony", "category": "Action", "meaning": "(See Family support)"}, {"id": "allah", "label": "Allah", "category": "Other", "meaning": "God Almighty, Lord, Creator and Cherisher of the universes. There is nothing like unto Him, and He is the All-Hearing, the Al-Seeing Lord. Seeing God in a dream can be interpreted according to one's state of being. If one sees Him in His glory and majesty, without descriptive designation, without ascription of human characteristics to Him, and without depiction or portrayal in the dream, it is an indication of glad tidings for both this world and the hereafter. These blessings may also continue to affect the lives of one's progeny. If one sees Him otherwise in a dream, it means confusion, and particularly if the Almighty Lord does not address him. If an ailing person sees Him in a dream, it means that he will soon die and come to meet Him. If a straying soul sees God Almighty in a dream, it will find guidance. If an oppressed person sees Him, it means that justice will prevail and he will triumph over his oppressors. Hearing God's words without designation represents the imagination of the person in the dream. Perhaps hearing His words in a dream appeases one's heart and increases the person's drive for success. Hearing God's words without seeing Him represents the rising of one's station. If one receives revelations from behind a veil in a dream, it means mental confusion and innovation. This is most true if a messenger comes in one's dream and describes the one who spoke as God. In this case, the dream is a nightmare, because God Almighty cannot be depicted according to human descriptions. If one sees a picture of God in his dream, it means that he is a liar who ascribes images to God Almighty that do not befit His Majesty and Glory. If one hears God Almighty talking to him directly and if he can focus on Him in the dream, it means that he will be encompassed with God's mercy and blessings. If one sees God Almighty in a dream, it means that he will look at His Divine countenance in the hereafter. Seeing God Almighty seated on the Divine Throne in a dream means elevation of one's rank, knowledge, and increase in his wealth. If one sees himself running away to hide from God Almighty in a dream, it means that he will change the course of his devotion into heedlessness. Seeing a veil separating the servant and his Lord in a dream means that one will commit major sins and abominable actions. If one sees his Lord frowning at him, whereby he could not bear the effulgence of God's light, or if he is seized by a shock and immediately commences to repent and pray for forgiveness in the dream, it means that such a person is indulging in abominable actions, and that he is a despicable sinner who follows his mind and desires, and that he is an innovator of religious thoughts who misleads the people. If one hears God Almighty talking to him in a dream, it represents an admonition and a warning to abstain from sin. If one hears God Almighty talking to him in a dream, it also means that one is more assiduous in his recital of the Qur'an. If one hears God Almighty talking to him with words he cannot understand, then if He anoints him and blesses him in the dream, it means that God Almighty will bring him nigh unto Himself and exalt his station. If one sees God Almighty in a form resembling one's father, a brother, or a relative and showing His kindness or blessing him in a dream, it means that he will be afflicted with a calamity and a major illness. If a righteous person sees himself standing before God Almighty in reverence and filled with awe in a dream, it means that mercy will encompass him and help him to further his growth. The same interpretation applies if one sees himself prostrating before Him. If God Almighty speaks to someone from behind a veil in a dream, it can also represent a good worshipper, but if the Divine address takes place without a veil in the dream, it means falling into sin. If God Almighty names someone in his dream with his birth name, then adds another title to it, it means rising in station and rank. If one sees God Almighty angry with him in a dream, it means that his parents are displeased with him. This description includes seeing oneself falling from the sky or the top of a mountain. If a devoted servant sees God Almighty kissing him in a dream, it applies to his growing devotion and reward. Fearing God Almighty in a dream reflects eminence, peacefulness, quiescence, wealth of being, and disregard for material needs. (Also see Carriers of the Divine Throne, Divine Throne, Educator, God's will, King)"}, {"id": "allergic-disorder", "label": "Allergic disorder", "category": "Human Body", "meaning": "(See Hives)"}, {"id": "alley", "label": "Alley", "category": "Objects", "meaning": "(Corridor, Hallway, Lane, Long narrow lane) Entering a lane in a dream means falling under suspicion and particularly if it has curves. A lane in a dream also means breaking one's oath or mixing and confusing values, or it could mean a road, a method of operating a business, or the techniques used by a craftsman in his trade. (Also see Lane, Road)"}, {"id": "alliance", "label": "Alliance", "category": "Action", "meaning": "(See Allies, Partnership)"}, {"id": "allies", "label": "Allies", "category": "Types of People", "meaning": "In a dream, allies are good news for someone who seeks to find partners. As for a sick person, they mean death."}, {"id": "alligator", "label": "Alligator", "category": "Animals", "meaning": "An alligator in a dream represents a knowledgeable person who guides people from darkness into light. (Also see Crocodile)"}, {"id": "allowance", "label": "Allowance", "category": "Objects", "meaning": "(See Raise)"}, {"id": "allurement", "label": "Allurement", "category": "Mood", "meaning": "(See Trespassing)"}, {"id": "almighty-god", "label": "Almighty God", "category": "Other", "meaning": "(See Allah)"}, {"id": "almond", "label": "Almond", "category": "Plants", "meaning": "(Cure, Bitter almond, Sweet almond, Truth) In a dream, an almond represents a cure for an illness, impeachment of a governor, or loss of a job. In a dream, an almond also represents a deceased person in his shroud or his grave. Yet, seeing fresh green almonds in season in a dream means profits and blessings. Sweet almonds in a dream represent lawful money or earnings, depending on the quantity one sees in their dream. Eating sweet almonds in a dream means profits, though to be earned with a fight. Plucking an almond from a tree in a dream means earning money from a niggardly person with a fight. An almond tree in a dream also represents one who is stingy with people, though generous with his wife and children. Eating sweet almonds in a dream also means tasting the sweetness of one's faith. Bitter almond in a dream means truth. Eating almonds in a dream means money and good health. An almond tree also represents a stranger. Seeing oneself showered with almond shells in a dream means receiving a new garment. Dry almonds in a dream mean sorrow, rage, and clamour. Eating a leaf from an almond tree in a dream means receiving money from someone in authority and enjoying the gift."}, {"id": "alms-tax", "label": "Alms tax", "category": "Action", "meaning": "(Tithe) Paying the dues alms tax in a dream means an increase in one's income or prosperity. If a rich man sees himself paying the due tithe on his liquid assets in a dream, it means an increase in his wealth, spiritual growth, and receiving the blessing of performing one's obligatory prayers on time. Payment of one's due tithe also represents protection from one's enemies. Paying alms tax in a dream also means performing supererogatory prayers during the night, repayment of debts, absolution, or it could mean paying a fine. Alms tax in a dream also means the death of a dear person in the family, or it could mean losing a limb due to an illness or an accident, giving a charity for the benefit of a departed soul, or payment of one's debts. Thus, paying alms tax in a dream may mean an increase in one's wealth, recovering from illness, or payment of one's debts, all of which earn levels of exaltation and blessings. To pay charity on one's property of silver in a dream means begetting a son, or it could mean getting married. If it is a poor person, then paying alms in a dream represents God's acceptance of one's deeds. If he is a sinner, it means that he will repent of sin and earn lawful money, and if he is a disbeliever. it means that he will become a believer. (Also see Charity, Endowment, Tithe collector)"}, {"id": "aloe", "label": "Aloe", "category": "Plants", "meaning": "(bot. Cactus) Eating from an aloe plant or smelling it in a dream means sorrows, sadness, separation between husband and wife, or enduring an unhappy life."}, {"id": "aloe-perfume", "label": "Aloe perfume", "category": "Objects", "meaning": "Seeing or manufacturing aloe perfume in a dream means religious innovation, dirty money, evil reputation, placing things in the wrong place, or it could mean doing good deeds for profit. (Also see Civet, 'Ud)"}, {"id": "alopecia", "label": "Alopecia", "category": "Human Body", "meaning": "(See Boldness)"}, {"id": "altar", "label": "Altar", "category": "Objects", "meaning": "(See Temple)"}, {"id": "alterations", "label": "Alterations", "category": "Action", "meaning": "(Couturier, Garment alteration, Hemming, Tailoring) Seeing a tailor doing alterations to a garment in a dream signifies dispelling one's worries, overcoming one's difficulties, eradicating dishonesty, dispelling conceit, or perhaps he could denote music, elation, sexual intercourse, or someone who exhausts himself and strives in every way to help others. A tailor doing alterations to a garment in a dream also could represent a preacher or a teacher at whose hands many people will repent of their sins and walk on God's path. A tailor doing alterations and handling trims and the ends of things represents a charitable person who makes someone happy by taking something from him and giving it to others. (Also see Tailor)"}, {"id": "alum", "label": "Alum", "category": "Objects", "meaning": "(Crystalline compound containing aluminium, Fake jewellery) In a dream, owning or having a piece of alum in any form means money. If one melts it in a dream, it means that he argues for the sake of a cheap matter. If one sees a piece of alum or a yellow piece of metal in a dream, it means that he will be addressed with harsh words or become subject to slander and defamation."}, {"id": "amazake", "label": "Amazake", "category": "Drinks", "meaning": "(Japanese fermented rice drink, slightly sweetened and a non-alcoholic drink also found in Egypt) Drinking amazake in a dream means comfort and prosperity. If an unmarried man sees himself drinking this fermented rice drink in a dream, it may mean that he considers it lawful to live unmarried with divorced women."}, {"id": "amber", "label": "Amber", "category": "Objects", "meaning": "(Musk, Spermaceti) To perfume or anoint oneself with amber in a dream means an increase in one's earnings through a rich acquaintance or earning money through a notable person or through a man of knowledge. Seeing a person mixing amber in a dream denotes a praiseworthy person, an architect, or a builder. Anointing oneself with amber in a dream signifies hearing praises. Amber in a dream also denotes valuable properties, farms, fruit gardens, or a fellowship of knowledge and wisdom. The fragrance of amber in a dream means a storm, wind, a breeze, or it could represent benefits coming from the direction one recognizes in the dream. If one sees himself burning amber in a dream, it means that he is indulging in religious innovations, corruption, losing face, placing something in the wrong place, dealing with tainted money, bribing a government official, lobbying for a selfish cause, and supporting a political campaign. (Also see Incense, Galia moschata, Perfumery)"}, {"id": "ambergris", "label": "Ambergris", "category": "Objects", "meaning": "(See Galia moschata)"}, {"id": "ambiguity", "label": "Ambiguity", "category": "Mood", "meaning": "(See Fog)"}, {"id": "ambulate", "label": "Ambulate", "category": "Action", "meaning": "(See Circumambulation)"}, {"id": "ambush", "label": "Ambush", "category": "Action", "meaning": "An ambush for an assiduous student in a dream means acquiring knowledge, and it could be interpreted as spoiling the performance of one's religion."}, {"id": "amenities", "label": "Amenities", "category": "Objects", "meaning": "(See Dwellings, House, Luxuries shop)"}, {"id": "amity", "label": "Amity", "category": "Mood", "meaning": "(Affection, Benevolence, Love) In a dream, amity between people means a wise judgement, understanding the consequences of things, realizing one's benefits, unity, and balance."}, {"id": "ammonia", "label": "Ammonia", "category": "Objects", "meaning": "Mixing a solution of ammonia in water in a dream means hoarding tainted money and spending it in evil and unlawful ways."}, {"id": "amnesty", "label": "Amnesty", "category": "Action", "meaning": "(Absolution, Acquittal, Pardon) To be granted amnesty in a dream means a safe passage in real life. (Also see Pardon)"}, {"id": "amulet", "label": "Amulet", "category": "Objects", "meaning": "(Incantation, Prayer, Talisman, A prayer worn around the neck or cherished to ward off evil and attract good fortune.) When a prayer is read in a dream following the prophetic traditions to help a sick person in the dream, it means protection from sufferings, dispelling distress, and dissipation of sadness. If the amulet or the talisman carries a personal spell or wish, then it is nothing but lies, falsehood, affectation, and hypocrisy. If the person who recites the incantation in the dream is a craftsperson, it means that he defrauds the people and fakes his product. If he is a man of knowledge, it means that he lies or hides his true knowledge, abstains from giving true advice, or perhaps he offers a poor quality of worship. If the one reciting the incantation in the dream is a judge, it means that he will give a wrong judgment. If one is given to drink some water over which specific prayers were recited in a dream, it means longevity. If one sees himself reciting an incantation, or if he hears incantations recited on his behalf in a dream, it will all be false except for a prayer that recites: 'In the Name of God, the Most Merciful, the Most Compassionate' or contains a Qur'anic revelation."}, {"id": "amusement", "label": "Amusement", "category": "Mood", "meaning": "Diversion or amusement in a dream is a sign of glad tidings, recovery for the sick, prosperity for the poor, honour after humiliation, scientific advancement, higher position, or it could mean travel. (Also see Games)"}, {"id": "anchorman", "label": "Anchorman", "category": "Types of People", "meaning": "(See Broadcaster)"}, {"id": "anemones", "label": "Anemones", "category": "Plants", "meaning": "(bot. See Red anemones)"}, {"id": "angel-of-death", "label": "Angel of death", "category": "Types of People", "meaning": "(See Izrail Robbery, Osprey)"}, {"id": "angels", "label": "Angels", "category": "Types of People", "meaning": "(Celestial beings, Heavenly beings) If one sees the heavenly angels (arb. Malii'ika) coming before him to congratulate him in a dream, it means that God Almighty has forgiven that person his sins and endowed him with patience, through which he will attain success in this life and in the hereafter. If one sees the heavenly angels greeting him or giving him something in the dream, it means that his insight will grow. or that he may be martyred. If one sees angels descending upon a locality that is raging with a war in a dream, it means that the dwellers of that place will achieve victory. If the people are suffering from adversities, it means that their calamities will be lifted. Flying with angels or visiting the heavens in their company in a dream may mean that one will die in the station of a martyr and receive God's utmost blessings. If one feels scared of the angels in his dream, it means that a fight, an argument, or awesome trials will befall that locality. In general, to see the angels descending from the heavens to the earth in a dream means enfeeblement of those who have doubt, and strength for those who have faith and certitude. If one sees the angels prostrating to him in a dream, it means that all his needs will be satisfied, and he will be endowed with good conduct, good behaviour, and a blessed fame. If one sees them looking like women in the dream, it means that he lies before God Almighty. If a pious person sees an angel telling him in a dream, \"Read God's Book.\" It means that one will attain happiness in their life. If an impious person sees an angel in a dream telling him, \"Read your records.\" It means that he may go astray. If one sees the angels giving him glad tidings and congratulating him in a dream, it means that he will beget a blessed son who will grow to be righteous and an example to be followed. If one sees a gathering of angels in a town in his dream, it means that a pious man, or an ascetic, or a great scholar will die in that locality. If one sees himself looking at the angels in the skies in a dream, it means that he may suffer the loss of a son or his wealth. Seeing the celestial angels (arb. Ruhaniyyeen) in a dream means gaining honour, dignity, blessings in one's life, profits, and a good fame, developing spiritual inner insight, or becoming a business manager. Near the end of one's life, one who sees such a dream will also suffer from people's slander and backbiting. He will also lose his good reputation to people's envy and evil qualities, and he will live in tight financial conditions. If one becomes an angel in a dream, it means that he will receive honour, power, overcome his adversities, dispel his distress, and win his freedom, or it could mean that he will rise in station. If one sees the angels greeting him and shaking hands with him in a dream, it means that God Almighty will endow him with wisdom, clarity, and insight. Angels in a dream also represent one's closest witnesses, guardians, police officers, or the emissaries of a ruler. Wrestling with an angel in a dream means loss of status. Wrestling with an angel in a dream also means suffering from distress, trouble, humiliation, and falling in rank. Seeing angels entering one's house in a dream means that a thief will burglarize such a house. If angels disarm someone in a dream, it means that he will lose his wealth and strength, or that he may divorce his wife. If angels offer the person a tray of fruits in a dream, it means that he will depart from this world as a martyr. If angels curse someone in a dream, it means that he has little care for his religion. If one sees a gathering of heavenly angels together with the angels of hellfire in a dream, it means enmity and divisiveness. If a sick person sees himself struggling with an angel in a dream, it is a sign of his death. If one sees an angel taking the form of a child in a dream, it represents one's future. If he sees an angel as a youth, the youth then represents the present time and whatever events will take place during it. If the angel appears in the form of an old man in the dream, he represents the past. If one sees the angels praying and asking for God's forgiveness on his behalf in a dream, it means that one's spiritual and religious life will grow for the better, and that he will become wealthy. If one sees angels descending upon a cemetery in a dream, it signifies the presence of blessed and righteous souls in that place. If one sees angels walking in the markets in a dream, it means that the merchants are trifling with prices and playing with the measures. If the angels who are in charge of punishing the sinner in hell walk before a dying person and he does not fear them in the dream, it means peace and tranquillity. If one sees the angels teaching a dying person how to recite his final rites in a dream, it means glad tidings and attainment of what his heart desires, a guarantee of his safety, happiness, joy, and of having a blessed and good heart. If he sees them angry with him or beating him or subduing and taming him in a dream, it means that he may revert to sin, earn the displeasure of his parents, disdain for complying with God's commands, or he could even come to deny the necessity of God's religion. Such angels in a dream also represent the emissaries of a governor or his deputies. If a dying person is told in a dream that no angels have come to see him, then it is a testimony of his good character and piety, or it could mean payment of one's debts or recovery from an illness. Angels in a dream also could represent scholars, gnostics, or translators who understand people's languages and speak in many tongues. As for Munkar and Nakir, the angels who come to one's grave upon his burial to question him, seeing them in a dream means prosperity for a poor person, and finding work for a jobless person. (Also see Castration)"}, {"id": "anger", "label": "Anger", "category": "Feelings", "meaning": "(Fury, Indignation, Rage) Leaving one's home angry in a dream means entering a prison. If one gets angry for material gains in a dream, it means that he has disdain and contempt toward God's religion. However, should he get angry in his dream to defend God's rights, then it means gaining strength and power. Becoming angry for someone else's sake in a dream signifies a corrupt contract, a tainted agreement, a marriage consent with a hidden intent of a divorce to follow, fighting for unlawful earnings, or it could mean accumulating money from usury. In a dream, usury and anger mean falsehood in wakefulness. (See Foam, Frothing at the mouth, Sneezing, Suppressing one's anger)"}, {"id": "animal-bones", "label": "Animal bones", "category": "Animals", "meaning": "(See Bones)"}, {"id": "animals", "label": "Animals", "category": "Animals", "meaning": "(See Sound of animals)"}, {"id": "animosity", "label": "Animosity", "category": "Feelings", "meaning": "(See Enemy, Enmity)"}, {"id": "anklets", "label": "Anklets", "category": "Objects", "meaning": "In a dream, anklets represent one's son. Wearing golden anklets in a dream means a severe illness, or that one may commit a major sin. However, if a woman sees herself wearing anklets in a dream, it means that she is safe and protected. If she is unwed, it means that she will marry a gracious and generous person with whom she will live happily and contentedly. If a man sees himself wearing a pair of golden anklets in a dream, it means adversities, distress, or imprisonment. It is said that anklets in a dream represent shackles in wakefulness, except for a wedding ring or a necklace. What a woman sees as beauty or imperfect in her anklets in a dream will reflect upon her husband. If she is unmarried, the anklet will then reflect on her adornment or makeup. In a dream, anklets also represent honour, wealth, dignity, and beauty."}, {"id": "annihilation", "label": "Annihilation", "category": "Action", "meaning": "(See Evanescence)"}, {"id": "announcement", "label": "Announcement", "category": "Action", "meaning": "(See Fame)"}, {"id": "announcer", "label": "Announcer", "category": "Types of People", "meaning": "In a dream, an announcer represents a man of dignity who manages people's business, including the high and the low, who brings unity between people, and whose services are most beneficial to everyone. (Also see Broadcaster, Piper)"}, {"id": "annoyance", "label": "Annoyance", "category": "Feelings", "meaning": "(See Asthma)"}, {"id": "anoint", "label": "Anoint", "category": "Action", "meaning": "Anointing oneself with perfumed oil or with liniments in a dream means acclamation of praiseworthy deeds. Applying a liniment as a treatment to construction labourers, mail carriers, or the like people in a dream means renewal of their strength, and an increase in their income. (Also see Amber)"}, {"id": "antelope", "label": "Antelope", "category": "Animals", "meaning": "(See Deer, Gazelle, Oryx)"}, {"id": "anthill", "label": "Anthill", "category": "Objects", "meaning": "An anthill in a dream represents a village. (Also see Village)"}, {"id": "antichrist", "label": "Antichrist", "category": "Types of People", "meaning": "(arb. Dajjal, Imposter) In a dream, the Antichrist represents a contemptuous, deceitful, and tyrannical ruler. He does not fulfil his promises, and he has a following of wicked people. His appearance in a dream also indicates the supremacy of one's enemy over him or his land. This will involve massacres, evil, deception, trials, and bloodshed. If a traveller sees the Antichrist in his dream, it means that a band of robbers may attack him. His appearance in a dream also denotes the conquest of a land that is saturated with evil. If one becomes the Antichrist or accompanies him in a dream, it means that he will suffer from black magic, sorcery, falsehood, decrepitude, or it could denote that a global disease will appear on earth and cause mass physical defects, destruction, and death. The landmarks that the Antichrist passes by in a dream represent adversities, trials, injustice, ruins, inundations with floods, destruction of crops, and drought. (Also see One-eyed)"}, {"id": "antidote", "label": "Antidote", "category": "Objects", "meaning": "(Cure, Herbs, Ivy, Medicine) In a dream, if one sees himself taking an antidote against a snakebite, it means appeasing one's fears or having peace in one's life. (Also see Ivy)"}, {"id": "antilia", "label": "Antilia", "category": "Celestial Bodies", "meaning": "(See Constellations)"}, {"id": "antimony", "label": "Antimony", "category": "Objects", "meaning": "(Silver-white powdered mixture. See Kohl)"}, {"id": "ants", "label": "Ants", "category": "Animals", "meaning": "(Army) In a dream, ants represent weak and covetous people, an army, a family, or longevity. Seeing a colony of ants entering a city in a dream means that an army will occupy that city. A colony of ants in a dream also represents a heavily populated area. Seeing ants over one's bed in a dream means having many children. If ants leave one's house in a dream, it means that someone in the family will leave that house. If there is a sick person in a house and one sees ants flying in a dream, it means the death of such a person. Ants leaving their colony in a dream means dying away of the population in that area, or that such a town may become a ghost town. Seeing ants leaving their nest in a dream also means adversities or distress. Though in this case, they represent the small and hard-working people. If a sick person sees ants walking over his body in a dream, it means his death. Flying ants in a dream also mean hardships during a journey. Seeing winged ants in a dream means a war and destruction of a large army. Ants in a dream may also signify prosperity. They also represent the person seeing the dream or members of his family or relatives. Understanding the language of ants in a dream means sovereignty, leadership, and prosperity. If one sees ants entering their house and carrying food in a dream, it means prosperity in that family. If one sees ants leaving their house and carrying food with them in a dream, it means poverty. Seeing ants coming out of one's nostrils, ears, mouth, or any part of his body and rejoicing at that sight in the dream means martyrdom. However, if one seems unhappy to see that in his dream, it means dying in sin. Flying ants in a dream also represent a robbery. Killing ants in a dream means cruelty against weak people."}, {"id": "anus", "label": "Anus", "category": "Human Body", "meaning": "(Backside) In a dream, it represents the husband or money. If one sees his anus blocked in a dream, it means that he will die shortly. The anus in a dream also represents a lowly person, a cheap musician, a drummer, someone who holds secrets, kin, or a relative with whom it is not lawful to be married. Seeing the backside of a young person in a dream means separation between the two. If it is an older person in the dream, it means a fight between them. Causing cuts in one's anus means severing family ties. Seeing the anus of one's mother in a dream means nullification of one's devotion, cancellation of one's due interests, or the stagnation of one's business. Seeing someone's anus in a dream means meeting with a frowning person. If one's anus bleeds in a dream, it means money. If one sees himself excreting in a dream, it means spending money with a clear intent of benefiting from it. Seeing the anus of an unknown woman in a dream means material losses, or it could mean difficulties in acquiring the necessary money for one's livelihood. Seeing worms coming from one's anus means departing from one's children or loss of one's children. If a cloth comes out of one's anus in a dream, it means severing relations with strangers who took advantage of one's children and abused their rights. Having sexual intercourse with a woman through the anus in a dream means asking for something in the wrong way. If one sees a peacock coming out of its anus in a dream, it means that he will beget a beautiful daughter. If he sees a fish coming out of his anus in a dream, it means that his wife will give birth to an ugly-looking daughter. (Also see Pederasty, Sexual intercourse, Sodomy)"}, {"id": "anxiety", "label": "Anxiety", "category": "Feelings", "meaning": "(See Distress, Gambling, Uptight, Worries)"}, {"id": "anxious", "label": "Anxious", "category": "Feelings", "meaning": "(See Uptight, Worries)"}, {"id": "aorta", "label": "Aorta", "category": "Human Body", "meaning": "(Artery) In a dream, the aorta represents man's heart, soul, and innermost self because it carries the blood from his heart to all the main arteries. In a dream, the aorta also represents one's happiness, health, sorrows, and pain. (Also see Jugular vein)"}, {"id": "apartment", "label": "Apartment", "category": "Objects", "meaning": "(Dwellings, Hardship, House, Journey) Buying or receiving an apartment as a gift in a dream means undertaking a distant and difficult trip."}, {"id": "aperture", "label": "Aperture", "category": "Objects", "meaning": "(See Attic window, Window)"}, {"id": "apiarist", "label": "Apiarist", "category": "Types of People", "meaning": "(See Beekeeper)"}, {"id": "apiculturist", "label": "Apiculturist", "category": "Types of People", "meaning": "(See Beekeeper)"}, {"id": "apparel", "label": "Apparel", "category": "Objects", "meaning": "(Adornment, Attire, Costume, Garb, Veil) In a dream, one's apparel varies in meaning depending on its contents, colours, or type, etcetera. Wearing one's garb in the winter in a dream is better than wearing it in the summer. Wrapping oneself with a cloth in a dream means becoming poor. An attire in a dream represents a man and a leader. An attire for a scholar, or a merchant, or a leader in a dream represents his trade through which one earns his livelihood, and which protects him from adversities. If one's apparel is dirty in a dream, then it reflects his life and appearance. If one wears a beautiful garb in the summertime in a dream, it means that he is ostentatious, arrogant, and vainglorious. It also could mean that he is under great pressure and suffering from painful distress, for the heat of a summer in a dream signifies distress. If a woman sees herself wearing a man's apparel in a dream, it means piety and success in her material and spiritual life. If a man sees himself wearing a woman's apparel in a dream, it means that he will be afflicted with fear, depression, subjugation, humiliation, trials, and then all of it will be lifted away from him. (Also see Veil, Yashmak)"}, {"id": "appeal", "label": "Appeal", "category": "Action", "meaning": "(See Soliciting advice)"}, {"id": "appearance", "label": "Appearance", "category": "Mood", "meaning": "(Emergence, Manifestation, Visibility) In a dream, if one sees something that is kept away from him as a secret, it means experiencing comfort after suffering from trials, receiving compensation after suffering from injustice, conceiving a child after having given up hope, or the like. A revealed secret on time in a dream means fulfilment of a promise, satisfying one's needs, repayment of one's debts, arrival of a long-awaited person from a journey, release of a prisoner from his jail, and for a woman, it could mean becoming pregnant. If something emerges at the wrong time in a dream, it means debts."}, {"id": "appetite", "label": "Appetite", "category": "Human Body", "meaning": "(Sated, Saturation, To eat one's fill) In a dream, to eat one's fill means fidgeting or restlessness. If one sees himself satiated with food and cannot eat any more in a dream, it means a change of his condition, losing rank, losing business, or his death. This interpretation is applicable unless one finds in his dream extra space to fill with food, then the dream means that his lot in this world will equal the size of that remaining space. Eating to one's fill in a dream also represents working for one's livelihood or recovering extra money. Some interpreters convey that hunger in a dream is better than satiation, while drinking extra water in a dream is better than thirst."}, {"id": "apple", "label": "Apple", "category": "Food", "meaning": "In a dream, apples represent beautiful children. An apple in a dream also denotes one's determination and goodwill. To a king, apples in a dream represent his kingdom. To a merchant, they represent his merchandise, and to a farmer, they represent his crop. Eating apples in a dream means determination. Eating a sweet apple in a dream means lawful earnings, while eating a sour-tasting apple means acquiring unlawful earnings. Sour apples in a dream mean divisiveness and hurt, while their tree represents torpor. If a king throws an apple at one of his subjects in a dream, it means good news or attainment of one's goals. Planting an apple tree in a dream means adopting or caring for an orphan. An apple tree in a dream represents a good man and a believer who serves and benefits his community. Eating an apple in a dream also means earning something people cannot see. Plucking an apple in a dream means money earned through a respectable person. Counting apples in a dream means counting money. Smelling an apple inside a mosque in a dream means getting married. If a woman sees herself smelling an apple during a reception in a dream, it means misconduct and the permeation of sin. If she sees herself eating an apple in a known place in a dream, it means that she will give birth to a handsome son. Biting on an apple in a dream means satisfying one's sexual desires or being sexually obsessed. (Also see Magician)"}, {"id": "apple-tree", "label": "Apple tree", "category": "Trees", "meaning": "An apple tree in a dream represents a good man who serves his community and cares about it. (Also see Tree)"}, {"id": "apricot", "label": "Apricot", "category": "Food", "meaning": "(Fruit) In season, seeing an apricot in a dream means money. Seeing an apricot out of season in a dream means illness. A fruit-bearing apricot tree in a dream represents a rich man. However, it is said that an apricot tree in a dream also represents someone who suffers from a serious illness and is of little or no use to others. On the other hand, it is said that an apricot tree in a dream represents someone with a cheerful face, who is courageous in defending himself, but who is stingy with his own family. When the apricot is still green and unripe in the dream, it represents little money. When it ripens and becomes yellow in a dream, it denotes greater profits. Eating a ripened apricot in a dream means being generous and charitable, or it could mean recovering from an illness. Breaking a branch from an apricot tree in a dream means a dispute with one's family or with a friend. In general, breaking a branch from a tree in a dream means claiming someone's money or denying him his money, or it could mean failing to perform one's prayers, neglecting one's obligatory fast, or misusing and damaging someone else's property. Attending an apricot farm in a dream means trustworthiness and dutifulness. It is also said that an apricot tree in a dream represents a hypocrite, because yellow in a dream means illness, and hypocrisy is an illness. An apricot tree in a dream also represents a wealthy woman. Plucking apricots from a tree in a dream could also mean marrying such a woman. Harvesting any fruit-bearing tree in season in a dream means pleasures and work, except for the mulberry tree, for here it means toiling, hardship, or waste of time. Plucking apricots from an apple tree in a dream means imposing unjust rules upon others. In general, a yellow coloured fruit in a dream signifies illness. A sewer tasting fruit in a dream signifies distress and sorrow. Apricot in a dream also signifies fear, bringing things under control, things returning to normal, or it could even mean pleasant gains. (Also see Fruit)"}, {"id": "april", "label": "April", "category": "Months", "meaning": "(See Thunder)"}, {"id": "apron", "label": "Apron", "category": "Objects", "meaning": "(See Towel)"}, {"id": "apus", "label": "Apus", "category": "Celestial Bodies", "meaning": "(See Constellations)"}, {"id": "aqiq", "label": "Aqiq", "category": "Objects", "meaning": "(arb. See Carnelian-red)"}, {"id": "aqiq-canyons", "label": "Aqiq canyons", "category": "Earth", "meaning": "(A place near the holy city of Mecca, First segment of God's Messenger's Nocturnal journey.) Seeing oneself performing a ritual ablution, then performing prayers in the Aqiq canyons in a dream signifies confirmation of the testimony of God's Oneness (see Carnelian-red), washing oneself from worldly attachments, witnessing Divine blessings and spiritual favours, rising in station, hearing good words, or it could mean imprisonment, rain, a gift, an offering, or a charity."}, {"id": "aqiqah-rites", "label": "Aqiqah rites", "category": "Action", "meaning": "(Hair of a newborn, Immolation offered on the seventh day for a newborn, Islamic tradition of shaving the hair of a newborn on the seventh day after his birth, Sacrament, Weighing the shaved hair of a newborn and distributing an equal measure in gold or silver in charity for his benefit.) The offering of an Aqiqah ceremony in a dream represents glad tidings, the arrival of a long-awaited person, recovering from an illness, or the release of a prisoner. Participating in the sacrament of the Aqiqah rites in a dream also could represent a growing faith and certitude, and emulating the blessed traditions of God's Prophet, upon whom be peace. If the sacrifice presented in one's dream on that day is a permissible one and if one fulfils all the necessary rituals in his dream, then it denotes his praiseworthy character and the success of his endeavours. If one offers a non-permissible sacrifice in his dream and presents it to people to eat from, then his dream represents a recalcitrant child or a rebellious son. (Also see Aqiq canyons, Carnelian-red)"}, {"id": "aqlia-mosque", "label": "Aqlia mosque", "category": "Objects", "meaning": "(See Masjid)"}, {"id": "aquarium", "label": "Aquarium", "category": "Objects", "meaning": "(See Fish)"}, {"id": "aquarius", "label": "Aquarius", "category": "Celestial Bodies", "meaning": "(astr. See Moon)"}, {"id": "aquarius", "label": "Aquarius", "category": "Celestial Bodies", "meaning": "(See Constellations)"}, {"id": "aquila", "label": "Aquila", "category": "Celestial Bodies", "meaning": "(See Constellations)"}, {"id": "ara", "label": "Ara", "category": "Celestial Bodies", "meaning": "(See Constellations)"}, {"id": "arab", "label": "Arab", "category": "Types of People", "meaning": "(People) Seeing an Arab dressed in his customary garb in a dream means overcoming one's difficulties or easing one's adversities."}, {"id": "arabic", "label": "Arabic", "category": "Other", "meaning": "(See Language)"}, {"id": "arabic-months", "label": "Arabic months", "category": "Months", "meaning": "(Lunar months: 1- Muharram, 2- Safar, 3- Rabiul Awwal, 4- Rabiu Thani', 5-Jamadul Awwal, 6-Jamadu Thani', 7- Rajab, 8- Sha'ban, 9- Ramadan, 10- Shawwal, 11- Zul-Qi dah, 12- Zul-Hijja) Seeing a dream during the month of Muharram means that the dream is most true as it is seen. Thus, having a dream during the month of Muharram could be even called a vision, and it never fails. Such a dream means success, relief from difficulties, release from prison, or recovery from an illness. If the person had retreated from his town, he would return to it. This interpretation is based on the story of God's prophet Jonah, upon whom be peace, after he emerged from the belly of the whale. Perhaps the person in the dream may face a great spiritual challenge in his life, or it could mean the death of a great man of knowledge, or the emergence of such a gnostic or wise man in that city. If the person seeing the dream is a sinner, it means that he will repent of his sins, for God Almighty has accepted the repentance of Adam, upon whom be peace, during that month. If the person in the dream hopes for a station of honour, he will attain it, because God Almighty has raised the Prophet Enoch (Idris), upon whom be peace, to a high station during that month. If a traveller sees a dream during that month, it means that he will safely return home from a long journey, because it is the month in which the Prophet Noah, upon whom be peace, was saved with his people, and it is the month in which the ark settled on top of Mount Judiyyi. If the seer desires a son, then he will beget a righteous son, because it is the month in which God's prophets Abraham and Jesus, upon both of them be peace, were born. If the person seeing the dream is suffering from tight financial circumstances and if he desired a way out, it means that he will see the light or escape from the danger of his enemy, because this is the month in which God's prophet Abraham was saved from the fire of Nimrod, or perhaps, if he had followed a path of innovation and falsehood, he will turn back to God Almighty and repent of his sin, because it is also the month in which God Almighty forgave the prophet David, upon whom be peace. If the person in the dream is impeached from his leadership position or stripped of his status, he will return to his office and regain honour, because it is also the month in which God Almighty returned the Prophet Solomon to his kingdom. If one is bedridden, it means that he will recover from his illness, because it is the month in which the prophet Job recovered from his illness, or perhaps it could mean that one will be sent as an emissary with a mission, or as an ambassador, because it is during this month that God Almighty spoke to His prophet Moses upon whom be peace. As for the second lunar month, known in Arabic as ~afar, having a dream during it could be interpreted as follows: If one is pessimistic about what he saw, then it could mean the opposite. If he is sick, it means recovering from his illness. If one is needy, it means that their needs will be satisfied. If one is suffering from stress and worries, it means that they can cause them no harm. If one sees his dream during the third lunar month, known in Arabic as Rabiul Awwal, and if he is a merchant, it means that his business will grow, prosper, and that his money will be blessed, or perhaps he may conceive a child during that month. If he is under stress and worries, they will be dispelled. If he is persecuted or treated unjustly, he will end in a triumph, or it could mean that he will hear good news, or he may be appointed as a governor, or he may admonish people to do good and discard evil, for it is the month in which God's Prophet Muhammad, upon whom be peace, was born to this world. If one's dream takes place during the fourth lunar month, known in Arabic as Rabiul Thiini, and if it suggests glad tidings, then one may have to wait and exercise patience, but if it suggests evil, then such a happening will come fast. During this month, seeing a dream also means victory over one's enemy, or it could mean conceiving a blessed son who will grow to become a gnostic, or a hero, for it is during this month that the Imam 'Ali, may God bless his countenance and be forever pleased with him, was born. As for the fifth lunar month, known in Arabic as Jamiul Awwal, seeing a dream during this month means that one should slow down or scrutinize his buying and selling, or it could mean that he may lose his daughter or wife, for it is in this month that the daughter of God's Messenger, upon whom be peace, Fatima died. May God be forever pleased with her. If the dream happens during the sixth lunar month, known in Arabic as Jamadu Thaw, and if the dream carries a good meaning, it will come, but slowly, and one should not contradict it. If one sees this dream during the seventh lunar month, known in Arabic as Rajab, it means that he will gain honour and status, for it is the month of the Prophet's Ascension (Miraj) and his night journey to the seventh heaven. A dream during the eighth lunar month, known in Arabic as Sha'ban, represents honour and ranks, for during this month, every good deed will be honoured. As for the ninth lunar month, known in Arabic as Ramadan, in it, all difficulties will be suspended, evil will be shunned, and stinginess will be dispelled. During this month, all that is good will manifest, and bad dreams will dissipate to become null and void. During this month, the dreams of a believer may be differently interpreted than the dreams of a disbeliever. If one sees the month of Ramadan in his dream, his dream means blessings, profits, commanding good and forbidding evil. If the person is seeking knowledge, then knowledge will be given to him, for it is during this great month that the Holy Qur'an was revealed. If the person is afflicted with epilepsy, he will recover from it, for the devils and all evil spirits are shackled and are rendered powerless during this month. As for the tenth lunar month, known in Arabic as Shawwal, if one's dream suggests a war or a conflict, it means that he will come first in it, and that he will triumph. If one sees the month of Shawwal in his dream, it means that he will come out of difficulties and find happiness and devotion, for it is the month during which God's House, known as the Kaaba, was built. As for the eleventh lunar month, known in Arabic as Zul-Qi dah, if one's dream suggests a trip, then the person should refrain from taking that trip, or perhaps he should delay it for the better. He should also guard himself where he lives. If the dream denotes stress or worries, then he should avoid whatever may cause them. However, if one's dream takes place during the twelfth lunar month, known in Arabic as Zul-Hijja indicates a journey, then one may take it, or if it denotes a good business, one should seek it, for it is a most blessed month and it is the month of festivities and sacrifices. If one sees this month in his dream or sees himself offering sacrifices in it, or if he sees himself praying the festival of Sacrifice prayers in it, his dream means paying one's debts or fulfilling one's vows, repentance from sin, guidance or perhaps his dream may indicate the death of great people of knowledge, the impeachment of governors, the changing of governments, or it could mean a sudden war."}, {"id": "arafat", "label": "Arafat", "category": "Earth", "meaning": "(Mecca, Mount 'Arafa, Mount of mercy, Plain of 'Ararat, Reunion of beloveds) If one sees himself standing in prayers in the Plain of 'Arafat during the pilgrimage season on the 9th day of the Arabic month Zul-Hijja, it means the return of a long-awaited traveller to his home, a happy reunion, a family reunion, reconciliation between friends, or peace between two individuals. Seeing Mount 'Arafa or the Plain of Arafat in a dream also could represent the pilgrimage season, or performing a pilgrimage, visiting Mecca on 'Umrah (See 'Umrah), or it could mean the Friday congregational prayers, the sixth day of the week, a marketplace, or engaging in a profitable business. Seeing oneself standing at 'Arafat in a dream also means rising in station, changing conditions, reversal of one's state from good to bad or from bad to good, or perhaps it could mean the death of a beloved, such as one's wife, or it could mean relocating to a blessed place or finding a sanctuary. Seeing oneself at 'Arafat in a dream also could mean losing a battle to one's adversary, though the results or consequences of such a battle will bring him honour and exalted station, or it could mean winning the battle against one's enemy. If a sinner sees himself praying and repenting at Mount 'Arafa or near the Mount of Mercy in the Plain of Arafat in a dream, it means that his repentance will be accepted, or that a secret will be exposed, or it could mean that a reunion of beloveds will take place shortly after one's dream. If one sees himself standing in 'Arafa during the nighttime in a dream, it means that his goals will be attained and that he will satisfy his quest. If one sees himself standing in 'Arafa after the sunrise, it means that his question will find no answer. (Also see Circumambulation, Cradle of Ismail, Kaaba, Muzdalifa, Pelting stones, Responding, Station of Abraham, 'Umrah)"}, {"id": "aramaea", "label": "Aramaea", "category": "Earth", "meaning": "(The prophet Aramaea, upon whom be peace.) Seeing him in a dream means that a fire will consume one's city, house, or rural district."}, {"id": "arc", "label": "Arc", "category": "Objects", "meaning": "(Noah's arc. See Coffin, Ship)"}, {"id": "archangel-gabriel", "label": "Archangel Gabriel", "category": "Types of People", "meaning": "(Upon him be peace.) Seeing him in a dream and feeling happy about his meeting brings glad tidings. If the archangel Gabriel in one's dream speaks to him, advises him, or admonishes him in the dream, it means receiving a great honour, strength, victory in one's life, and glad tidings. If the person is oppressed, it means that he will triumph in the end. If he is sick, it means that he will recover from his illness. If he is in a state of depression or fear, it means that he will overcome it, and he shall sail into success. If he had not yet performed his pilgrimage to Mecca, it means that he will fulfil it. Seeing the archangel Gabriel in a dream also means glad tidings of martyrdom, even if the person lives a long life. If one receives some food or fruits from him in a dream, it means that he is one of the dwellers of paradise. However, if a disbeliever sees him in a dream, it means that he will face tribulations and punishments in his life. If he considers the archangel Gabriel and the archangel Michael as equals in a dream, it means that he agrees with the people of the Jewish faith. To his detriment, such a person might steer into an activity that is opposite to God's instructions and consequently earns God's wrath. If the archangel Gabriel greets someone in his dream, it means that such a person will become a great man of knowledge, and he will be recognized and distinguished in his field. The archangel Gabriel, in a dream, also represents the messenger of the king, the confidant, the carrier of glad tidings, or the person who announces the birth of a son. Seeing him in a dream also indicates an increase in one's devotion, learning, and acquiring in-depth knowledge of mystical realities. Seeing him in a dream also signifies the smooth rising of the soul after death for someone who is dying. The archangel Gabriel, in a dream, also represents a movement, struggle, triumph, and understanding the meanings of religious knowledge or learning the secrets of astrology. If one sees the archangel Gabriel distressed in a dream, it means that a calamity will befall the person seeing the dream. If one becomes Gabriel in a dream, it means that he will become generous, magnanimous, and blessed in his actions and performances."}, {"id": "arched-bridge", "label": "Arched bridge", "category": "Objects", "meaning": "(Bridge, Stone bridge, Viaduct) An arched bridge or a viaduct in a dream represents suspicious matters or mundane questions or worldly vs. ungodly concerns. An arched bridge or a viaduct in a dream also could represent one's wife, or it could mean the dispelling of one's worries or trouble. Driving over an arched bridge or through a viaduct in a dream means riding a vehicle. An arched bridge or a stone bridge in a dream also signifies richness, luxury, longevity, a sickness, renouncing one's allegiance, or it could mean breaking a promise. An arched bridge in a dream also could represent a middleman, a wise man, or a ruler, except if the bridge leads to a loathsome place or a dead end. Crossing an arched bridge that leads to the palace of a ruler in a dream means receiving money, or it could mean getting married to a noble person. An unknown bridge in a dream represents the world, particularly if it connects the city with the cemetery. It also could represent a ship, or the Bridge of the Day of Judgement, for it is the last hurdle before reaching paradise. If one crosses an arched bridge in his dream, then it means that he will cross the abode of this world into the abode of the hereafter and particularly if one meets departed souls from the world or enters unknown places or sees uncommon structures, or if a bird carries him by air, or if a beast swallows him, or if he falls into a ditch or flies into the heavens in his dream, all of which also means recovering from an illness or undertaking a long journey, or it could mean returning home from a long journey. If on the other side of the bridge, one ends in a fertile farm, luscious fields, or meets with an old woman in his dream, it means money. benefits and prosperity. If the other side of the bridge leads to a mosque in the dream, it means that one will achieve their goal, fulfil their intention, or perform a pilgrimage to God's House in Mecca. If one becomes a bridge in a dream, it means that he will acquire extensive powers or become an inspiration to others, or that people will come to need his authority and help. Crossing a wooden bridge in a dream means meeting with a group of hypocrites. (Also see Bridge)"}, {"id": "archer", "label": "Archer", "category": "Types of People", "meaning": "Seeing an archer in a dream signifies longevity, bravery, and victory over one's enemy. In a dream, an archer also represents someone who is reared by a stepfather. (Also see Arrows)"}, {"id": "architect", "label": "Architect", "category": "Types of People", "meaning": "(Engineer) An architect in a dream represents both urban development and urban destruction. He represents joining what is fragmented and breaking up what is whole. Seeing an architect in a dream also signifies trials, evil, calamities, and disunity. If one becomes an architect in a dream, it means longevity because of the architect's aspirations, and he will fulfil his intentions, reach a ranking station, and a commanding position in his life. If one becomes an architect in a dream, it also means that he may become a judge, or a marriage officiant, or it could represent a poet. Seeing an architect in a dream also signifies richness after poverty and health after sickness. (Also see Artist, Carpet weaver, Graphic artist, Orthopaedist)"}, {"id": "arctunus", "label": "Arctunus", "category": "Celestial Bodies", "meaning": "(See Constellations)"}, {"id": "argillaceous", "label": "Argillaceous", "category": "Earth", "meaning": "(See Clay)"}, {"id": "argillite", "label": "Argillite", "category": "Earth", "meaning": "(See Clay)"}, {"id": "argo", "label": "Argo", "category": "Celestial Bodies", "meaning": "(See Constellations)"}, {"id": "aries", "label": "Aries", "category": "Celestial Bodies", "meaning": "(astr. See Moon)"}, {"id": "arietica", "label": "Arietica", "category": "Celestial Bodies", "meaning": "(See Constellations)"}, {"id": "arm", "label": "Arm", "category": "Human Body", "meaning": "(Forearm, Limb, Member, Wing) One's two arms in a dream represent his two brothers. his two close friends, two sons, or partners. If one sees a person with short arms in a dream, it means that he is courageous, generous, and wondrous. One's arm in a dream represents his brother and supporter or a spiritual example he follows. If one's arm is broken in a dream, it means the death of one's brother or closest friend, or it could mean an accident or a calamity. One's arm in a dream also signifies protection from sin, or it could represent his wife, his mother, his teacher, wealth, craft, source of income, a supporting son, or a close brother one can depend on at times of difficulties. If one sees that his arm is missing something in a dream, it could mean that he has little brain, though he is filled with pride and haughtiness. (Also see Air, Body', Forearm)"}, {"id": "arm", "label": "Arm", "category": "Human Body", "meaning": "(See Weapon)"}, {"id": "armistice", "label": "Armistice", "category": "Action", "meaning": "(See Truce)"}, {"id": "armlet", "label": "Armlet", "category": "Objects", "meaning": "Wearing a silver armlet in a dream means giving one's daughter in marriage to one's nephew. Wearing an armlet made from beads in a dream means suffering pressure and distress caused by one's brother or sister. Any jewellery that is worn by a woman in a dream represents her husband. (Also see Bracelet)"}, {"id": "armor", "label": "Armor", "category": "Objects", "meaning": "(Coat of mail, Shield) An armour in a dream means protection and defence. It also means fasting. If weapons are mixed with the armour or shield in one's dream, it means that one's enemies cannot reach him or cause harm to him. If one sees his armour lying within his reach in his shop or place of business while dealing with his customers in a dream, it means that such a merchant is untruthful and he uses claims of honesty as a shield. (Also see Coat of mail)"}, {"id": "armor-maker", "label": "Armor maker", "category": "Types of People", "meaning": "In a dream, he represents a person who advises people to live in peace and harmony. (Also see Armor)"}, {"id": "armpit", "label": "Armpit", "category": "Human Body", "meaning": "(See Odor)"}, {"id": "army", "label": "Army", "category": "Types of People", "meaning": "(See Ants)"}, {"id": "army-general", "label": "Army general", "category": "Types of People", "meaning": "(Commander, Military) In a dream, an army general or a commander represents someone famous who is self-assured and dauntless. If one sees himself as an army general in a dream, and should he qualify for such a position, it means prosperity, honour, and blessings. If one does not qualify for such a position, then it may mean his death. If a poor person sees himself as an army general in a dream, it means disturbances and that he will raise his voice. As for a prisoner, it means his release from jail."}, {"id": "army's-flag", "label": "Army's flag", "category": "Objects", "meaning": "(Banner, Flag) In a dream, the flag of an army represents a pious man, a scholar, a religious doctor, a spiritual leader, an ascetic, or a rich and generous person who is an example to others. A red flag in a dream means war, while a yellow flag means a plague. A green flag in a dream means a blessed journey, while a white flag means rain. A black flag in a dream means drought and doubt, or it could mean a rainstorm. Sighting the flag of an army in a dream means finding one's way or finding guidance. For a woman, seeing a flag in her dream means getting married. (Also see Banner, Colours, Flag)"}, {"id": "arrange", "label": "Arrange", "category": "Action", "meaning": "(See Organize)"}, {"id": "arrival", "label": "Arrival", "category": "Action", "meaning": "(Homecoming) The arrival home of a traveller in a dream signifies relief after sustaining depression and distress, or it could mean recovering from an illness, or regaining a stronghold. If one finds himself depressed and annoyed with the arrival of the traveller in the dream, then his dream may signify having to ask for something from someone, or needing others, or confronting the unavoidable."}, {"id": "arrogance", "label": "Arrogance", "category": "Mood", "meaning": "To show arrogance in a dream based on one's success in life and wealth means the nearing end of one's life in this world. Arrogance in a dream also means prosperity and a high rank in this world, though evil may be the end of it. (Also see Advice, Elephant)"}, {"id": "arrowhead", "label": "Arrowhead", "category": "Tools", "meaning": "In a dream, an arrowhead represents talk, benefits, or profits from business travels. An arrowhead which is made of lead in a dream means receiving a letter that explains one's weakness. If the arrowhead is made from copper in the dream, it means material pleasure. If it is made from gold in the dream, it represents a letter one is forced to send. (Also see Arrows)"}, {"id": "arrows", "label": "Arrows", "category": "Tools", "meaning": "In a dream, arrows mean messages, a messenger, writings, and victory over one's enemy. If a woman sees her husband's arrows in their quiver in a dream, it means that her husband has turned away from her. Arrows in a dream are also an indicator or a guide. Seeing an arrow outside its quiver means failure to perform one's duty or inability to deliver one's message. Shooting arrows in a dream means writing letters. If one shoots an arrow but fails to hit his target in the dream, it means that he will send a messenger to do something, and his messenger will fail to deliver. If one sees a woman shooting him with an arrow in a dream, it means that she is showing kindness toward him and, consequently, he may fall in love with her, or he may marry her. If one shoots an arrow and hits his target in a dream, it means that he will reach his goal, or if he wishes to have a child, it means that he will bear a son. An arrow in a dream also represents a messenger, profits, a son, longevity, or new clothing. If the arrows are made from reeds in one's dream, they mean falsehood and prattle. If they have arrowheads in the dream, then they represent a talkative person who, if he hits his target, it means that he does what he says. If the arrowhead breaks in the dream, it means that he speaks only to protect himself from others' arrows. If the arrow is made from gold in the dream, it means that he is sending a message to a woman because of another woman. The arrowhead in a dream represents strength, power, or disturbance. The arrows themselves in a dream also mean the fear of an emissary for his life. Throwing arrows in a dream means backbiting others and slandering them. (Also see Archer, Shooting arrows)"}, {"id": "artery", "label": "Artery", "category": "Human Body", "meaning": "(See Aorta, Jugular vein, Veins)"}, {"id": "artificial-lake", "label": "Artificial lake", "category": "Water", "meaning": "(See Water level)"}, {"id": "artist", "label": "Artist", "category": "Types of People", "meaning": "(Architect, Painter) Seeing him in a dream means consenting to reason. He could also represent an opinionated person, an expert, a friend, a real estate broker, a scientist, a commander, or an architect. (Also see Architect, Painter)"}, {"id": "arts", "label": "Arts", "category": "Other", "meaning": "All types of arts in a dream signify recovering from illness, attaining peace, a picnic, colours, clothing, waters, and beautiful people."}, {"id": "ascending-in-the-skies", "label": "Ascending in the skies", "category": "Action", "meaning": "(Climbing, Rising) To see oneself ascending in the skies in a dream means falling in rank, or it could mean oppressing oneself. If one sees himself ascending in the skies until he reaches the stars, merges with them, and becomes a star in the dream, it means that he will receive titles and powers. If one sees himself ascending a mountain, it means depression, stress, and travel. However, rising in a dream means elevation of status, and descending means a backslide. If one sees himself walking up a steep road in a dream, it means rising in status but involving toiling and hardships. If one sees himself climbing a mountain, then the mountain in a dream is interpreted as one's goal. Thus, one's dream may mean attaining one's goal as far as he reaches in his climb. In dream interpretation, any ascent of a mountain, a trail, a hill, an elevation, or even climbing a roof means attaining one's goal or satisfying one's needs. To see oneself climbing flat on his back in a dream then means uncalled for, or unnecessary hardship. (Also see, Ascent, Climbing a mountain, Flying)"}, {"id": "ascent", "label": "Ascent", "category": "Action", "meaning": "(Incline, Mountain Road, Steep incline) If one sees himself climbing a steep incline in a dream, it means toiling to succeed in both his material and spiritual life, or it could mean trying to gather the benefits of both worlds, though with great strain on him. An ascent in a dream also could signify a difficult woman or a stern man who can only be handled with kindness, gentleness, and love. An ascent in a dream also represents ones associate, or a business partner, who cannot be trusted with ones money or life. An ascent in a dream also represents the road to salvation or the dangers one may have to cross, and the deeds that can save one from hellfire. An ascent in a dream could also represent adversities, difficulties, and dangers. Ascending a steep incline in a dream means danger, and descending a steep hill means reaching safety. An ascent in a dream also could represent a bridge, an underpass, a wife, a woman, or a scorpion. Walking through a steep incline in a dream also means rising in station because of ones knowledge, politics, good conduct, fulfillment of ones duties, his caring for others, or wisdom. Falling through a steep hill in a dream means falling in rank, losing ones prestige, losing ones money, denying the truth, objecting to ones religion, or walking into darkness. Climbing in a dream always means attainment of ones goals. Climbing flat on ones back in a dream has negative connotations. Descending from a steep hill, or a ship, or coming down from a castle or a mountain in a dream also means that ones goal will not materialize. (Also see Ascending the skies, Climbing a mountain)"}, {"id": "ascertain", "label": "Ascertain", "category": "Action", "meaning": "(See Sneezing)"}, {"id": "ascetic-detachment", "label": "Ascetic Detachment", "category": "Mood", "meaning": "(Abstinence, Asceticism) To see oneself living an ascetic life in a dream means that one is earnestly seeking to show kindness and love for people and to earn their love. (Also see Perfume salesman)"}, {"id": "asceticism", "label": "Asceticism", "category": "Action", "meaning": "(See Ascetic detachment)"}, {"id": "ashes", "label": "Ashes", "category": "Fire", "meaning": "(Coal, Fire, Fumes, Oven) In a dream, ashes represent unlawful money, or they could mean burns. Ashes in a dream are also interpreted to mean money one will receive from someone in authority or directly from the government. Seeing ashes then means difficulties or toiling for no benefit in the service of a person in authority. Ashes in a dream also mean vain talk, or knowledge one cannot benefit from. If one sees himself carrying a container filled with ashes in a dream, it means that he is engaged in falsehood, backbiting, or in acquiring useless knowledge. If one sees himself blowing air into cold ashes in a dream, it means that he will engage in a futile undertaking. Ashes in a dream also denote sadness, sore eyes, or heedlessness. Ashes in a dream also mean quelling the fire of war, suppressing upheaval, or attaining peace. Ashes, which are collected from baking in a dream, represent charity or curiosity. (Also see Coal)"}, {"id": "ashura", "label": "Ashura", "category": "Days of the Week", "meaning": "(10th day of Muharram, Anniversary of the martyrdom of Husain at Kerbela.) If a descendant of the blessed family of God's Messenger, upon whom be peace, sees himself on the day of 'Ashura in a dream, it means that he may have to face an adversity. If anyone else sees that in a dream, it means the opposite."}, {"id": "askance", "label": "Askance", "category": "Mood", "meaning": "(See Eyes)"}, {"id": "asphyxia", "label": "Asphyxia", "category": "Action", "meaning": "(See Strangulation, Suffocation)"}, {"id": "asr", "label": "Asr", "category": "Other", "meaning": "(Arb. See Five times prayers)"}, {"id": "ass", "label": "Ass", "category": "Animals", "meaning": "(See Donkey)"}, {"id": "assassin", "label": "Assassin", "category": "Types of People", "meaning": "(See Thief)"}, {"id": "assassination", "label": "Assassination", "category": "Action", "meaning": "(Bang, Thunder) Hearing the sound of thunder without seeing lightning in a dream means an assassination or a murder. (Also see Thunder)"}, {"id": "assault", "label": "Assault", "category": "Action", "meaning": "(Destroy, Extirpate) An assault which is directed by an enemy or which is aimed at an enemy. An assault in a dream means a disaster, a calamity, a flood, a fire, locusts, or major changes in the world. To devastate someone by looking at him with despise in a dream means that the assailant will suffer from the jealous eyes of his victim in wakefulness."}, {"id": "assert", "label": "Assert", "category": "Action", "meaning": "(See Naked)"}, {"id": "assets", "label": "Assets", "category": "Objects", "meaning": "If a rich person sees himself in a dream standing within the confines of the Cradle of Isma'il in the Sacred Mosque in Mecca, it means that he will be debarred from his assets, and his rights to use them will be suspended."}, {"id": "assistant", "label": "Assistant", "category": "Types of People", "meaning": "(Beauty, Eyebrow. Also see Assistant teacher)"}, {"id": "assistant-judge", "label": "Assistant judge", "category": "Types of People", "meaning": "(See Assistant magistrate)"}, {"id": "assistant-magistrate", "label": "Assistant magistrate", "category": "Types of People", "meaning": "(Assistant judge) Seeing the assistant magistrate in a dream means either following the traditions of the righteous ones or the avenues of innovation."}, {"id": "assistant-teacher", "label": "Assistant teacher", "category": "Types of People", "meaning": "(Students' leader, Monitor, Pupil) In a dream, an assistant teacher represents an innovator or someone who advises others the right way, though remains attached to his innovative ideas."}, {"id": "associate", "label": "Associate", "category": "Types of People", "meaning": "(Beauty, Eyebrow. Also see Partnership)"}, {"id": "asthma", "label": "Asthma", "category": "Human Body", "meaning": "Experiencing breathing difficulties in a dream means boredom, annoyance, weariness or disgust."}, {"id": "astral", "label": "Astral", "category": "Celestial Bodies", "meaning": "(See Star)"}, {"id": "astray", "label": "Astray", "category": "Mood", "meaning": "(See Disbelief, Irreligious, Wandering)"}, {"id": "astringent", "label": "Astringent", "category": "Objects", "meaning": "(See Accountant)"}, {"id": "astrolabe", "label": "Astrolabe", "category": "Tools", "meaning": "(Astrology) In a dream, it represents the assistant or the servant of a governor or ruler. An astrolabe in a dream also represents someone connected with the leadership of a land. Accompanying such a person in a dream then means benefits equal to what one sees in his dream. Seeing an astrolabe in a dream also may connote someone with uncertainty, or an ever-changing person who lacks determination, loyalty, or honour. (Also see Astrologer)"}, {"id": "astrologer", "label": "Astrologer", "category": "Types of People", "meaning": "(Foreseer, Fortune-teller, Predictor, Soothsayer) Seeing an astrologer in a dream means associating oneself with spiritual masters and witnessing some of their miraculous signs. An astrologer in a dream also may mean knowledge of people's secrets, curiosity, inquisitiveness, meddling in people's affairs, divulging people's secrets, soothsaying, fortune-telling, backbiting, predicting the future, hearsay, gossip, distress, or trouble. If the one who is seeing the dream suffers from any of the above ills, seeing an astrologer in a dream also means dispelling such misfortunes. Seeing an astrologer in a dream also signifies marriage, divorce, the death of a sick person, travels, delivering a baby, and hearing good or bad news. Seeing an astrologer in a dream also may denote knowledge, following the true path, and acting upon it, for a God fearing astrologer mostly arbitrates by the prophetic rules. (Also see Astrolabe, Divination, Fortune teller)"}, {"id": "astrology", "label": "Astrology", "category": "Other", "meaning": "(Astrolabe. See Astrologer, Fortune teller, Moon)"}, {"id": "astronomer", "label": "Astronomer", "category": "Types of People", "meaning": "In a dream, an astronomer represents someone who trades with women, a pimp, or a salesman."}, {"id": "astronomy", "label": "Astronomy", "category": "Other", "meaning": "(See Celestial sphere, New Year's Day)"}, {"id": "astute", "label": "Astute", "category": "Mood", "meaning": "(See Perspicacity)"}, {"id": "atheism", "label": "Atheism", "category": "Other", "meaning": "(Ingratitude. See Darkness)"}, {"id": "atonement", "label": "Atonement", "category": "Action", "meaning": "(Expiation, Penance, Requital) Atonement, distribution of gifts or charities as penance for one's sins in a dream means payment of one's debts, delivering a trust to its rightful owner, paying a fine, or reciprocating an invitation. (Also see Tithe collector)"}, {"id": "attack", "label": "Attack", "category": "Action", "meaning": "(Charge against, Comeback) Charging against one's enemy in a dream means victory in wakefulness, or it could mean disturbance, anxiety, concern, going through a mental conflict, or having doubt, and it may mean regret, repentance, and correcting the course of one's actions and thoughts."}, {"id": "attainment", "label": "Attainment", "category": "Action", "meaning": "(See Fulfillment)"}, {"id": "attar", "label": "Attar", "category": "Objects", "meaning": "(See Rose)"}, {"id": "attic-window", "label": "Attic window", "category": "Objects", "meaning": "(Aperture, Peephole, Window) If one's attic window towers over a large and beautiful property in the dream, it means owning or acquiring a new property, earning respect, honour, and fulfilling one's aspirations. If the view from one's attic window is depressing in the dream, then it means relief from difficulties, or if one is sick, then it means recovering from his illness, or if he is unmarried, then it means that he will get married. If a woman looks at an attic window in a dream, it means that she will get married. Discovering an attic window in a house that does not have one in a dream means the spread of one's authority, or the success of one's business. (Also see Window)"}, {"id": "attire", "label": "Attire", "category": "Objects", "meaning": "(See Apparel, Veil)"}, {"id": "attracting-attention", "label": "Attracting attention", "category": "Action", "meaning": "(See Digging up the past)"}, {"id": "attrition", "label": "Attrition", "category": "Action", "meaning": "(See Worries)"}, {"id": "auctioneer", "label": "Auctioneer", "category": "Types of People", "meaning": "In a dream, an auctioneer represents an escort, a station master or a broadcaster. (Also see Broker)"}, {"id": "auditorium", "label": "Auditorium", "category": "Objects", "meaning": "(See Hall)"}, {"id": "auditory-meatus", "label": "Auditory meatus", "category": "Human Body", "meaning": "(See Earwax)"}, {"id": "auger", "label": "Auger", "category": "Tools", "meaning": "(See Drill)"}, {"id": "august", "label": "August", "category": "Months", "meaning": "(See Earthquake, Thunder)"}, {"id": "auriga", "label": "Auriga", "category": "Celestial Bodies", "meaning": "(See Constellations)"}, {"id": "austerity", "label": "Austerity", "category": "Mood", "meaning": "(See Harshness)"}, {"id": "author", "label": "Author", "category": "Types of People", "meaning": "(See Book, Writer)"}, {"id": "automobile", "label": "Automobile", "category": "Objects", "meaning": "(See Car)"}, {"id": "avarice", "label": "Avarice", "category": "Feelings", "meaning": "Stinginess, avariciousness, love to hoard things, and to never share with others in a dream means finding a cure for one's disease. Avarice in a dream also means hypocrisy associated with acts that lead to hellfire. Avarice in a dream also means blame and criticism. If one sees himself repugnantly spending his money in a dream, it means his death. Avariciousness in a dream also means falling into sin."}, {"id": "avenue", "label": "Avenue", "category": "Objects", "meaning": "(See Lane, Road)"}, {"id": "awakening", "label": "Awakening", "category": "Action", "meaning": "(Rising up) To see oneself waking up from sleep in a dream means steadfastness, serious repentance, success in one's business, and returning home from a journey."}, {"id": "axe", "label": "Axe", "category": "Tools", "meaning": "(Hatchet) An axe in a dream means receiving help, an increase in one's earnings, recovering from a migraine headache, recovering from an illness, or it could mean begetting a son. Holding an axe in one's hand in a dream means becoming a guardian, an executor of a will, a trustee, becoming steadfast in one's religion, or it could mean overcoming one's enemy. It is said that an axe in a dream means harm, disruption, and scattering of one's livelihood. An axe in a dream also represents a servant, a housekeeper, strength, victory, or perhaps an insolent person, or it could denote one's job. (Also see Adze)"}, {"id": "azan", "label": "Azan", "category": "Other", "meaning": "(Muezzin. Also see Call to prayers)"}, {"id": "azrael", "label": "Azrael", "category": "Angels", "meaning": "(The angel of death, Bone-breaker, Death, Longevity) The archangel of death. Seeing him in a dream means martyrdom if one is inspired by it. If one sees the archangel Azrael angry with him in a dream, it means that one will die unrepentant. If one sees Azrael standing above him, or battling him in a dream, it means that he will recover from a severe illness. Seeing the archangel Azrael in a dream also means longevity, or going through unavoidable circumstances, or experiencing extreme fear. If one sees himself being Azrael in a dream, it means rising in status to govern and to oppress others, or he might become an executioner, or perhaps that some major events may take place at his hand. Kissing Azrael in a dream means receiving an inheritance. Seeing Azrael in a dream also means separations, death of sick people, losses, destruction, fire, bad news, forfeiture of properties, stagnation of the economy, losing one's source of livelihood, imprisonment, breach of promise, forgetting one's knowledge, neglecting one's prayers, obstruction of charities, hindrance of alms distribution, negating the rights of others, retreating to one's privacy, rising prices, bad crop, a tyrant ruler, glass blowing, or bankruptcy. As for one who loves to meet his Lord, seeing the archangel Azrael in a dream means attainment of one's goal, fulfillment of a promise, freedom from prison, good news, and glad tidings. If an unknown or a common person approaches someone in the street and whispers something in his ear in confidence, the commoner here represents the angel of death. It is said that each human being will see the archangel Azrael three times during their lifetime. The third and final encounter with Azrael signifies the end of their earthly life, as he separates the soul from the body. This is the moment when the soul transitions from the physical world to the afterlife."}]