[{"id": "eagle", "label": "Eagle", "category": "Animals", "meaning": "(Vulture) The eagle is the king of birds. Struggling with an eagle in a dream means distress, fury of one's superior, or subjugation to an unjust person. Owning an obedient, well-tamed eagle in a dream means prosperity, honour, and power. Owning and flying an eagle in a dream means becoming a tyrant. The scratch of an eagle in a dream means a sickness. A killed eagle in a dream means the death of a ruler. If a pregnant woman sees an eagle in her dream, it means seeing a midwife or a nurse. In a dream, an eagle may also be interpreted to represent a great ruler, a prophet, or a righteous person. Hearing the cry of an eagle in a dream means a fright. Eating the flesh of an eagle or getting hold of some of its feathers in a dream means receiving money from a ruler. If an eagle catches someone and soars away with him horizontally in a dream, it means travel. If he flies away with him vertically in the dream, it means death. In a dream, an eagle also means longevity, prosperity, innovation, or heedlessness. (Also see Vulture)"}, {"id": "ear", "label": "Ear", "category": "Human Body", "meaning": "(Awareness, Deafness, Hearing, Stability) One's ear in a dream represents his hearing, the point of his awareness, his rank, child, property, or his status. The ear in a dream also represents knowledge, reason, religion, the extent of one's wealth, or pride about one's lineage. If one's hearing becomes clearer or increases in sensibility, or if he hears himself hearing from his ears or driving into them in a dream, this dream will represent his guidance, obedience to his Lord, and consent to His command. If he sees his ears looking smaller or producing an offensive odour in a dream, it means that he may go astray and indulge in actions that will incur God's displeasure. If one discovers that he has an extra ear in a dream, it means permission is given to him to fulfill what he intends. The number of ears one sees in a dream also represents the different arts and sciences, but they could also mean that the person in question has no stability. In a dream, one's ear may represent the jewellery a woman attaches to herself as ornaments. To clog one's ears with one's fingers in a dream means death in a repugnant state of innovation. Plugging one's ears in a dream also means ignoring a repulsive thought. Plugging one's ears in a dream also could mean becoming an advisor to someone or a caller to prayers in a mosque, i.e., a muezzin. If one's ears are transformed into an animal's ears in a dream, it means losing respect or developing impertinence or apathy. As one's awareness, one's ear in a dream represents a pouch, a wallet, a coffer, or a safe. Ears in a dream are also interpreted to mean separation from one's wife or daughter. If only half of one's ear is there in the dream, it means the death of his wife. If one finds himself deaf in his dream, it means that he may lose his faith. Having large ears in a dream means shunning or avoiding what is true. If one sees as though his ears have wings in the dream, it means that he may lose his sight. If one sees himself eating the accumulated wax of his ears in a dream, it means that he is a child molester. If one sees grass growing all over him but does not cover his ears or eyes in the dream, it means prosperity. (Also see Body, Earwax)"}, {"id": "earlock", "label": "Earlock", "category": "Human Body", "meaning": "(See Body, Temple)"}, {"id": "early-companions", "label": "Early companions", "category": "Types of People", "meaning": "(See Scholars)"}, {"id": "early-scholars", "label": "Early scholars", "category": "Types of People", "meaning": "See Scholars"}, {"id": "earrings", "label": "Earrings", "category": "Objects", "meaning": "In a dream, a woman's earrings or necklace, if they are made of pearls, represent a gift from her husband. If they are made of silver in the dream, they mean a physical ailment, and if they are made from beads in the dream, they mean being let down by one's friends. Seeing one's wife wearing earrings in a dream means engaging in a profitable business. If a man sees himself wearing a pair of beautiful earrings that are mounted with pearls in a dream, it means that he will enjoy wealth, prosperity, and comfort in this life, or it could mean that he will memorize the Holy Qur'an. If a woman sees herself wearing a pair of silver earrings in a dream, it means that she will conceive a son who will grow to be a pious man. If they are made from pearls, then her future son will sing with music. As for an unmarried woman, wearing a pair of earrings in a dream means marriage. If one sees a child wearing a pair of earrings in a dream, it represents beauty, though it is not praiseworthy if an adult or a man is seen in a dream wearing a pair of earrings or even a single earring. In their case, it means engaging in a loathsome and disgraceful action. Wearing a pair of earrings in a dream also means acquiring knowledge that exalts the person and raises him in station. It also could mean having musical inclinations or having a picnic. (Also see Gold, Ornaments)"}, {"id": "earth-first-meaning", "label": "Earth-first-meaning", "category": "Earth", "meaning": "(Element of earth, Dirt) In a dream, earth represents people, for they are created from the same element. Earth in a dream also means cattle, animals, or the world. Dirt in a dream represents money, but it could also mean poverty. Digging the earth in a dream means digging a grave for a sick person. Digging the earth in a dream also means a journey, and its dirt collected means profits from the journey. If digging the earth is interpreted as seeking marriage, then the earth itself represents one's future wife. Generally speaking, digging the earth in a dream is bad because it unveils what is hidden. The dirt itself represents a woman's property. To shake the dust off one's hands in a dream means business losses, poverty, and humiliation. It also means remitting savings to their rightful owners. Walking on dirt means soliciting money. Collecting dirt means saving money. Sweeping dirt in one's house means to swindle money from one's wife. Earth also represents man's longevity. If one sees their wife carrying a bag of dirt in a dream, it means a suspicious pregnancy. Earth in a dream also represents the four elements fire, water, air, and either, for it is one of the main elements in nature. Wiping one's face with dirt in a dream means praising others or disappointing oneself. Earth in a dream also means satisfaction of one's needs or fulfillment of a promise, because ink is extracted from its elements. If a merchant sees his merchandise covered with dirt in a dream, it means depression and unsalability of his merchandise."}, {"id": "earth-second-meaning", "label": "Earth-second-meaning", "category": "Earth", "meaning": "(Country, Farm, Floor, Glob, Land, Locality, Place, Property) In a dream, each locality has a particular meaning that relates to its substance and conditions. To see the land of the great gathering on the Day of Resurrection in a dream means the fulfillment of a promise, or that the person seeing the dream is worthy of keeping secrets. Earth in a dream also means becoming rich after poverty, or having peace after experiencing extreme difficulties. It also means a marriage to a beautiful young virgin, or it could mean receiving guidance and attaining a high ranking and an honourable position in the world. To see the globe being carried on the back of a whale or a steer without changing its conditions in a dream means that the king of the country will be dethroned. He will either step down or be replaced by his minister. Sweeping the floor and caring for the floor mat or carpet in a dream means caring for one's community or family. Earth in a dream also represents one's mother, or the governor of the land. Working in a farmland in a dream, seeing its tools, elements, seeds, water, plowing, harvesting, landscaping, blossoming of its flowers, their fragrance, light, whatever positive or negative results one sees therein in a dream represent such success or failure. Seeing an unknown land could denote one's mother, child, husband, wife, partner, guardian, a servant, or it could mean one's heirs. Earth in a dream may also mean arguments, knowledge, or clarity of speech. Earth in a dream also represents the element of the world, as the skies represent the element of the hereafter. If both the earth and the skies are seen simultaneously in a dream, it means that they can never be joined together, as the world and the hereafter do not exist in one place. If the topsoil of the land is cracked in a dream, it means that the land is rich and arable. Such cracks in a dream also signify the rise of invented religious dogmas and the spread of evil and innovation. Seeing the stretch of the land in a dream means the release of prisoners, or, in the case of a pregnant woman, it means the nearing of her delivery. If one sees an earthquake and the destruction of life and property in a dream, this element represents straying from the path, pride, and heedlessness. If the earth appears to fold over him in a dream, it means losing one's stature in the world, divorce, or losing in business. If the earth changes into iron or rocks in one's dream, it means that one's wife will not bear children, or it could mean changing one's trade or profession. If the earth opens and swallows him in a dream, it means that he is ashamed of something he did, or it could mean hurdles in one's business, a journey, or imprisonment. If the earth looks like a desert land in the dream, it may mean that such a person may undertake an urgent trip. Beating the ground with a stick in a dream means taking a business trip. Eating dirt in a dream means earning an equal amount of money to what one eats in their dream. If the earth cracks and opens, and if a beast comes and speaks to the people in their tongue in a dream, it means that people will witness a miracle or a happening that will bewilder everyone. This may also mean nearing the end of one's life. Digging the earth in a dream also means plotting and deceiving others. If the earth speaks good words to someone in a dream, it means that he or she will attain whatever they are told. On the other hand, if the earth reprimands someone in the dream, it means that he must amend his actions for the better and ask for God's forgiveness and guidance."}, {"id": "earthenware-jar", "label": "Earthenware jar", "category": "Objects", "meaning": "(See Jar)"}, {"id": "earthenware-pot", "label": "Earthenware pot", "category": "Objects", "meaning": "In a dream, an earthenware pot means a sharing neighbour. It also means a modestly dressed woman, her estate, family, and children. If the pot is made of brass or ceramic in the dream, it may represent a poor woman. An earthenware pot in a dream also means decision-making, concealing one's secrets, or it could represent a woman who has frequent miscarriages. (Also see Earthenware jar, Jar, Pot)"}, {"id": "earthquake", "label": "Earthquake", "category": "Earth", "meaning": "In a dream, an earthquake represents fear of a higher authority. An earthquake in a dream is also interpreted to indicate major changes in that particular place, or a calamity that will befall a town or a country. If one sees the mountains rumbling, shaking, and crumbling, then being restored to their original state in a dream, it means that a great happening will devastate such a place. If one sees the earth shaking or caving in, and if everything sinks into the ground, hitting a segment of the community and sparing another segment of it in the dream, it means that a calamity will befall that place, and it will manifest through social disorder, injustices, or a plague. If one sees the earth shaking and the firmament rent asunder in a dream, it means that major adversities will hit their properties, cattle, farms, and institutions, etc., as a divine chastisement for people's sins. If one sees the earth moving under his feet in a dream, then it represents one's striving and pursuit of his business needs or livelihood. An earthquake in a dream also represents exposing secrets, hearing bad news, a general scare, public disturbances, and the surfacing of new diseases. If one sees the walls crumbling and caving in a dream, it means his death. Seeing an earthquake in an arable land in a dream means fertility or a good harvest. An earthquake in a dream may also mean travels, dancing, abstraction of business, or having an argument with one's family. If the destruction hits the buildings in urban areas in the dream, it means business growth for construction workers, contractors, or related industries. Seeing an earthquake hit a fruit farm in a dream means a good harvest. If the quake takes place during May, it means a fierce battle, fights between people, or public disorder. If one's dream takes place during June, then it means the destruction of evil trades and their people. If the dream takes place during the daylight hours, then it means the appointment of people of knowledge to leading positions in the government. If one dreams of an earthquake during July, it means that a great person will die in that place. If it takes place during August, it means that an enemy will attack that country. If it takes place during September in the dream, it means that a stranger will enter that town and subsequently, the town will be hit with a severe plague and sufferings. If it takes place during October in one's dream, then it represents a common illness, the safety of pregnant women, and the lowering or stabilization of prices. If it takes place during November in the dream, it means frequent miscarriages. If it takes place during December in a dream, then it represents severe calamities, plagues, and death, though no enemy threat is visible. If it takes place during January in one's dream, then it means the death of young people. If it takes place during February in the dream, then it means hunger and miscarriages. If it takes place during March in the dream, then it means prosperity and a good harvest. If a pregnant woman sees an earthquake in her dream, it means that she is delivering her baby. (Also see Cave in, Destruction, Earth, Thunder, Tremor)"}, {"id": "earthworm", "label": "Earthworm", "category": "Animals", "meaning": "Seeing an earthworm in a dream means facing a weak enemy. (Also see Rainworm)"}, {"id": "earwax", "label": "Earwax", "category": "Human Body", "meaning": "(Auditory meatus, Cerumen) If one sees himself cleaning the yellowish wax-like secretion found in the canal of his external ear, or if he is cleaning it from someone else's ears in a dream, it means that he will acquire a needed antidote or poison or become free from the plot of envious people. If one cleans his ears from earwax or other dirt in a dream, it means that he will hear good and pleasing news. If one sees himself eating the earwax he extracts from his ears in a dream, it means that he is a child molester. Cleaning the wax from one's ears in a dream also means hearing pleasing news. (Also see Ear)"}, {"id": "earwig", "label": "Earwig", "category": "Animals", "meaning": "(Beetle, Insect, Worm) An insect with pincers that seeks out the human ear to crawl into his body (folk). In a dream, an earwig represents the enemy of the leaders."}, {"id": "eating", "label": "Eating", "category": "Action", "meaning": "(See Food)"}, {"id": "eating-to-one's-fill", "label": "Eating to one's fill", "category": "Action", "meaning": "(See Appetite)"}, {"id": "eavesdropping", "label": "Eavesdropping", "category": "Action", "meaning": "In a dream, eavesdropping means backbiting and lies. Perhaps the one who is eavesdropping on others may become despised by the ruler or his superior. On the other hand, if one sees himself in a dream inadvertently listening to a conversation, and if the one seeing the dream is a merchant, it means that he will resign from the leadership of his business, and if he is a ruler, it means that he will be removed from his post. If one sees himself harkening to another person in a dream, it means that he desires to defame him or expose his pitfalls. If one sees himself listening to some talks of which he follows the better avenues in the dream, it means that he will receive glad tidings. If one sees himself listening to admonition but ignoring it in a dream, it means that he lies as a habit."}, {"id": "ebbing", "label": "Ebbing", "category": "Water", "meaning": "(See Ship)"}, {"id": "ebony", "label": "Ebony", "category": "Trees", "meaning": "(bot.) An ebony tree in a dream represents a rich Indian woman or a rich, strong man."}, {"id": "eclipse", "label": "Eclipse", "category": "Celestial Bodies", "meaning": "(Lunar eclipse, Solar eclipse) Seeing a solar eclipse in a dream means that a calamity will befall the leader of a country, while a lunar eclipse represents a calamity that will befall the prime minister. It is also said that a solar eclipse in a dream signifies the death of one's wife or his mother. If a cloud covers the light of the sun in a dream, it means that a sickness will befall the leader of the country or the governor of the land. If one sees the sun moving above the clouds but cannot come from under it in a dream, it means his death. The sun in a dream may also represent a great scholar. A cloud covering the sunlight in a dream means the fall of an unjust ruler. (Also see Moon, Sun)"}, {"id": "edible-roots", "label": "Edible roots", "category": "Food", "meaning": "(See Taro)"}, {"id": "edifice", "label": "Edifice", "category": "Objects", "meaning": "(See Monument)"}, {"id": "educator", "label": "Educator", "category": "Types of People", "meaning": "(Instructor, Master, Mentor, Teacher) In a dream, an educator or a teacher represents himself, or he could represent the principal of a school, or a model, a pillar, a shaikh, a jailer, one's son, or one's mother. An educator in a dream also means a coach or an animal trainer. Seeing oneself as an educator in a dream means advancing in one's field. A math teacher in a dream represents intellect and wisdom. Adding, subtracting, multiplying, or dividing in a dream represents the common benefits and losses one incurs during their life. A Qur'an teacher in a dream represents singing, honour or favours. An unknown teacher in a dream represents the Almighty God Himself. (Also see Teacher)"}, {"id": "effeminate", "label": "Effeminate", "category": "Types of People", "meaning": "(Lesbian, Sodomy, Transvestite, Vagina) If one sees himself acting effeminately in a dream, it means evil, distress, fear, or that a calamity will befall him. If an effeminate person sees himself having a vagina in a dream, it means that he has two faces or that he is satisfied to be knowledgeable as well as a fraud. If an effeminate person or a homosexual looks at his male organ and finds no female organ beside it in the dream, it means that he will repent and back up from his loathsome conduct and revert to his natural sexual condition. If an effeminate person who is also bisexual sees himself as having a vagina, or if he looks at his penis in a dream, it means separation from his wife or mother or segregation from his friends. (Also see Sexual intercourse, Vagina)"}, {"id": "efforts", "label": "Efforts", "category": "Action", "meaning": "Making serious efforts to attain something noble in a dream means reaching one's goals. (Also see Grandfather)"}, {"id": "eggplant", "label": "Eggplant", "category": "Food", "meaning": "In season, an eggplant in a dream means earnings with little effort, while seeing an eggplant out of season in a dream denotes negativity and dislike. Eating an eggplant in a dream means falling prices. An eggplant in a dream also represents the element of arrogance, self-adulation, perfidy, cheating others, and a man with many faces. As for fishermen, seeing eggplants in a dream means a good catch, joy, and success."}, {"id": "eggs", "label": "Eggs", "category": "Food", "meaning": "(Eggs in a basket or a place.) Eggs represent the element of prosperity, or the fear of depleting one's riches. Eggs in a dream also represent marriage for an unmarried person and children for a married one. If one's chicken lays eggs for him in a dream, it means a newborn in his family. Eating a boiled egg in a dream means comfort and income, while eating a raw egg means unlawful earnings, adultery, or distress. If one sees his wife laying an egg in a dream, it means that she will bear a child who will lack faith in God. If the egg breaks in the dream, it means that his newborn will die shortly after birth. If one sees himself raising chickens for eggs, then if the eggs hatch in his dream, it means that some of his affairs that were unsolvable will rejuvenate with success, and it could mean that he will beget a child who will grow to have true faith in God Almighty. He may also beget a child for each egg that hatches in his dream. Eggs in a basket in a dream also represent a family reunion. (Also see Boiled eggs, Omelet)"}, {"id": "egypt", "label": "Egypt", "category": "Earth", "meaning": "(See City, Pyramids)"}, {"id": "eid", "label": "Eid", "category": "Days of the Week", "meaning": "(arb. Celebration, Festival. See Five times prayers)"}, {"id": "eid-ul-adha", "label": "Eid-ul Adha", "category": "Days of the Week", "meaning": "(arb. See Immolation, Feast of Immolation, Five times prayers)"}, {"id": "eid-ul-fitr", "label": "Eid-ul Fitr", "category": "Days of the Week", "meaning": "(See Feast of Breaking the Fast)"}, {"id": "elation", "label": "Elation", "category": "Mood", "meaning": "(See Happiness)"}, {"id": "elderly-person", "label": "Elderly person", "category": "Types of People", "meaning": "An unknown elderly person in a dream represents one's good luck, happiness, and one's assiduity and diligence. If the unknown elderly person looks strong in the dream, he represents one's strength. Otherwise, if he looks feeble, then he represents one's weakness. Whatever physical conditions an elderly person is seen with in the dream, such a condition will reflect in one's state. If an elderly person comes toward the person seeing the dream, it means that someone will help him attain a praiseworthy rank. If one follows an elderly person in a dream, it means that he follows a good path. If one sees an elderly person and displeases him in the dream, it means that he will displease a close friend or reject his advice. If he pleases him in the dream, it means that he will consent with a close good friend, and they will walk together on the path to reap material as well as spiritual benefits. If one sees a gathering of friendly people but cannot determine whether they are young or elderly in a dream, it means that he will discover new avenues in his life, and he will draw material and spiritual benefits from them. If he sees a gathering of young people he does not recognize in the dream, it means that he will associate himself with rich people. If he sees a gathering of elderly people he does not recognize in the dream, it means that he will associate himself with good friends. If a woman sees an elderly person she could not recognize in the dream, he represents the world. If a young man sees himself turned into an elderly person in a dream, it means that he will acquire knowledge and wisdom. Listening to a good-looking elderly person in a dream means receiving honour and rank. If an elderly person sees himself turned young in a dream, it represents his strength, wealth, good living, and a healthy life, or it could mean material or religious losses, or it could mean his death. If an elderly person sees himself being born again in a dream, it means his death. If he is ill, it could represent his attachment to the world, and if he is poor, it could denote his earnings. If an elderly person sees himself as a youth in a dream, it could also mean committing a childish act or an unwise act. A wise elderly person in a dream represents honour, rank, dignity, wealth, blessings, and longevity. On the other hand, seeing an elderly person in a dream could represent failure, weaknesses, defeat, disability, or inertness. (Also see Grey hair)"}, {"id": "elders", "label": "Elders", "category": "Types of People", "meaning": "(Chancellors, Councilmen, Leaders, Seniors, Wise men) Seeing the elders of a community, the councilmen of a city, the chiefs of a clan, or the sheikhs of a tribe in a dream means victory and glad tidings."}, {"id": "election", "label": "Election", "category": "Action", "meaning": "(See Rising in station)"}, {"id": "electuary", "label": "Electuary", "category": "Food", "meaning": "(Medicinal paste, Ointment, Salve) Licking a paste made from drugs mixed with honey or syrup, or applying a salve in a dream, means recovering from an illness or having a sizeable offspring."}, {"id": "elegance", "label": "Elegance", "category": "Mood", "meaning": "(Culture, Handsomeness, Refinement, Sophistication) To see oneself handsome, elegant, or sophisticated in a dream signifies distress, trouble, false accusations, absenteeism, or it could mean freedom."}, {"id": "elephant", "label": "Elephant", "category": "Animals", "meaning": "A chronic disease that is characterized by the enlargement of certain parts of the body, especially the legs and genitals. In a dream, an elephant man represents love for the world from the wrong angle."}, {"id": "elephant", "label": "Elephant", "category": "Animals", "meaning": "(Arrogance) In a dream, an elephant represents a respected and feared enemy who is dull-witted, who carries heavy burdens or responsibilities, and who is expert in war tactics. An elephant in a dream also signifies arrogance. Riding an elephant or controlling it in a dream means establishing ties with a leader or a politician and profiteering from one's connection. It also means living a long and prosperous life. Riding an elephant during the nighttime in a dream means rising in rank, and should one be suited for leadership, he will receive it, then engage in a war which he will lose. Riding an elephant during the daylight hours in a dream means divorce, perfidy, betrayal, or deceit. Milking an elephant or taking something out of its trunk in a dream means either extortion or receiving lawful money from a powerful person. It is also said that an elephant in a dream represents a mighty king who is gracious and generous, patient and tender-hearted. If an elephant hits someone with its trunk in a dream, it means receiving benefits from such a person or inheriting something from him, receiving a political appointment, or becoming wealthy through high connections. An elephant in a dream also represents righteous people, scholars, and noble ones. An elephant in a dream also denotes hardships, toiling, and then relief from adversities. Seeing an elephant in a dream and failing to ride on it means a lack of integrity or loss of business. Seeing a dead elephant in a dream means that the ruler or a great person from that land will die, or that a noble person will be killed. Seeing an elephant in a land other than its native land in a dream means adversities. If one faces a threatening elephant in a dream, it means an illness. If one falls under the feet of an elephant in a dream, it means his death. Speaking to an elephant in a dream means receiving a precious gift from someone in authority. Running away in fear of an elephant in a dream means being persecuted by someone in authority. Riding an elephant during a war in a dream means defeat and subsequent destruction. Eating elephant meat in a dream means money. As for worldly people, seeing an elephant in a dream means benefits, but as for pious and religious people, it denotes adversities. Riding an elephant in a dream may also denote lies or oppression. An elephant entering a land other than its natural habitat signifies an official visit of a king or a president to another country, or it could mean invading it."}, {"id": "elephant-trainer", "label": "Elephant trainer", "category": "Types of People", "meaning": "An elephant trainer in a dream represents the master teacher of children of noble families, a horse trainer, a sports trainer, or a translator. (Also see Elephant)"}, {"id": "elephantiasis", "label": "Elephantiasis", "category": "Human Body", "meaning": "(med. See Elephant Man)"}, {"id": "elevation", "label": "Elevation", "category": "Earth", "meaning": "Elevation in a dream may represent one's wife. (Also see Hill)"}, {"id": "elf", "label": "Elf", "category": "Jinn", "meaning": "(Abnormal, Albino, Elf, Leprosy, Whitish) An elf in a dream represents a person of evil nature who creates disunity and enmity between people through backbiting, insinuations, slanders and who advises them against good deeds. In a dream, an elf also represents poverty, sorrows, humiliation, or adversities caused by people who wander between towns and cities as a habit. If an elf visits a sick person in a dream, it means death."}, {"id": "elixir", "label": "Elixir", "category": "Objects", "meaning": "(See Antidote)"}, {"id": "eloquence-of-speech", "label": "Eloquence of speech", "category": "Feelings", "meaning": "(Clarity of speech, Fluency) To have fluency and eloquence of speech in a dream means being honoured, dignified, becoming a knight, or being endowed with immeasurable wealth, or it could mean extension of one's powers and control, prosperity from one's business, fame, or it could mean attaining excellence in one's craft or trade. In general, eloquence of speech in a dream signifies honour and deputyship."}, {"id": "emaciated", "label": "Emaciated", "category": "Human Body", "meaning": "(Poverty, Skin)"}, {"id": "embalming", "label": "Embalming", "category": "Action", "meaning": "(See Mummification)"}, {"id": "embrace", "label": "Embrace", "category": "Action", "meaning": "(Accolade, Hug) Embracing someone in a dream means longevity. Embracing a deceased person also means longevity. If a deceased person embraces the person seeing the dream and does not let go of him in a dream, it means his death. Embracing a known person in a dream means associating with him. Embracing one's enemy in a dream means making peace with him. It is also said that an embrace in a dream signifies exchanging praises. An embrace in a dream also signifies kindness, liking for one another, travels, arriving from a journey, and dispelling distress or anxiety. An embrace in a dream is also interpreted to mean having sexual intercourse. Embracing a woman in a dream means love for the world, and despair from receiving any reward in the hereafter. Embracing a man in a dream signifies lending him support and helping him. Embracing the trunk of a tree in a dream means indulging in hypocrisy. Embracing someone and laying one's head in his lap in a dream means entrusting him with one's capital, or working for him. (Also see Envelope, Hug)"}, {"id": "embroider", "label": "Embroider", "category": "Action", "meaning": "An embroiderer in a dream represents a bright and intelligent person, a trickster, or someone who embellishes his words and exaggerates his explanations, or he could represent a writer, a man of letters, a refined person, a poet, or a fine singer. (Also see Monogram)"}, {"id": "emerald", "label": "Emerald", "category": "Objects", "meaning": "Seeing an emerald in a dream denotes martyrdom or the blessings that are created for a believer in paradise. If one buys an emerald in a dream, it means that he will win over a dear brother, associate himself with a group of righteous brothers on the path, raise well-behaved children, acquire useful knowledge, or earn lawful money."}, {"id": "emergence", "label": "Emergence", "category": "Action", "meaning": "(See Appearance)"}, {"id": "employee", "label": "Employee", "category": "Types of People", "meaning": "(See Accountability, Office)"}, {"id": "employment", "label": "Employment", "category": "Action", "meaning": "(See Accountability, Office)"}, {"id": "emptiness", "label": "Emptiness", "category": "Feelings", "meaning": "In a dream, emptiness represents the dwellings of a foreigner. It may also represent breach of contract, betrayal, death of a sick person, rest after exhaustion or peace after bewilderment. (Also see Deserted)"}, {"id": "empty", "label": "Empty", "category": "Feelings", "meaning": "(See Deserted, Emptiness)"}, {"id": "enacting", "label": "Enacting", "category": "Action", "meaning": "Enacting ablution rites or performing the acts of ritual ablution without water (arb. Tayammum) in a dream means nearing the solution of one's problems. (Also see Tayammum)"}, {"id": "enamellist", "label": "Enamellist", "category": "Types of People", "meaning": "(Coating, Glazier, Pride) In a dream, an enamellist represents someone who is proud of himself or who is arrogant and deceives himself about his greatness, wealth, and attainments, or who mixes with and befriends stupid people and opens his heart to them."}, {"id": "enamoured", "label": "Enamoured", "category": "Feelings", "meaning": "(Love, Poverty) To see oneself inflamed with love for someone in a dream represents distress, adversities, blindness, deafness, or notoriousness. Such a case may draw people's compassion. If a sick person sees himself in a dream inflamed with love it may mean his death. Fire in a dream also means love. Love in a dream also means heedlessness and failure to fulfill one's religious obligations. It also means financial losses, losing one's child, divorce, demise of one's friends, hunger, travels, sickness, or dangers. Being enamoured with God in a dream means a strong devotion and certitude. Pretending to be in love in one's dream means straying from God's path. If one finally reaches his beloved or mates with him in the dream, it means that adversities may strike at him or affect his beloved. (Also see Love)"}, {"id": "enclosure", "label": "Enclosure", "category": "Objects", "meaning": "(See Hedges)"}, {"id": "encroachment", "label": "Encroachment", "category": "Action", "meaning": "(See Infringement)"}, {"id": "encyclopaedia", "label": "Encyclopaedia", "category": "Objects", "meaning": "(See Reference book)"}, {"id": "endowment", "label": "Endowment", "category": "Objects", "meaning": "(Alms, Charity, Contribution, Donation, Fulfilling needs, Gift, Offering, Profits, Religious endowment) Making a religious endowment in a dream represents good deeds that are done for God's pleasure, seeking to be in His nearness, and asking for His blessings. Making a religious endowment in a dream also means rising in station, both in this world and in the hereafter. If what one donates for this purpose is a house or a book, or money in the dream, it means repentance from one's sins and guidance on the straight path, or it could mean begetting a son. Offering a swine or wine as an endowment in a dream means rising in rank in the world, injustice, and causing harm to others."}, {"id": "enemy", "label": "Enemy", "category": "Types of People", "meaning": "(Adversary, Boy, Foe, Hidden treasure, Opponent, Power, Snake, Unjust ruler, Woman) To meet an enemy in a dream signifies honour, signing a treaty, rising above differences, receiving God's help, and victory. Facing one's enemy in a dream also means befriending him. If one is threatened by his enemy in a dream, it means that he will win the upper hand. If one is promised good things by his enemy in a dream, it means that he will fall into his trap and lose his fight against him. If one's enemy advises him in a dream, it means that he will betray him. If one sees an enemy invading a land in a dream, it means that a destructive flood will devastate that place. If one's enemy confides in him or pleases him in a dream, it means that he will suffer distress and adversities. If one is captured for a ransom by his enemy in a dream, it means that he indulges in sins and that he is a hostage of his sins. (Also see Blessings, Enmity, Introduction p. xxii)"}, {"id": "engagement", "label": "Engagement", "category": "Action", "meaning": "(Betrothal, Marriage. See Book)"}, {"id": "engineer", "label": "Engineer", "category": "Types of People", "meaning": "(See Architect, Artist)"}, {"id": "english", "label": "English", "category": "Other", "meaning": "(See Language)"}, {"id": "english-ivy", "label": "English ivy", "category": "Plants", "meaning": "(See Ivy)"}, {"id": "engraver", "label": "Engraver", "category": "Types of People", "meaning": "(Goldsmith, Leather craftsman, or any craft using a hammer and a chisel.) An engraver in a dream represents knowledge and the pursuit of the prophetic traditions. In a dream, an engraver also means deception, trickery and imposing credulity upon others through dishonesty. A stone carver in a dream represents someone who deals with people of ignorance. A copper engraver represents disputes and illness. Gold and silver engraver in a dream represents clear wisdom and putting things where they belong. An engraver in a dream also represents a worldly person. If he also deals with fabrics in the dream, it means that he is a peacemaker. Seeing him also means spending one's money to serve evil people or investing money in their projects, lies, falsehoods, and hypocrisy. The customers in the dream represent people who prefer worldly and temporary benefits over the eternal rewards and benefits of the hereafter. If the engraver sells the merchandise but does not accept money for it in the dream, it means that he prefers his spiritual life over his temporary material pleasure and that he is grateful to God Almighty. If he asks for a price for his services, then it means the opposite. If the engraver barters what he sells for wheat or flour in the dream, it means that he will become detached from worldly interests, and that he is grateful for his Lord's blessings. An engraver in a dream also represents a person who teaches arts and science."}, {"id": "enhancement", "label": "Enhancement", "category": "Action", "meaning": "(See Eye-brow)"}, {"id": "enjoyment", "label": "Enjoyment", "category": "Feelings", "meaning": "(See Pleasure)"}, {"id": "enlist", "label": "Enlist", "category": "Action", "meaning": "(See Conscription)"}, {"id": "enmity", "label": "Enmity", "category": "Feelings", "meaning": "(Conflict, Discord, Rupture, Spitefulness) To show enmity toward someone in a dream means desiring to remain in his company, showing him friendliness, then divulging his secrets or exposing his feelings. To face someone's animosity in a dream means becoming friendly with him, for enmity means uncovering what is hidden. (Also see Enemy, Rupture of relations)"}, {"id": "enoch", "label": "Enoch", "category": "Prophets", "meaning": "(See Khidr, Green)"}, {"id": "entering-paradise", "label": "Entering Paradise", "category": "Action", "meaning": "If one sees himself entering the heavenly paradise in a dream, then his dream represents glad tidings that God willing, he shall enter it. If a pilgrim sees himself entering paradise in a dream, it means that his pilgrimage is accepted or that he will reach God's House in Mecca. If he lacks faith in God Almighty, it means that he will become a believer. If a believer who is bed-stricken sees himself entering paradise in a dream, it means that he will die of his illness. If a non-believer who is bed-stricken sees himself entering paradise in a dream, it means that he will recover from his illness. If he is unwed, it means that he will get married. If he is poor, it means that he will become rich or receive an inheritance. If a sick person sees himself in the abode of the hereafter healthy again in a dream, it means that he will reach it free from the ills of this world, its adversities, and temptations. If he is not sick, then entering the realms of the hereafter means glad tidings, business success, a pilgrimage, ascetic detachment from this world, sincere devotion, acquiring knowledge, strengthening of one's kinship, or exercising patience toward a calamity that derives from one's sins. If one sees himself entering the abode of the hereafter to visit and see around, and should he be a person of good deeds and character who is capable and who acts upon his knowledge, it means that he will be without work or suffer from business losses. If he is scared of something, or if he is accused of something, or if he is under stress, it means that his fears will dissipate. Mostly, entering the abode of the hereafter in a dream means travels or migration from one's homeland. Thus, if one sees himself returning from a journey to the hereafter in a dream, it means that he will return to his homeland. Entering paradise in a dream means a pilgrimage to God's House in Mecca."}, {"id": "entering-a-house", "label": "Entering a house", "category": "Action", "meaning": "If one sees himself entering someone else's house in a dream, it means that he will defeat him, gain the upper hand in business over him, or control his interests. To enter the house of the governor and to feel comfortable and at ease therein in a dream means that he is soliciting the governor's assistance in a personal business. The coming of a just person to a house in a dream means blessings. If an unjust person enters a place in a dream, it means that evil and calamities will befall such a house. If it is customary for such a person to enter that place, then no harm will be incurred from his coming or going. If one sees himself entering a house of unfamiliar substance, ground, or structure, and if he meets departed souls whom he recognizes in the dream, it means that he has entered the realms of the dead. If he sees himself going into that sphere, then coming out of it in the dream, it means that he will be near his death, then recover from a serious illness. Entering the Sacred House in Mecca in a dream means entering one's house as a newlywed. (Also see Marketplace)"}, {"id": "entering-hell-fire", "label": "Entering hell-fire", "category": "Action", "meaning": "In a dream, if one sees himself entering hell-fire, whether he is a believer or a non-believer, it means that he will suffer from fever, become poor, enter a prison, commit a major sin, or mix with disbelievers and reprobates."}, {"id": "entertainer", "label": "Entertainer", "category": "Types of People", "meaning": "An entertainer in a dream represents a person who claims to be generous, and who commands generosity for others."}, {"id": "entice", "label": "Entice", "category": "Action", "meaning": "(Incite, Induce, Lure, Research, Urge)"}, {"id": "entwine", "label": "Entwine", "category": "Action", "meaning": "(See Twist)"}, {"id": "enumerate", "label": "Enumerate", "category": "Action", "meaning": "(See Counting)"}, {"id": "envelope", "label": "Envelope", "category": "Objects", "meaning": "(Cover, Embrace, Postal package) An envelope in a dream means money, except if it is sealed, then it means travel. In a dream, an envelope also means victory in one's life, attainment of one's goal, learning about a pleasant story, or it could represent a vessel, money, or knowledge."}, {"id": "epidemic-disease", "label": "Epidemic disease", "category": "Human Body", "meaning": "Witnessing an epidemic disease causing a high rate of mortality in a dream represents a tyrant, government, imprisonment, or evil happenings."}, {"id": "error", "label": "Error", "category": "Feelings", "meaning": "(See Darkness, Wandering)"}, {"id": "escape", "label": "Escape", "category": "Action", "meaning": "If one sees himself walking across hills in a dream, it means that he is trying to escape from danger. (Also see Escape from danger, Running away)"}, {"id": "escape-from-danger", "label": "Escape from danger", "category": "Action", "meaning": "Escaping from danger or surviving a would-be fatal accident in a dream denotes one's devotion, religious awareness, fasting, charities, and good deeds. (Also see Escape, Running away, Take a flight, Turning)"}, {"id": "escort", "label": "Escort", "category": "Action", "meaning": "(Convoy, Guide, Helper) In a dream, an escort means travels, or a barber, a hairdresser, the title collector, a collection agent, an emissary, or a trader."}, {"id": "escrow", "label": "Escrow", "category": "Objects", "meaning": "(See Guarantee)"}, {"id": "esoteric", "label": "Esoteric", "category": "Other", "meaning": "(See Drums)"}, {"id": "espalier", "label": "Espalier", "category": "Plants", "meaning": "(See Vineyard)"}, {"id": "establishing-the-divine-laws", "label": "Establishing the divine laws", "category": "Action", "meaning": "If one is required in his dream to circumscribe to the limitations placed by God on man's freedom of action in the world, or if one asks that such judgment be exacted in his case, his dream then represents paying one's debts, or respecting one's limitations, or marriage to protect one's chastity."}, {"id": "estate", "label": "Estate", "category": "Objects", "meaning": "(Farmland) In a dream, a farmland represents wealth and benefits, for cities live from the produce of a farmland. A farmland in a dream also represents stored grains or fruits, or vegetables. Anything that affects the farmland, such as drought, inundation, diseases, or a fire in a dream, will manifest in people's lives in the cities. A farmland in a dream also may represent one's livelihood and earnings, a patient and a helping wife, or a hard-working and patient husband. If one sees a blossoming farmland in his dream, it means blessings, growth, and profits from his work. A farmland in a dream also means wasting one's life in useless endeavours, or it could mean heedlessness, lack of comfort, pleasure in one's life, or neglecting to seek knowledge while occupying oneself in pursuing mundane objectives. (Also see Farm)"}, {"id": "estrangement", "label": "Estrangement", "category": "Feelings", "meaning": "(See Repudiation)"}, {"id": "eternity", "label": "Eternity", "category": "Other", "meaning": "(Heaven)"}, {"id": "etiquette", "label": "Etiquette", "category": "Other", "meaning": "(See Perfume salesman)"}, {"id": "eunuch", "label": "Eunuch", "category": "Types of People", "meaning": "(See Ostrich)"}, {"id": "euphrates", "label": "Euphrates", "category": "Water", "meaning": "(River, Sweet water) Drinking from the Euphrates River in a dream means blessings and grace, for the Euphrates is one of the rivers of paradise. Drinking from the Euphrates River in a dream also means being a pious, content, and religious person. If one sees the Euphrates river dry in a dream, it means the death of the governor, or the loss of a country, or perhaps the meaning could apply to the chief minister, or the personal secretary of the ruler. (Also see River)"}, {"id": "evanescence", "label": "Evanescence", "category": "Feelings", "meaning": "(Annihilation, Disappearing, Non-existence) To vanish or be non-existent in a dream means depression, nullifying all banknotes during a war, cancelling all interests and credits, a bad harvest, a plague, or it could mean a disaster. To be non-existent for the people of the path in a dream signifies an everlasting existence. (Also see Disappearing)"}, {"id": "eve", "label": "Eve", "category": "Prophets", "meaning": "(Mother of humankind, may God's peace be with her.) In a dream, Eve represents prosperity, blessings, a good harvest, a good yield, progeny, profits from a business in textile, farming, smithcraft, or similar industries. Seeing Adam and Eve in a dream means being demoted from a station and a place of honour to a lower rank to be raised again after repenting from one's sin. Seeing Eve in a dream also indicates pitfalls, sins, being subject to jealousy and malicious fraud, or trouble with one's neighbours. Seeing Adam and Eve in a dream also means hardships caused by one's wife or children, consent for sexual intercourse, repentance, or regret for one's past. If a woman sees Eve in her dream, it means that she will create hardships for her husband because of her association with someone who is unsuitable for her friendship. It also means that a major adversity will befall her, since Eve was the first to experience the female menstrual period and the pain of childbirth. It may also mean suffering from the burden of pregnancy, labour, and the pangs of giving birth. Seeing Eve in a dream could also mean giving birth to both righteous as well as evil children. If the woman in the dream is separated from her husband, it may mean returning to her conjugal life or earning lawful income for her own needs. It also could mean that someone from her progeny may commit murder or die as a martyr. If a man sees Eve in a dream, it means that he may be deceived by a woman or that he hearkens exclusively to the advice of his wife, or if he follows a woman's advice, it means that he will err and lose his leadership. If one sees Eve with her beautiful countenance in a dream, then she represents his mother, for Eve is the mother of humankind. Should he then be under the pangs of adversities, it means that he will be saved."}, {"id": "evening", "label": "Evening", "category": "Days of the Week", "meaning": "(Dark, Nightfall) In a dream, the evening signifies trickery, lies, corruption, and arrogance. The evening in a dream also means celebrating God's praises and remembering Him."}, {"id": "evenness", "label": "Evenness", "category": "Mood", "meaning": "(See Stabilizer)"}, {"id": "event", "label": "Event", "category": "Other", "meaning": "(See Milestone)"}, {"id": "evergreen", "label": "Evergreen", "category": "Trees", "meaning": "(Cypress, Pine) In a dream, an evergreen tree represents a beautiful woman or a man whose words do not conform to his actions, or it could mean a journey, children, longevity, or a generous son. (Also see Tree)"}, {"id": "evergreen-oak-tree", "label": "Evergreen oak tree", "category": "Trees", "meaning": "(See Oak tree)"}, {"id": "evergreen-tree", "label": "Evergreen tree", "category": "Trees", "meaning": "(See Camphor)"}, {"id": "eviction", "label": "Eviction", "category": "Action", "meaning": "(See Expulsion)"}, {"id": "evil-end", "label": "Evil end", "category": "Other", "meaning": "(See Wickedness)"}, {"id": "evil-sound", "label": "Evil sound", "category": "Feelings", "meaning": "(Braying of a donkey)"}, {"id": "evil-spirits", "label": "Evil spirits", "category": "Jinn", "meaning": "(Donkey, Braying of a donkey)"}, {"id": "ewe", "label": "Ewe", "category": "Animals", "meaning": "(Female sheep) In a dream, an ewe represents a woman, a wife, or prosperity. Running after a ewe and finding oneself unable to keep up or to catch it in a dream means chasing a woman and failing to seduce her. Milking a ewe in a dream means good profits for that year. Eating the meat of a ewe in a dream means inheriting a rich woman. If a ewe leaves one's house in a dream, it means divorce or the death of one's wife. If a ewe turns into a ram in a dream, it means infertility. A pregnant ewe in a dream means expecting to receive some money. Fighting with a ewe in a dream means an argument with a woman. Seeing a ewe in a dream also means distress, adversities, loss of one's husband or job. (Also see Ram, Sheep)"}, {"id": "exacting", "label": "Exacting", "category": "Action", "meaning": "(See Driving force)"}, {"id": "exalting-god's-oneness", "label": "Exalting God's Oneness", "category": "Action", "meaning": "Exalting God's oneness and sovereignty in a dream means receiving financial compensation for pain and suffering. To utter the formula: La ilaha ill Allah (there is no god other than Allah) in a dream means that one will only die having faith in his Lord. (Also see Exclamation of God's Sovereignty)"}, {"id": "examine", "label": "Examine", "category": "Action", "meaning": "(Touch) In a dream, examining means spying, eavesdropping, or paying attention to a conversation one should not listen to."}, {"id": "exasperation", "label": "Exasperation", "category": "Feelings", "meaning": "(Infuriation, Irritation, Jealousy) Exasperation without a reason in a dream means a sudden death. Exasperation in a dream also could signify involvement in a scandal or suffering from an illness that will help change one's attitude about life. If one sees himself infuriated or irritated by someone in a dream, it means that he will suffer the consequences of his qualities or lose money. Exasperation, infuriation, or irritation in a dream all mean poverty and loss of money. (Also see Infuriating)"}, {"id": "excavate", "label": "Excavate", "category": "Action", "meaning": "(See Digging up the past, Grave)"}, {"id": "exchange", "label": "Exchange", "category": "Action", "meaning": "(See Money exchanger)"}, {"id": "exchanging-letters", "label": "Exchanging letters", "category": "Action", "meaning": "(See War correspondent)"}, {"id": "excitement", "label": "Excitement", "category": "Feelings", "meaning": "(See Frothing at the mouth, Happiness)"}, {"id": "exclamation-of-god's-sovereignty", "label": "Exclamation of God's Sovereignty", "category": "Action", "meaning": "In a dream, exclamation of God's sovereignty, i.e., uttering the formula 'La Hawla Wa La Quwwata Illa Billah' (There is no will or power except that of God's Almighty), means constant repentance in wakefulness and hope for salvation. It also means conquering one's enemies. (Also see Exalting God's oneness)"}, {"id": "excrements", "label": "Excrements", "category": "Human Body", "meaning": "(See Dung, Excretion, Manure)"}, {"id": "excrete", "label": "Excrete", "category": "Action", "meaning": "(See Feces)"}, {"id": "excretion", "label": "Excretion", "category": "Human Body", "meaning": "(Ritual impurity) If one's bowels discharge excess excrement in a dream, it means hindrance of one's travel plans. If one discharges solid feces in a dream, it means that he does not spend his money on sickness. If it is an abnormal discharge of liquid matter from one's bowels in a dream, it means that he will squander most of his money. If one uses a lavatory near a known ablution area in the dream, it means that his spendings relate to his passion, desires, and wantonness. If the location is unknown in the dream, it means that he unknowingly, but willingly spends his wealth in unlawful avenues, whereby he will reap no reward or benefit from it. Discharging feces in the open and covering it with dirt in a dream means burying money in a hole and covering it with dirt. (Also see Impurity, Feces, Urinating)"}, {"id": "executioner", "label": "Executioner", "category": "Types of People", "meaning": "(Torturer) An executioner in a dream represents an insolent and insulting person, or he could denote a sickness, or the law."}, {"id": "exegesis", "label": "Exegesis", "category": "Action", "meaning": "(See Daniel, Piercing a hole)"}, {"id": "exhaustion-from-speaking", "label": "Exhaustion from speaking", "category": "Feelings", "meaning": "(Weariness, Tiredness, Fatigue) If one finds himself incapable of carrying a conversation out of exhaustion from speaking, or if he refrains from talking either about good or bad, and if this happens inside a courthouse in a dream, it means that he will give up his alibi and loses his case to his adversary, or it could mean that he will become poor and dependent on people's generosity or that he will become childless."}, {"id": "exhibition", "label": "Exhibition", "category": "Action", "meaning": "(Display, Hearing, Honor guards, Inspection of troops, Military review, Portrayal, Presentation, Review officer, Show) If one sees himself standing before a high-ranking officer during a ceremony of reviewing the guards of honour or a military barrack in a dream, and if the officer is displeased with him in the dream, it means that he will commit a major sin. If one thinks that the officer is pleased with him in the dream, then it implies God's blessings. The high-ranking officer or the review officer in such a dream also represents a compassionate person who cares, and who frequently asks about his friends, helps them solve their problems, and assists them in every possible way. (Also see Hearing board, Inquisitional court)"}, {"id": "exhilaration", "label": "Exhilaration", "category": "Feelings", "meaning": "(See Knitting)"}, {"id": "exhume", "label": "Exhume", "category": "Action", "meaning": "(Dig up a grave, Unearth) Exhuming the body of a deceased person and finding him alive in his grave in a dream means pursuing his tradition, knowledge, wisdom, trade, or practices. It also means acquiring lawful money. If one finds him dead in his grave, then there is no benefit in his striving. A grave robber or a body snatcher in a dream represents a deliberate and premeditated scheme to unravel a mystery, or forming an expedition to search for a hidden treasure. Digging the grave of a renowned scholar in a dream means studying his school of thought and the restoration of his studies, life, traditions, and prominence. (Also see Grave digger, Grave)"}, {"id": "exile", "label": "Exile", "category": "Action", "meaning": "(See Expulsion)"}, {"id": "expel", "label": "Expel", "category": "Action", "meaning": "(See Expulsion)"}, {"id": "expiation", "label": "Expiation", "category": "Action", "meaning": "(See Atonement)"}, {"id": "explorer", "label": "Explorer", "category": "Types of People", "meaning": "(Traveller, Migrator, Nomad) In a dream, an explorer represents an outgoing woman from a wealthy family. Seeing an explorer in a dream also represents a morganatic marriage or a marriage for pleasure which is governed by duration. An explorer in a dream also represents orphans, or children of sin."}, {"id": "explosion", "label": "Explosion", "category": "Action", "meaning": "(See Agitation)"}, {"id": "exposure", "label": "Exposure", "category": "Action", "meaning": "Exposing one's hidden knowledge in a dream means exposure to inner knowledge and working a noble trade. If the person in question is already a man of knowledge, then new spiritual revelations or those of material substance will be revealed to him and enrich his life."}, {"id": "expulsion", "label": "Expulsion", "category": "Action", "meaning": "(Banishment, Chasing away, Dismissal, Driving away, Eviction, Exile, Expel) Expulsion in a dream means imprisonment. It also means establishing the superiority of the one who gives the order and the proof of the subject's guilt. If one is exiled from his homeland in a dream, it means that he may enter a jail. If one is expelled from paradise in a dream, it means that he may experience poverty. If one evicts a man of knowledge or screams at him, or bewilders him in a dream, it means that he will face an extraordinary misfortune and confront a threatening and cruel enemy. If a religious and pious-looking person is evicted or driven away from a place in a dream, it means that he is failing to fulfill his religious vow, or it could mean that he is avoiding remaining in the company of true pious people, ascetics, people of knowledge, and noble ones. Expulsion in a dream could also denote misbehaviour or ill conduct on the part of the evictor."}, {"id": "extinguishing-a-fire", "label": "Extinguishing a fire", "category": "Action", "meaning": "Extinguishing a fire in a dream means putting off or quelling a riot, deterring a war, or abolishing innovation. If one sees himself in a dream smothering an already dead fire, it means that he is trying to rekindle an old war or to provoke evil between people."}, {"id": "extirpate", "label": "Extirpate", "category": "Action", "meaning": "(See Assault)"}, {"id": "extracting-oils-from-seeds", "label": "Extracting oils from seeds", "category": "Action", "meaning": "(Grinding, Pressing) Grinding or pressing nuts or seeds to extract their oils or butter in a dream means money and prosperity. Pressing ripe olives in a dream represents one's homeland. Pressing olives for their oil in a dream means relief from burdens or overcoming adversities, or it could represent true scholars, satisfying one's carnal desires, engaging in wrongdoing, receiving guidance, seeing the light, walking away from darkness into light, or it could represent one's earnings or benefits. Pressing sesame seeds or walnuts in a dream means prosperity and financial growth. Sesame oil in a dream represents a pious person who admonishes people and entices them to break their attachments to the world or to its temporary pleasures. Pressing sesame seeds in a dream also represents a successful businessman. Extracting hazelnut compound in a dream means money that is earned with hardship, or it could mean money that keeps growing. (Also see Juice, Oil press, Wine press)"}, {"id": "extravagance", "label": "Extravagance", "category": "Mood", "meaning": "(See Luxuries Shop)"}, {"id": "eye-doctor", "label": "Eye doctor", "category": "Types of People", "meaning": "(See Ophthalmologist)"}, {"id": "eye-inflammation", "label": "Eye inflammation", "category": "Human Body", "meaning": "(Disease, Ophthalmia) In a dream, eye inflammation means tightening of one's earnings, or it could mean heedlessness. Seeing one's eyes inflamed in a dream means that one's father or mother may fall sick. Inflammation of the eyes in a dream also denotes near blindness or suffering from a cataract. Any vision loss in a dream represents failing to properly perform one's religion, loss in business, or an indication of the state of one's children."}, {"id": "eye-makeup", "label": "Eye makeup", "category": "Objects", "meaning": "(See Kohl)"}, {"id": "eye-tooth", "label": "Eye-tooth", "category": "Human Body", "meaning": "(See Body, Tooth)"}, {"id": "eyebrows", "label": "Eyebrows", "category": "Human Body", "meaning": "Enhancing and beautifying the eyes. As for a man, his eyebrows represent his good nature and character, being handsome, religious, faithful, trustworthy, his status, and esteem. In a dream, eyebrows also mean love and unity. If a woman sees her eyebrows thick or if they are joined together in the dream, it means that she is a person of good character. Eyebrows in a dream also represent one's parents, brothers, partners, associates, or assistants. If the eyebrows grow extensively to nearly cover the eyes in the dream, it means changes in any of the above. Eyebrows in a dream also mean longevity. In a dream, eyebrows also indicate the state of one's spiritual standing. When beautiful, one's faith is beautiful, but when wild in a dream, it means that one's faith is deteriorating. Perhaps they could also represent one's guardian, governor, or they could represent a bow that launches the arrows of love at one's beloved. (Also see Body)"}, {"id": "eyedropper", "label": "Eyedropper", "category": "Tools", "meaning": "(Dropper) In a dream, a dropper signifies paying one's debts in instalments."}, {"id": "eyelash", "label": "Eyelash", "category": "Human Body", "meaning": "If one sees himself pulling someone's eyelashes in a dream, it means that he wants him to follow the avenues of innovation. (Also see Body)"}, {"id": "eyelid", "label": "Eyelid", "category": "Human Body", "meaning": "If one's eyelids are healthy in their dream and particularly for a woman, it indicates positive developments in her life. If one's eyelids have little skin, or if they are bleary, or if they develop sores in the dream, they represent difficulties, agony, anger, sickness, or distress. Eyelids in a dream also represent one's defences and protection. They also represent one's teacher, brothers, sisters, family, wife, children, coffer, veil, guards, confidant, or trustees. Eyelids in a dream also mean something to be overlooked. Having bleary eyelids in a dream means being in love. If one's eyes are interpreted to represent his wealth, then they mean protection, or paying alms tax. If the outer edge of the eyelid turns white in a dream, it means an illness affecting one's head, eyes, or ears. (Also see Body)"}, {"id": "eyes", "label": "Eyes", "category": "Human Body", "meaning": "Eyes in a dream represent religion or wealth. If one sees grass growing all over him but does not cover his ears or eyes in a dream, it means prosperity. One's eyes in a dream also represent his faith and the road to victory in this life and in the next. One's eyes in a dream could also represent his guidance or his heedlessness. Having many eyes throughout one's body in a dream represents one's piety, vigilance, and excellence of character. If one sees the eyes of his heart in a dream, it means that he sees with the light of clarity. If one sees a man looking at him with a side glance in a dream, it means that he will suffer from an adversity, mistrust, disapproval, suspicion, and disdain at the hands of such a man. If such a man opens his eyes and looks at him straight forward in the dream, it means that he will help him in his business or support his interests. If one's eyes turn into iron in a dream, it means distress, a scandal, or serious suffering from one's community. If one sees himself looking at women in his dream, it means that he commits adultery with his eyes by looking and desiring what is unlawful. If one looks at someone's eyes in a dream and likes them, it means that he will suffer from an adversity, religious corruption, or jealousy. If one sees himself having an extra eye inside his body in a dream, it means that he is an atheist. If one sees himself having an extra eye over his shoulder in a dream, it means that he will be named to receive money in absentia. If one sees his eyes transfixed in a dream, it means that he looks suspiciously at a relative or someone else's wife. Black eyes in a dream represent a religious person. A bluish-black eyes in a dream denote opposing one's religion. Blue eyes in a dream mean religious innovations. Green eyes in a dream mean a religion that is different from all religions. Sharp sight in a dream means blessings, while weak sight means joblessness and living from the generosity of others. If a father sees weakness in his sight in a dream, it means that a sickness will afflict his children. If one loses his eyes in a dream, it means the death of his children. If a poor person or a prisoner sees that in a dream, it means that he will never become free again or see any light for the rest of his life. If an oppressed person sees weakness in his eyes in a dream, it means that someone will help him overcome his adversities. If a traveller sees that dream, it means that he will never return to his homeland. If one sees that his eyes belong to an unknown person in a dream, it means that he will become blind. If he recognizes that person in the dream, it means that he will marry his daughter. If one's eyes fall into his lap in a dream, it means the death of his brother or son. The eyes of a human being in a dream also represent his beloved, his son, or his faith. Any defect in them in the dream may reflect in such people. Having one hundred eyes in a dream means money. The eyes of a ruler represent his spies. Eyes in a dream also represent a controller, a man, or a spring. Treating one's eyes with medicinal ointment in a dream means correcting one's religious life or begetting a son who will become the jewel light of his father's eyes, or if one's brother is exiled or deported from his homeland, it means that he will solicit him and entrust him with duties toward his family. If one sees his sight better than what people think in the dream, it means that his inner character is better than what people think, or if he sees his sight weakened, though people do not know about it in the dream, it means that he keeps his faith to himself. If one's eyes become white in a dream, they represent sorrow or loss of a beloved. If one sees his eyes white, and if the white veil is lifted in the dream, it means that he will be reunited with his beloved, and his distress will be dispelled. The right eye in a dream represents one's son, and the left eye represents one's daughter. If a father sees one of his eyes being transposed to mix with the other eye in a dream, and if he has a son and a daughter, he should separate their bedrooms. Eating someone's eye in a dream means stealing his money. Seeing one's eyes without eyelashes in a dream means defying God's laws. If one unplugs his eyelashes in a dream, it means that he will expose himself to his enemy. Seeing beautiful eyes in a dream could denote sorcery. black magic, life or death. Eyes in a dream also represent one's family, relatives, children, or workers. Eyes in a dream also signify mourning someone, or they could denote a sickness. Smearing one's eyes in a dream means calamities, sufferings, and punishment for one's sins. To guard one's eyes from looking at what is unlawful in a dream means heeding God's commands. (Also see Body)"}, {"id": "eyewitness", "label": "Eyewitness", "category": "Types of People", "meaning": "(See Witness)"}, {"id": "ezekiel", "label": "Ezekiel", "category": "Prophets", "meaning": "(God strengthened) Seeing God's prophet Ezekiel, upon whom be peace, in a dream means that one will receive the station of guardianship and trust."}, {"id": "ezra", "label": "Ezra", "category": "Prophets", "meaning": "(God's prophet Uzair, upon whom be peace.) One who sees him in a dream will win leadership by knowledge, writings, and wisdom."}]