[{"id": "haemorrhaging", "label": "Haemorrhaging", "category": "Human Body", "meaning": "(See Glass bottle)"}, {"id": "haft", "label": "Haft", "category": "Tools", "meaning": "(Handle of a dagger, or handle of a knife. See Knife handle, Turquoise)"}, {"id": "hag", "label": "Hag", "category": "Types of People", "meaning": "(See Old woman)"}, {"id": "hail", "label": "Hail", "category": "Weather", "meaning": "(Icy rain) In a dream, hail means calamity, sufferings, hunger, loss of property, poverty, mass persecution, or torture. In nature, this element cools the earth and eliminates many harmful insects, worms or scorpions and limits the danger of snakes. Thus, seeing hail in its proper season in a dream means eliminating the source of one's stress and overcoming one's difficulties, enemies, or jealous competitors. Seeing hail in the summertime in a dream means business losses, but if it falls in the winter in a dream, it means success and prosperity. Heavy falling hail in a dream means destruction of businesses, interruption of communication, and damage to roads and highways. In that sense, hail in a dream means obstruction of public interests. In a dream, hail also represents a strange type of business that will come from the direction of the wind carrying such a storm. If no harm occurs in one's dream, then hail represents glad tidings and especially if people start collecting it in bowls. If hail falls over a farmland without damaging it in a dream, it means a good harvest. If one gathers hail in his garment, or inside a cloth in a dream, it means that he will lose his riches, or it could mean the loss of an awaited shipment. (Also see Dew, Ice)"}, {"id": "hair", "label": "Hair", "category": "Human Body", "meaning": "In a dream, hair represents money and longevity. If a rich person ties a strand of hair to a bun of his own in a dream, it means an increase in his wealth and growth of his business based on a business loan or a mortgage. If a poor person sees that in a dream, it means that he will borrow money to pay for his debts and still borrow more money to pay for his daily expenses. If one sees his straight hair frizzed or curled in a dream, it means that he will be honoured, and if he sees his frizzed hair straight in a dream, it means that he will suffer from humiliation or lose his rank. If one with straight and lanky hair sees it longer than usual in a dream, it means that money belonging to someone for whom he works will be distributed, wasted, or lost. If one's hair is soft and lanky but still looks longer than usual in a dream, it means that his manager's authority will expand, and his interests will diversify. If a strongman or a warrior sees himself having a bun of hair in a dream, it means protection and respect inspired by a strong personality. Otherwise, if he is rich in the dream, a bun here means more wealth, and if he is poor, it represents his debts. If one's hair looks curly in a dream, it means that power, honour, and praise will be the lot of his superior. If a woman sees her hair straight in a dream, it denotes benefits and particularly if she uses a hairpiece or a wig as part of her makeup. Women receive benefits from braiding their hair in a dream, and it means saving money or investing it. Otherwise, if a poor person or a blind person braids his or her hair in a dream, then it means complications and difficulties, particularly when they are accustomed to doing so. If a sick woman sees herself braiding her hair in a dream, it means that she will die from her illness. If one sees his hair long to the extent that he could braid it together with his beard in a dream, it means debts. Shaving one's moustache, or under one's armpit in a dream, means paying one's debts, dispelling distress, or following good hygiene. Braiding one's hair in a dream also means mastering one's craft. Shaving one's head during the pilgrimage season in a dream means safety and protection. Shortening one's hair or removing unwanted hair during makeup in a dream means dispelling stress or being coerced to pay one's debts. If a thief or a fugitive sees himself grabbing his own long and lanky horse-like hair in a dream, it means that he will be captured. If one sees himself having hair like that of a hog in a dream, it connotes major calamities. If an unhappy person sees himself hairy in a dream, it means aggravation of his depression and unhappiness, while if a happy person sees himself hairy in a dream, it means an increase in his happiness. The black hair of a woman in a dream represents her husband's love for her. If a woman sees herself wearing a veil, or putting on a headpiece in a dream, it means a journey that will take her husband away from her for some time, or a journey from which he may never return. If she sees people looking at her hair in a dream, it means that she will suffer slander and defamation. If a man sees himself with horns formed from his hair in a dream, it means might and adroitness. If one sees the hair in the back of his head dishevelled or rumpled in a dream, it means that he will suffer humiliation. If he sees his hair on the right side of his head tousled in a dream, it means that he will molest male children from among his relatives.  If he sees his hair on the left side of his head tousled or dishevelled in a dream, it means that he will molest female children from among his relatives. If one does not have relatives, it means that they will suffer harm from their evil actions. If one sees long hair under his armpit in a dream, it means he will attain his goal, or it could denote his generous character. If he sees it thick in a dream, it denotes his thirst for knowledge, search for a business, or profiting through patience and endurance. If one sees his hair infested with lice in a dream, it means that he has a large family. If one sees his hair longer or thicker, and if he wishes in the dream to have that in wakefulness, it means that he will attain his goals, pay his debts, or prosper. If the length or thickness of one's hair is uncommon, and if one feels no offense to walk with it in the streets in his dream, it means debts, distress, and inability to take care of one's family. Long hair in a dream also means naughtiness and adversities. Thick and long hair in a dream can also be interpreted as having many children, or it could represent fear of wrongdoing, or thinking about an important person, or it could represent common daily concerns. Having less hair in a dream means diminishing difficulties. If one sees someone pulling out their hair in a dream, it means that they may have to face a financial disaster. If a woman sees a strand of her hair being cut in a dream, it means a fight between her and her husband, or it could mean that someone is encouraging her husband to seek another woman. If one sees himself grooming his hair with oily dressing in a dream, it means adorning oneself for the world. If the oil runs over one's face in the dream, it means trouble. Discovering a bad odour emanating from one's hair in the dream means hearing praises. Delousing one's hair in a dream means discovering some of one's faults. If some lice fall during the combing of one's hair in a dream, it means that he will spend a portion of his inheritance in charity, or that he will clean his act, or correct his attitude. If one sees his hair growing anew in a dream, it means that he may lose most of his wealth. If one sees hair growing on his face where hair does not usually grow in a dream, it means debts. If one sees hair growing in the palm of his hand in a dream, it means benefits from a business. A hairy chest or hair growing over tongue in a dream, means wisdom, clarity, or diligence, except if it grows beyond control, then it becomes adversities, stress, sorrows, debts, and so forth. If one sees the hair on his forearm scattering or falling in a dream, it means that he may lose all his savings. Braiding the hair of one's legs in a dream means earning money through improper methods, or engaging in something which contradicts the divine laws. A woman's hair in a dream represents her protection, husband, or family. Hair in a dream also denotes farming, money, a wife, a husband, or marriage. If one's hair looks ugly and smelly in a dream, it represents the living condition or the state of the husband and wife. Nicely combing one's hair in a dream means loyalty and fulfilling a promise. As for a person who lacks loyalty, shaving his hair or cutting it short in a dream means squandering money, though in general, shortening one's hair means knowledge and guidance. Combing the hair of one's wife in a dream means divorce. Good-looking hair in a dream represents a person of good character. Hair in a dream also means feeling apprehensive about something. If one's hair turns into an animal's hair, in a dream, it means toiling and difficulties. If a poor person sees that dream, it means that his basic needs will be adequately satisfied. The eyebrows, eyelashes, hairy arms, hairy legs, and a hairy chest in a dream also represent a man's virility, beauty, protection, or lasting wealth. Hair in one's ears in a dream means knowledge or admonition. Seeing hair in one's nose in a dream represents a beneficial thing one breezes, though it may involve some hidden trouble, or it could mean money. Hair covering a woman's body in a dream means remaining celibate, and for a married woman, it means taking care of her parents and children. A hairy child in a dream means longevity. Ifa beardless man sees himself hairy in a dream, it means that his wife will soon be pregnant. If one's hair turns white in a dream, it means loss of money for a rich person, or paying the debts of a poor person. (See Black hair, Dye, Shaving, Strand of hair)"}, {"id": "haircut", "label": "Haircut", "category": "Action", "meaning": "A short haircut in a dream signifies failure to fulfill one's duties properly. (Also see Hair, Shaving)"}, {"id": "hairdresser", "label": "Hairdresser", "category": "Types of People", "meaning": "(Barber) In a dream, a hairdresser represents a person who justly manages people's assets or directs them through the right channels."}, {"id": "hajj", "label": "Hajj", "category": "Action", "meaning": "(arb. See Feast of Immolation, Pilgrimage, Responding, 'Umrah)"}, {"id": "half-a-bushel", "label": "Half a bushel", "category": "Objects", "meaning": "(arb. Mudd, a Unit of dry measure equal to 2 pecks, or 16 quarts.) A container measuring half a bushel in a dream means sanctity, chastity, cleanliness, and purity. This interpretation comes from understanding the practice of God's Prophet of regularly taking his ritual ablution from such a measuring container. (Also see Unit of measure)"}, {"id": "hall", "label": "Hall", "category": "Objects", "meaning": "(Auditorium, Large hall) A large hall in a dream means comfort, overcoming financial difficulties, a helping wife, a good mistress of the house, a high-ranking official that involves little danger, a highway sign, a praiseworthy son, a hard-working employee, or a good investment. If the hall is dark, dirty, and filled with insects and spider webs in the dream, then it means the opposite."}, {"id": "hallway", "label": "Hallway", "category": "Objects", "meaning": "(Corridor, Doorman) In a dream, a hallway represents a servant who controls and manages the business and life of his employer. It also represents a doorman, or one's actions that guide him to his purpose, or one's deeds that could lead him either to paradise or to hellfire. A hallway in a dream also represents one's grave, since the grave is a hallway to either heaven or hell, or it may represent the steps of a sick person or a handicapped person. Its lights, size, and the ease of crossing it in the dream reflect the outcome."}, {"id": "hammer", "label": "Hammer", "category": "Tools", "meaning": "(Claw hammer, Mallet, Sledge, Stone hammer) A hammer in a dream represents the one who has the upper hand, advantage, or influence. Holding a hammer in a dream means receiving honour and great benefits. A hammer in a dream also represents one's helper, and it could mean money for one who uses it to earn a living. A hammer in a dream also connotes evildoing, or expressing oneself loudly with clamour."}, {"id": "hand-barrow", "label": "Hand barrow", "category": "Tools", "meaning": "(See Palanquin)"}, {"id": "hand-bell", "label": "Hand bell", "category": "Objects", "meaning": "A handbell in a dream represents a jobber, a broker, a wife and her children, or the muezzin of a mosque. A handbell in a dream also means a scandal. Ringing a hand-held bell in a dream means propagating falsehood. Holding a handbell in a dream also means associating with a useless person, or it could represent a liar. Ringing a handbell in a marketplace in a dream means making a false oath."}, {"id": "hand-grinder", "label": "Hand grinder", "category": "Tools", "meaning": "(See Hand mill)"}, {"id": "hand-mill", "label": "Hand mill", "category": "Tools", "meaning": "(Labouring, Livelihood, Millstone, Travel) A hand mill in a dream means overcoming distress, pain, or satisfying one's needs. It could also mean richness after poverty, marriage, a servant, or moving into a new house. If someone sees a hand mill in a house that is not accustomed to grinding its grain or spices in a dream, it means adversities, defeat, or arguments. If one then grinds bread, or meat, or honey with it in the dream, it denotes a despicable character of the people of that house, their falsehood, affectation, lesbian or perverted nature. If one sees a hand mill grinding stones in a dream, it means that he will be seized by terror. If one grinds barley or grains for food in a dream, it means solving the family's problems, prosperity, recovering from illness, or refurbishing one's business. If one sees a huge hand mill in the centre of a town in a dream, it means war and destruction and especially if he sees it grinding rocks or emitting fire or sparks. Otherwise, it means a plague if the hand mill is grinding spoiled and mouldy grains, mud, or spoiled meat. If one sees the millstone tilted in a dream, it means rising prices. If the hand mill is turning with nothing to grind in the dream, it means toiling aimlessly. If the hand mill turns using a wheel in the dream, it means prosperity. If one sees the hand mill turning and not grinding in a dream, it means travel. If it turns for no useful purpose in a dream, it denotes the nearing of one's death. A pair of small hand grinders in a dream represents two loathsome partners that no one can correct or guide. If one sees himself operating a millstone by hand in a dream, it means that he earns his livelihood following the required religious conduct and earns his money from his sweat. A millstone in a dream may also denote loathsome actions. If a prisoner sees a broken millstone in a dream, it means that he will be soon released, and if he is under a death sentence, it means that the judgment will be rescinded, or that he may die before the judgment is carried out. As far as the question of livelihood, the better looking and effective the hand mill, the better one's earnings and vice versa. If one buys a hand mill in a dream, it means that he will get married, or that he will marry off his daughter, or that he will travel on business. If the millstone is interpreted to mean a husband or a wife, then it represents respectful people. A hand mill in a dream also means comfort, relief, evil, fight, dispute, wife, servant, livelihood, travels, gourmandize, or a woman who gives herself publicly in everything. (Also see Water mill, Windmill)"}, {"id": "handball", "label": "Handball", "category": "Action", "meaning": "(See Ball)"}, {"id": "handcuff", "label": "Handcuff", "category": "Objects", "meaning": "(Fettered, Marriage, Shackled, Tied-up) If one sees his hand tied to his neck in a dream, it means that he does not pay God's rights upon what he earns. If one's hand is tied around his neck in a dream, it also could mean that he will desist from wrongdoing. If both hands are tied up in the dream, it denotes his stinginess. If one is captured and handcuffed by the authorities in a dream, it means that he will be thrown into jail or fall into difficulties. Seeing oneself handcuffed in a dream also means marriage, wrongdoing, or hypocrisy. (Also see Bond, Rancour)"}, {"id": "handkerchief", "label": "Handkerchief", "category": "Objects", "meaning": "(Head kerchief, Kerchief) In a dream, a handkerchief represents money, benefits, honour, a wife, a son, or authority. Seeing an embroidered head kerchief in a dream means learning pleasant poetry, or it could mean favours, sponsorship, or protection. A head kerchief in a dream also represents a prayer bead, leadership, or a servant. Tying a knot on a handkerchief in a dream means that one may marry a prostitute, or it could mean helping her out of sin. A handkerchief in a dream also denotes either stinginess or generosity. Carrying a handkerchief in a dream also means getting married to a beautiful woman."}, {"id": "hands-clapping", "label": "Hands clapping", "category": "Action", "meaning": "(See Clapping hands)"}, {"id": "handsaw", "label": "Handsaw", "category": "Tools", "meaning": "(See Saw)"}, {"id": "handshake", "label": "Handshake", "category": "Action", "meaning": "Shaking hands with someone in a dream means signing an agreement, receiving benefits, a pledge of allegiance, honouring one's promise, making a commitment, good intention, signing a contract, or cherishing a friendship. Shaking hands with someone, then embracing him in a dream, means glad tidings, good news, good words to which one's reply will be the same, or it could represent the knowledge he teaches to others. (Also see Greetings)"}, {"id": "handsomeness", "label": "Handsomeness", "category": "Feelings", "meaning": "(See Elegance)"}, {"id": "handwriting", "label": "Handwriting", "category": "Objects", "meaning": "(See Calligrapher)"}, {"id": "hanging", "label": "Hanging", "category": "Action", "meaning": "(See Death by hanging)"}, {"id": "hanging-clothes", "label": "Hanging clothes", "category": "Action", "meaning": "(Spread, Unfold) To hang a garment in the sun to dry in a dream may indicate that someone will shortly arrive from a long journey."}, {"id": "hanging-loosely", "label": "Hanging loosely", "category": "Action", "meaning": "If one sees himself hanging down loosely from a high place in a dream, it means that he will turn pious and, for the sake of his faith, he will give preference to his life in the hereafter over that of this world. One's fall in the dream connotes despair or disappointment. Hanging loosely to reach a lion, a serpent, a scorpion, or the like creatures in a dream means hanging around with evil companions, soliciting marriage from a corrupt family, or seeking the friendship of the wrong people. Hanging loosely to reach some cattle or a herd of sheep in a dream means delivering charities or spending money in a good way."}, {"id": "hank-of-yarn", "label": "Hank of yarn", "category": "Objects", "meaning": "(See Ball of thread)"}, {"id": "happiness", "label": "Happiness", "category": "Feelings", "meaning": "(Elation, Excitement, Joy) In general, happiness in a dream means sorrow. To be happy about something which the heart does not feel comfortable with, or which the heart does not qualify as correct conduct or behaviour in a dream, means sadness and sorrow in wakefulness. Happiness in a dream also means being indifferent about following God's commands. If one's happiness in his dream is derived from the release of a prisoner or the recovery of a sick person, then it means positive changes in one's life. If one is told something that is supposed to make him happy, when in fact it made him sad in the dream, such as being told in a dream that so and so has just arrived from a long journey, when in fact such person has just died, it means that his sadness will be dispelled and his sorrows removed. Feeling happy in a dream means sadness, sorrow, or crying. If one sees his friends happy in a dream, then it means happiness for him too."}, {"id": "harbinger", "label": "Harbinger", "category": "Other", "meaning": "(See Herald)"}, {"id": "hard-hat", "label": "Hard hat", "category": "Objects", "meaning": "(See Helmet)"}, {"id": "hard-work", "label": "Hard work", "category": "Action", "meaning": "(See Labor)"}, {"id": "hardness", "label": "Hardness", "category": "Feelings", "meaning": "(See Harshness)"}, {"id": "harm", "label": "Harm", "category": "Feelings", "meaning": "(Damage, Loss) Suffering harm in a dream means dismay, horror, a scare, a shock, or a menace. Complaining about a harm one is suffering or a loss in a dream means attaining one's goal in wakefulness."}, {"id": "harness", "label": "Harness", "category": "Objects", "meaning": "(See Bridle, Yoke)"}, {"id": "harrow", "label": "Harrow", "category": "Tools", "meaning": "(See Shovel)"}, {"id": "harshness", "label": "Harshness", "category": "Feelings", "meaning": "(Austerity, Grimness, Hardness, Rigor, Severity) To be unpleasant, sharp, lacking restraint, and wittingly incisive in a dream, or to display a harsh character, or to have one's heart blocked to receiving admonition, or to be defiant when God's words are spoken in a dream, means pride, arrogance, and indulgence in sinful actions."}, {"id": "harvest", "label": "Harvest", "category": "Action", "meaning": "Harvesting one's farm in a dream means ease after difficulty, or seeing a fast return on one's investment. It also could represent destruction, or it could mean receiving admonition. The portion harvested in a dream will equal the size of destruction that will befall the area. If one sees people harvesting a field in the middle of the marketplace or a road in a dream, it means that a calamity will befall them because of their sins. On the other hand, it also means profiting from one's business. If worshippers are seen harvesting inside a mosque with no outside help in a dream, it means reaping the reward of their devotion and sincerity. Throwing the harvest back into the fields means that one's deeds are worthless. To see oneself harvesting outside the season in a dream means devastation, war, or death. Harvesting a green crop in a dream connotes the death of a young person. If the colour of the harvest is white in the dream, it means the death of an elderly person. If one sees the crop being harvested before its time, or much later than its due time in the dream, it means death or a war. (Also see Crop, Earth, Grammarian, Planting)"}, {"id": "hash", "label": "Hash", "category": "Food", "meaning": "(See Mincemeat)"}, {"id": "hashish", "label": "Hashish", "category": "Other", "meaning": "(See Intoxicants)"}, {"id": "haste", "label": "Haste", "category": "Action", "meaning": "(See Hurry)"}, {"id": "hastiness", "label": "Hastiness", "category": "Feelings", "meaning": "(Regret) In a dream, hastiness represents regret, and regret represents hastiness. If a sick person sees himself running hastily in a dream, it means the nearing of his death. The only positive connotation of hastiness in a dream is to hasten to do good when the results in one's dream are good. Otherwise, it means evil. (Also see Hurry)"}, {"id": "hat", "label": "Hat", "category": "Objects", "meaning": "(See Helmet)"}, {"id": "hatchery", "label": "Hatchery", "category": "Objects", "meaning": "(See Incubator)"}, {"id": "hatchet", "label": "Hatchet", "category": "Tools", "meaning": "(See Ax)"}, {"id": "hate", "label": "Hate", "category": "Feelings", "meaning": "Hate and abhorrence are the causes of divisiveness and enmity between people, and people need one another to reach their common goal. If one sees himself suffering from despise, or if he hates someone in a dream, it means a bad omen for everyone involved. To hate someone who loves you in a dream means having perfidy, jealousy, and rancour. Hatred in a dream may also connote wanting to do what is right and abstaining from what is wrong. (Also see Grudge)"}, {"id": "hatred", "label": "Hatred", "category": "Feelings", "meaning": "(See Grudge)"}, {"id": "haughtiness", "label": "Haughtiness", "category": "Feelings", "meaning": "(Disdain, Superciliousness) If one desires to earn respect from others, then haughtiness in a dream means grovelling, servility, toadying, or losing rank."}, {"id": "haunted-by-evil-spirits", "label": "Haunted by evil spirits", "category": "Jinn", "meaning": "(Possessed) If one sees himself haunted or possessed by evil spirits in a dream, it means that he engages in usury, performs secret arts, or that he may lose his wealth to become unhappy, or to suffer from stress or depression."}, {"id": "hawk", "label": "Hawk", "category": "Animals", "meaning": "(Also see Hunter, Kite, Sparrow)"}, {"id": "hawser", "label": "Hawser", "category": "Objects", "meaning": "(Cable, Rope) A hawser in a dream represents a robbery, profits, longevity, or marriage."}, {"id": "hazelnut", "label": "Hazelnut", "category": "Food", "meaning": "In a dream, hazelnut represents a stranger who is rich, generous, but dull, unpleasant, though he can bring people together. It is also interpreted as hard-earned money. In general, nuts in a dream represent sorrow or even melancholy. A hazelnut in a dream also means news that one's homeland is ravaged by war and its children are taken prisoners. In a dream, a hazelnut also represents the marriage of the firstborn girl to an unknown person. (Also see Hazelnut tree)"}, {"id": "hazelnut-tree", "label": "Hazelnut tree", "category": "Trees", "meaning": "A hazelnut tree in a dream represents a mature and strong person, while its fruit represents their money. However, throwing a hazelnut at someone in a dream means stoning him to death. (See Hazelnut, Stoning)"}, {"id": "head", "label": "Head", "category": "Human Body", "meaning": "(Balance, Beauty, Capital, Craft, Death, Father, Knowledge, Life, Measuring cup, Oven, Parents, Teacher, Tent) In a dream, the head represents leadership, presidency, or one's capital. If one's head looks bigger than usual in the dream, then it represents his father, or it could mean rising in rank and receiving honour. If one's head looks smaller in the dream, it means loss of respect, rank, and honour. If an intelligent person sees his head smaller in a dream, it means that he will turn to ignorance, or perhaps lose his job. Seeing oneself in a dream having two or three heads means victory over one's enemy, wealth for a poor person, blessed children for a rich person, marriage for an unwed person, or attainment of one's goal. Seeing oneself in a dream without a head cover means disobedience to one's superior. If one sees his head down, or hanging loose in a dream, it means confessing to one's wrongdoing, or experiencing a long life of humiliation and striving to please someone. If one's head is fixed backward in a dream, it means delays in attaining his goals, hindrance of one's travel plans, or it could represent someone's return from a business trip slowly and without greed. If one sees his head severed without beheading in a dream, it means that he will shortly die, or it could mean his freedom. Seeing one's head turning into a lion's head in a dream means that he will rule and prosper. If it turns into a sheep's head in the dream, it means that he will be just and equitable. If it turns into a donkey's head in a dream, it means that he will revert to ignorance. If it turns into a dog's head, a donkey's head, or a horse's head, or any of the domesticated animals in a dream, it means toiling and hardships. If it turns into a bird's head in a dream, it means that he travels a lot. If it turns into an elephant's head, or a wolf's head, or a tiger's head in a dream, it means that he is looking to do things beyond his means, though he will still benefit from his ambition. If one's head is hit with a stone in a dream, it means that he neglects to perform his night prayers before sleeping. If one contracts any pain in his head or neck in a dream, it means an illness. If one sees. His head, anointed with fragrances or oils in a dream, represents his good endeavours and piety. Eating someone's head raw in a dream means backbiting him. Eating it cooked in a dream means stealing money from him if he recognizes him. Otherwise, it means stealing from one's property or share. Holding one's head between one's hands in a dream means reorganization of one's debts. Seeing someone's head on a tray drenched with blood in a dream represents the head of a leader who lies, or who <, lied to. Blood in a dream means lies or falsehood. A turban in a dream represents a crown or a flying ship. One's head in a dream also represents knowledge, wisdom, respect, children, followers, or money. Losing one's head in a dream means carelessness, heedlessness, or inability to properly manage one's interests. Cutting off one's head in a dream means committing suicide, severing one's connection with one's family, or betraying one's father or teacher. Looking at one's head in a dream means examining one's investment or capital worth. Seeing cattle heads gathered somewhere in a dream means profits. If one sees a king beheading him in a dream, it means that God Almighty will cleanse him from his sins and dispel his agonies and distress. If a money changer loses his head in a dream, it means that he may go bankrupt. (Also see Body)"}, {"id": "head-cover", "label": "Head cover", "category": "Objects", "meaning": "(Headdress, Scarf) If a religious Muslim woman sees herself without a head cover in a dream, it means that her husband has left her with the intention not to return to her again. If she is not married, it means that she may never marry."}, {"id": "head-kerchief", "label": "Head kerchief", "category": "Objects", "meaning": "(See Handkerchief)"}, {"id": "head-lice", "label": "Head lice", "category": "Human Body", "meaning": "(See Hair, Nit)"}, {"id": "headache", "label": "Headache", "category": "Human Body", "meaning": "A headache in a dream represents one's sins. Suffering from a migraine headache in a dream means that one should repent of his sins, curtail his plans, distribute money in charity, observe a voluntary religious fast, seek a spiritual retreat, or have a change of heart toward doing good deeds. A headache in a dream also means suffering from unhappiness and misery in one's life. A headache in a dream could also represent one's employer or supervisor."}, {"id": "headdress", "label": "Headdress", "category": "Objects", "meaning": "(See Head cover, Head)"}, {"id": "headgear", "label": "Headgear", "category": "Objects", "meaning": "(Tiara, Turban) A headgear in a dream means a presidency, travels, or marriage. If one receives a headgear or a tiara in a dream, it means that he may undertake a distant trip. If one wears a headgear in their dream, it means that they may hold a seat in the government. If one is accustomed to wearing a headgear, then wearing it in a dream represents his superior, the governor, his brother, his father, his uncle, his teacher, or a scholar, for they all have equal right upon him. Wearing a dirty and worn-out headgear in a dream means sorrow, difficulties, and distress. If one's headgear is stripped off his head, or if it falls to the ground in a dream, it means the death of his superior, or any of the abovementioned people. If a king offers someone a headgear or a tiara in a dream, it means that he will have the power to appoint people to different administrations. If a mishap befalls one's headgear or the turban of an Imam in a dream, it will reflect upon his faith and the state of his congregation. Wearing a black turban in a dream means authority, or it could mean sitting on the judges' bench. Wearing a headgear that is topped with a white feather in a dream means becoming a leader. Wearing a headgear that is made from animal fur or hide in a dream means becoming unjust and blinded to one's injustice, or it could portray the wicked personality of one's superior at work. A headgear, a turban, or a tiara in a dream could also represent an ascetic. (Also see Overseas cap, Turban)"}, {"id": "healing", "label": "Healing", "category": "Action", "meaning": "(See Medicine)"}, {"id": "health", "label": "Health", "category": "Feelings", "meaning": "To take care of one's health in a dream means trying to amend one's life for the better. The same meaning is applied if one sees himself applying an ointment to his eyes. (Also see Medicine, Physical fitness)"}, {"id": "hearing", "label": "Hearing", "category": "Human Body", "meaning": "(See Speaking)"}, {"id": "hearing-a-voice", "label": "Hearing a voice", "category": "Action", "meaning": "(See Invisible caller)"}, {"id": "hearing-board", "label": "Hearing board", "category": "Objects", "meaning": "(Cabinet, Council, Court, Inquisitional court) If one's name is presented before a hearing board for review, and if he is nominated to fill a seat in any governmental department in a dream, it means that he may satisfy the requirements of such a position. If he loses the nomination in the dream, it means his death, or that he may never return to that building again. (Also see Exhibition, Inquisitional court)"}, {"id": "heart", "label": "Heart", "category": "Human Body", "meaning": "(Also see Body, Pain)"}, {"id": "heart", "label": "Heart", "category": "Human Body", "meaning": "(Daughter, Pulsate, Servant) In a dream, the human heart represents his awareness, diligence, intelligence, mastery, the king of the human body, and its governor. Seeing a heart in a dream also represents good conduct, good spiritual awareness, religious assiduity, and clarity of speech. If one's heart is stolen from him in a dream, it means fear, yearnings, bad religious practices, an accident, or a calamity. Seeing one's heart blackened, or covered with an opaque seal in a dream, it means heedlessness, sinfulness, and blindness of the heart. (Also see Body, Chest)"}, {"id": "heart-palpitation", "label": "Heart palpitation", "category": "Human Body", "meaning": "(See Palpitation)"}, {"id": "heartburn", "label": "Heartburn", "category": "Human Body", "meaning": "(Sorrel) In a dream, heartburn means recovering from an illness, or it could mean hypocrisy and affectation."}, {"id": "hearth", "label": "Hearth", "category": "Fire", "meaning": "(See Fireplace)"}, {"id": "heat", "label": "Heat", "category": "Weather", "meaning": "(Weather) Experiencing hot weather in the winter in a dream means benefits, profits, or new and expensive clothing, but experiencing it during the summer season in a dream means the opposite."}, {"id": "heater", "label": "Heater", "category": "Objects", "meaning": "(See Furnace, Oven)"}, {"id": "heavenly-beings", "label": "Heavenly beings", "category": "Angels", "meaning": "(See Angels)"}, {"id": "heavens", "label": "Heavens", "category": "Celestial Bodies", "meaning": "(The eight heavens, Firmament, Planets, Skies) If one sees himself dwelling in the lower heaven, and if he qualifies, it means that he will be appointed to a ministerial office or work for a minister in the government. This is because the lower heaven is the sphere of the Moon, and the Moon is interpreted as a chief minister or as a secretary. The second heaven is the sphere of the planet Mercury. If one sees himself in the second heaven in a dream, it means that he will acquire knowledge, diligence, and a writing style. In turn, people will seek him to learn from him. The third heaven is the sphere of the planet Venus. If one sees himself in the third heaven in a dream, it means that he will prosper, or employ a female servant, or it could mean possessing jewelry and living in happiness and comforts. The fourth heaven is the sphere of the Sun. If one sees himself in the fourth heaven in a dream, it means that he will reach leadership, gain authority, and win respect, or that he will serve such people. The fifth heaven is the sphere of the planet Mars. If one sees himself in the fifth heaven in a dream, it means that he will preside or lead a police squadron, a mountain patrol, a small army, a band of thieves, or manage a brothel. The sixth heaven is the sphere of the planet Jupiter. If one sees himself in the sixth heaven in a dream, it means that he will acquire deep spiritual understanding, religious assiduousness, or become a judge, if he qualifies. He could also become an ascetic, or a true worshiper, and he will have strong faith, good managerial ability, or he could become a treasurer. The seventh heaven is the sphere of the planet Saturn. If one sees himself in the seventh heaven in a dream, it means that he may buy a house, a property, a farmland, or it could mean longevity. If one does not qualify to receive any of the above, then such an award will reach his superiors, or someone in his progeny, or a close friend. If one sees himself standing beyond the seventh heaven in a dream, it means exaltation, though his exaltation will be the direct cause of his death. (Also see Mars, Jupiter, Skies)"}, {"id": "heavy-weight", "label": "Heavy weight", "category": "Objects", "meaning": "(See Fat person)"}, {"id": "hebrew", "label": "Hebrew", "category": "Types of People", "meaning": "(See Language)"}, {"id": "hedgehog", "label": "Hedgehog", "category": "Animals", "meaning": "(See Porcupine)"}, {"id": "hedges", "label": "Hedges", "category": "Objects", "meaning": "(Enclosure, Fence, Surrounding) If the green hedges of a fruit garden climb toward the outside of the fence and the trees remain inside the garden in a dream, it means improper attitude toward one's religion, or loss of worldly status, business losses, failure to repent, or giving preference to the company of ignorant and boastful people over the company of righteous people, or it could mean lack of adequate religious devotion, rejecting one's religion, or raising the esteem of commoners above the elect. If one sees that the green hedges are replaced with a wall, a fence, or a ditch in the dream, it represents the rising star of the owner of such a garden. Hedges in a dream also represent one's religion, and the trees represent one's religious duties. Hedges in a dream also represent one's family, relatives, or his trade. If hedges are interpreted to mean the world, then they could also represent one's family, relatives, progeny, one's religious life, and the deeds that could save one from suffering in hellfire."}, {"id": "heedful-angels", "label": "Heedful angels", "category": "Angels", "meaning": "(See Record keepers)"}, {"id": "heeding", "label": "Heeding", "category": "Action", "meaning": "To impel one's animal to drive faster in a dream means heeding admonition."}, {"id": "heedlessness", "label": "Heedlessness", "category": "Feelings", "meaning": "(See Disbelief, Ingratitude, Irreligious)"}, {"id": "heel", "label": "Heel", "category": "Human Body", "meaning": "In a dream, heels represent one's children or heirs. If one discovers that he has no heirs in a dream, it means that he has no heirs in his family. If one's heel is broken or cut off in a dream, it could mean the death of his child. A broken heel in a dream also means an adventure that one will regret. A broken heel in a dream also could mean depression, calamity, sorrow, a trial, or one's death. The right heel in a dream represents the son, and the left heel represents the daughter. One's heels in a dream also imply the conclusion of his life in this world and his judgment in the hereafter. One's heels in a dream also represent his estate. Strong heels in a dream represent good deeds. Dark heels in a dream represent heedlessness and disobedience to the divine commands of God Almighty. Heels in a dream also signify punishment for one's sins. One's heels in a dream may also represent a son who is a gambler. A low heel and tendon in a dream represent a daring, courageous, and forward person. As for a bachelor, seeing his heels in a dream means marriage. Heels in a dream also mean vain talk. Playing with one's heels in a dream means enjoying one's success over his opponent. A broken heel in a dream means an illness. One's heels also represent his property and money. Having no heels in a dream means losing one's wealth. A nice-looking heel in a dream means glad tidings and blessings. (Also see Body)"}, {"id": "height", "label": "Height", "category": "Other", "meaning": "(See Tallness)"}, {"id": "hell", "label": "Hell", "category": "Hell", "meaning": "(arb., Jahannam. See Hell-fire, Malik, Mental hospital)"}, {"id": "hell-fire", "label": "Hell-fire", "category": "Hell", "meaning": "Entering hellfire in a dream means committing major sins such as murder or adultery. If one comes out of it unharmed in the dream, then it represents worldly adversities. If one sees the fire of hell coming near him in a dream, it means difficulties, debts, losses, fines, and adversities from which one will not be able to escape. If one sees himself entering hell-fire and holding his sword unsheathed in a dream, it means that he speaks evil of others and commits abominable actions against his soul. The same interpretation applies if one enters smiling in his dream. Finding oneself a prisoner in hell, not knowing when he was incarcerated in the dream, means constraint, poverty, deprivation, failure to pray, fast, or remember his Lord. Walking across burning coal in a dream means exceeding one's bounds regarding rights. Eating food from hell means becoming a tyrant and a blood thirsty person. If one sees himself inside hell-fire, where his eyes turn dark-blue and his face charcoal black in the dream, it means that he befriends God's enemy and consents to their deception and chicanery. Consequently, he will surely be humiliated and despised by people, and in the hereafter, he will suffer the consequences of his sins. Seeing hell in a dream means that one should avoid incurring the wrath of a ruler. Entering hell in a dream also means notoriety, or becoming known as an evil person. It also means heedlessness and pursuing one's indulgence in abominable actions. Whatever knowledge such a person acquires will bear evil consequences. Hell in a dream also represents loss of one's prestige, status, and it means poverty after wealth, despair after comfort, unlawful earnings, insolence, and if it leads to an illness, it will end in a shocking death as a punishment. If it leads to employment, it will be a job serving a tyrant. If it leads to acquiring knowledge, which means inventing vain religious practices. If it leads to bearing a son, he will be the child of adultery. In general hell in a dream means excessive sexual desires, a slaughter house, a public bath, an oven, inventing a new religion, innovation, absence of truth, indulgence in what is forbidden, stinginess, denying the Day of Judgment, a blazing fire for the devils, joining with a group of evildoers in committing atrocities, denying the sovereignty of God Almighty and ascribing human characteristics to Him. Seeing Malik, the guardian angel of hellfire, in a dream means receiving guidance after heedlessness. If one sees Malik coming toward him in the dream, it means his salvation and the restoration of his faith. However, if one sees Malik turning his back to him or going away from him in the dream, it means that he will commit an act that will deliver him to the blazing fire of hell. The angels in charge of punishing the sinners in hell in a dream represent the authority, soldiers, or tax collectors. If one enters hellfire and then comes out of it in his dream, it means that, God willing, his life will culminate in paradise. If he sees his limbs reprimanding him in the dream, it means that one's own body is telling him something, or admonishing and trying to awaken his consciousness to the realities of the hereafter and the Day of Reckoning. (Also see Bathhouse, Fire, Malik, Mental hospital)"}, {"id": "helm", "label": "Helm", "category": "Objects", "meaning": "(Tiller, Wheel) In a dream, the helm or the tiller of a boat represents true knowledge, the seat of authority, solid credentials, and a reliable reference. (Also see Boat, Ship)"}, {"id": "helmet", "label": "Helmet", "category": "Objects", "meaning": "(Crash helmet, Face mask, Hard hat, Warrior's helmet) In a dream, a helmet means safety, money, a wife, employment, travel, or one's head. A white helmet in a dream means relaxing, or peace in one's life, or it could mean recovering from a migraine headache. Wearing a warrior's helmet in a dream also means the safety of one's property and protection from an accident. Wearing a rounded, expansive helmet in a dream means betrothing a beautiful and rich woman. A helmet made of iron in a dream represents a leader who defends people, or it could mean trust, status, rank, a wife, or might. Wearing a white helmet in a dream means honour and protection of one's property."}, {"id": "help", "label": "Help", "category": "Action", "meaning": "(Honor) To help or honour poor people in a dream, or to give their needs preference over one's means, rising in station or rank, though working under higher authorities."}, {"id": "helper", "label": "Helper", "category": "Types of People", "meaning": "(See Backbone, Escort)"}, {"id": "hemming", "label": "Hemming", "category": "Action", "meaning": "(See Alterations)"}, {"id": "hemp", "label": "Hemp", "category": "Plants", "meaning": "(See Intoxicants, Marijuana)"}, {"id": "henna", "label": "Henna", "category": "Plants", "meaning": "(Dye) A reddish-orange cosmetic dye produced from the stalks and leaves of the henna plant. Henna for a man represents his working tools. It also means adornment, money, prosperity, or children. If a man sees his hands dyed with henna in a dream, it means that he keeps praising his Lord. If only the right hand is dyed with henna but looks ugly in the dream, it means that he may commit murder. Dying one's hands with henna in a dream also means carelessness about exposing one's good and bad qualities in public, or it could mean that he delivers his merchandise or work in any condition without acknowledging blame, fault, or recognizing his improper behaviour with his customers. If one's hands are tattooed with henna in a dream, it means that he cheats to acquire his earnings. Eventually, he will be exposed, and his opponents will rejoice at his misfortune. If a woman sees her entire body dyed with henna in a dream, it means having a good relationship with her husband. If, after applying the henna to her hands, the dye does not work in a dream, it means that her husband does not show his love for her. If only the fingers are dyed with henna in a dream, they then represent branches of dates, or clusters of grapes. In general, dying one's hands and hair with henna as makeup in a dream represents joy for the husband and wife as long as they do not exceed the common norms. (Also see Dye, Tattoo)"}, {"id": "herald", "label": "Herald", "category": "Types of People", "meaning": "(Harbinger, Messenger) In a dream, a herald represents an escort, a station master, or a broadcaster."}, {"id": "herbal-medicine", "label": "Herbal medicine", "category": "Objects", "meaning": "(See Ivy, Solomon)"}, {"id": "herbs", "label": "Herbs", "category": "Plants", "meaning": "(See Antidote, Caraway, Garden herbs, Onion. Also see other herbs."}, {"id": "herder", "label": "Herder", "category": "Types of People", "meaning": "In a dream, a herder represents a guardian."}, {"id": "hereafter", "label": "Hereafter", "category": "Other", "meaning": "(See Entering Paradise)"}, {"id": "hermaphrodite", "label": "Hermaphrodite", "category": "Types of People", "meaning": "(See Hyena)"}, {"id": "hermitage", "label": "Hermitage", "category": "Objects", "meaning": "(Retreat, Sanctuary) A hermitage in a dream represents a spiritual retreat, abstinence, good character, seclusion, ascetic detachment, controlling one's desires and wants, divorcing one's wife, abandoning one's friends, or it could mean an illness. If a sick person sees himself in a hermitage in a dream, it may mean his death, or it could mean suppressing one's sexual desires. Occupying a hermitage or building one in a dream means rising in station. A beautiful and newly built hermitage in a dream represents a wife. A hermitage in a dream also could mean migration, bewilderment, severing a friendship, hiding, power, or it could represent one's son. Whatever may affect a hermitage in the dream could also manifest in the life of one's son. (Also see Retreat, Temple)"}, {"id": "herpes", "label": "Herpes", "category": "Human Body", "meaning": "(Fungus, Ringworm, Tetter) Suffering from herpes, or ringworm, or tetter in a dream means stinginess, or having resources to repay one's debts and concealing such knowledge from the lenders and being afraid of their asking for their money."}, {"id": "hiccup", "label": "Hiccup", "category": "Human Body", "meaning": "(Spasmodic inhalation) Hiccups in a dream mean anger, interference in people's business, or falling sick. As for a sick person, a hiccup in a dream means death, while for anyone else, it represents money."}, {"id": "hickory", "label": "Hickory", "category": "Trees", "meaning": "(See Tree, Walnut)"}, {"id": "hidden-goods", "label": "Hidden goods", "category": "Objects", "meaning": "(See Herbal medicine, Medicinal plant, Wild plants)"}, {"id": "hidden-road", "label": "Hidden road", "category": "Objects", "meaning": "(See Road)"}, {"id": "hidden-treasure", "label": "Hidden treasure", "category": "Objects", "meaning": "(Boy, Enemy, Power, Snake, Troves, Unjust ruler, Woman) If the treasure one discovers in his dream is hidden by a previous generation, it means receiving an inheritance, lawful earnings, a booty, a son from adultery, or it could represent an orphan because it comes from someone else's earnings."}, {"id": "hide", "label": "Hide", "category": "Action", "meaning": "(See Concealment, Dye, Irreligious)"}, {"id": "high-prices", "label": "High prices", "category": "Other", "meaning": "(Cost of living) Seeing a winged loaf of bread flying in a dream means high prices. (Also see Bread)"}, {"id": "high-tides", "label": "High tides", "category": "Water", "meaning": "(Ocean) In a dream, swimming in troubled waters or high tides means adversities, or having to face a strong opponent."}, {"id": "highway", "label": "Highway", "category": "Objects", "meaning": "(See Wandering)"}, {"id": "hiking", "label": "Hiking", "category": "Action", "meaning": "(See Naturalist)"}, {"id": "hilarity", "label": "Hilarity", "category": "Feelings", "meaning": "(See Laughter, Menstrual period, Mirth)"}, {"id": "hill", "label": "Hill", "category": "Earth", "meaning": "(Elevation) In a dream, a hill represents a powerful and dangerous person. Any construction surrounding such a hill represents one's wealth. If one sees a flat land adjacent to a high ground or hill in a dream, such a hill represents a rich man whose wealth compares to the size of the surrounding property. A valley of green pasture surrounding a hill in the dream represents his strength, justice in the method of dealing with others, or it could mean religious devotion. Following that line of thought, it also means rising in rank at the hand of a powerful person. Crossing hills in a dream means escaping from danger. Standing on top of a hill in a dream means presiding over a religious person. Descending a hill or an elevation in a dream represents losses, migraine headache, or humiliation. Imprisonment on top of a hill in a dream means a high-ranking job. If the elevation is made of trash in a dream, it means worldly and material status. An elevation in a dream also represents one's wife."}, {"id": "hind", "label": "Hind", "category": "Animals", "meaning": "(See Deer, Gazelle)"}, {"id": "hindering", "label": "Hindering", "category": "Action", "meaning": "Hindering someone's work in a dream means ingratitude or disbelief."}, {"id": "hindu", "label": "Hindu", "category": "Types of People", "meaning": "(See Language)"}, {"id": "hirsute", "label": "Hirsute", "category": "Human Body", "meaning": "(See Down)"}, {"id": "hissing", "label": "Hissing", "category": "Action", "meaning": "(See Sound of animals)"}, {"id": "hitching", "label": "Hitching", "category": "Action", "meaning": "(See Lipping)"}, {"id": "hitting", "label": "Hitting", "category": "Action", "meaning": "(See Beating)"}, {"id": "hives", "label": "Hives", "category": "Human Body", "meaning": "(Allergic disorder, Rash, Urticaria) A blood disease that manifests through breaking out of the skin with red spots. If seen in a dream, it means fast wealth, money spent in celebrating a wedding, the outrage of injustice, or expediting a punishment."}, {"id": "hobo", "label": "Hobo", "category": "Types of People", "meaning": "(Bummer, Cadger, Homeless, Tramp, Wastrel) A hobo wandering in the streets, collecting refuse and litters from garbage cans and rubbish in a dream represents someone who accumulates both lawful and unlawful earnings, or someone who divulges or exposes people's secrets, or launders their private lives, or someone who does not mind his own business and asks questions that are of no concern to him. (Also see Beggar, Poverty)"}, {"id": "hodgepodge", "label": "Hodgepodge", "category": "Other", "meaning": "(See Magpie)"}, {"id": "hodman", "label": "Hodman", "category": "Types of People", "meaning": "(See Mortar carrier)"}, {"id": "hog-like-wolf", "label": "Hog-like wolf", "category": "Animals", "meaning": "(See Hyena)"}, {"id": "hold", "label": "Hold", "category": "Action", "meaning": "(See Gripping, Hug)"}, {"id": "hole", "label": "Hole", "category": "Earth", "meaning": "(Deception, Plot, Profits, Fall) Digging a hole, a water well, or an irrigation system and planning to water the plants with it in a dream means attending to one's needs and serving the interests of his family. Eating from the dirt one piles from digging in his dream represents a swagger, or someone who acquires money through deception. Seeing oneself inside a hole in a dream also means divorce. To see oneself outside of such a hole, looking at it in a dream, means having an argument with one's spouse that will end in reconciliation. If a sick person or a prisoner sees himself coming out of a hole in a dream, it means that he will become free from his trials. Falling into a hole and crying for help to no avail in a dream means taking a short trip. A hole in a dream also represents a poor woman who strives to cover others' pitfalls, though she cannot veil her own. Hiding inside a hole in a dream also means appeasement of fears, or the ending of one's adversities. While hiding, one finds food, or fresh water, or a cloth to cover oneself in the dream, it means profiting from sources one does not anticipate, or making peace with an opponent. To put a hole in one's shoe in a dream means facing trouble and adversities. (Also see Den, Mouse hole, Tunnel)"}, {"id": "holy-book", "label": "Holy Book", "category": "Objects", "meaning": "(Qur'an, The Last Revelation) In a dream, the Holy Book, or the Qur'an, represents a king or a judge who deals with Islamic jurisprudence. If a king, a ruler, or a judge sees that the Holy Book no longer exists, or if he sees it burning, or if its contents are washed away in a dream, it means his death. If one sees a ruler or a governor handwriting a copy of the Holy Book in a dream, it means that he is a just person who uses the divine laws in making his decision. If a judge sees himself handwriting a copy of the Holy Book in a dream, it means that he does not share his knowledge, and that he is audacious about his rank and status. If a religious scholar or a theologian sees himself writing a copy of the Holy Book in a dream, it means that he will profit from a business deal. If one sees a king or a ruler swallowing the Holy Book in a dream, it means that he may die soon. If a judge swallows the Holy Book in a dream, it means that he accepts bribes. If a ruler sees himself erasing what is written in the Holy Book in a dream, it means that he will be exiled. If a judge erases what is written in the Holy Book in a dream, it also means his death. If he erases it by licking it with his tongue in a dream, it means that he will commit an awful sin. If a witness erases it in a dream, it means that he will deny his testimony. Carrying the Holy Book, or buying a copy of the Qur'an in a dream, means living by its criterion. Reading from the Holy Book before God's Prophet, upon whom be peace, in a dream means that one will commit himself to memorizing it. Eating the pages of the Holy Book in a dream means accepting bribes. If a layman eats the pages of the Holy Book, or a few lines from some pages in a dream, it means that he earns his livelihood from reciting the Holy Quran or teaching it. Eating the pages of the Holy Book in a dream also means earning one's livelihood from copying and selling it. Seeing the Holy Book in a dream also means growing in wisdom. Handwriting copies of the Holy Book in a dream denotes one's piety, or it could represent a religious scholar who lives by the book, acts by its commands, and shares his knowledge with others. Tearing off the pages of the Holy Book in a dream means ingratitude toward God's revelations, or denying God's favours, or questioning some of them. If one does something to the Holy Book in his dream that he would abhor to do in wakefulness, it means that he has lost his religious devotion and faith. Carrying a copy of the Holy Book in a dream means attaining power and acquiring knowledge. The Holy Book in a dream also represents a husband, a wife, a son, or wealth. If a sick person sees it in his dream, it means that he will recover from his illness. If the one who sees it in his dream is facing an enemy, it means that he will triumph over him. If he is a sinner, it means that he will repent of his sins and turn to his Lord, or it could mean that he may receive an inheritance. If one sees himself following innovations and he recognizes that in his sleep, his dream denotes a warning from God Almighty. Seeing the Holy Book in a dream also could mean seeing wonders, witnessing a miracle, hearing news, receiving happy news, or it could mean longevity for one who browses through it from cover to cover in his dream. The Holy Book in a dream also represents gardens, heavens, places of worship, or a person one is commanded to obey, such as a ruler, or a father, a mother, one's teacher, or a shaikh, or it could mean making a true oath, receiving glad tidings, admonition, or a warning. Seeing the Holy Book or any of the early divine revelations in a dream means that one may preside over people. If one sees himself carrying the Holy Book, or even any book of revelations, and if, when he opens it finds the pages blank with no writing inside it in the dream, it means that he portrays himself to be what he is not, or that he impersonates a scholar, or pretends to be religious. Kissing the Holy Book in a dream means revering what it contains and adhering to what it commands. If one looks into the pages of the Holy Book and finds its lines crooked in a dream, it means that he lives satisfied with what he has and fulfills his required duties accordingly. Stealing a copy of the Holy Book and hiding it in a dream means that one cheats in performing his prayers, or fails to do them properly. If one sees himself looking in the Holy Book, then writing from what he is reading on his garment in the dream, it means that he interprets the Qur'anic revelation according to his liking. If one sees a Holy Book sitting in his lap, then if a chick comes and picks all the words written therein in a dream, it means that one will beget a child who will memorize and read the Holy Qur'an as an inheritance, and benefit from the piety of his father, and as a trust, a lawful earning and a source of strength in his life. Buying a copy of the Holy Book in a dream means benefits, prosperity, and becoming a renowned and distinguished religious scholar. If the Holy Book is snatched away from someone's hands in a dream, it means that he will lose his knowledge, or perhaps lose his employment. If one sees himself spreading the pages of the Holy Book on a flat surface in a dream, it means that he is seeking wisdom, which he will get, or that he may receive an inheritance. If one sees himself putting the Holy Book over his shoulders in a dream, it means that he will receive an appointment, or be entrusted with a duty to guard, or that he will memorize the Holy Qur'an. If one finds himself trying to eat the pages of the Holy Book in a dream, it means that he is a regular reader of the Qur'an. If one sees himself trying to eat the pages of the holy Book but is unable to do so in a dream, it means that he tries to memorize the Holy Qur'an from time to time but keeps forgetting what he learns. (Also see Qur'an)"}, {"id": "holy-kaaba", "label": "Holy Kaaba", "category": "Objects", "meaning": "(See Kaaba, Mecca)"}, {"id": "holy-mecca", "label": "Holy Mecca", "category": "Objects", "meaning": "(See Kaaba, Mecca)"}, {"id": "homage", "label": "Homage", "category": "Action", "meaning": "(See Pledge of allegiance)"}, {"id": "home-coming", "label": "Home coming", "category": "Action", "meaning": "(See Arrival)"}, {"id": "homeland", "label": "Homeland", "category": "Earth", "meaning": "To feel a yearning or desire to see one's homeland in a dream means divorce between a husband and a wife, or separation between friends, or experiencing richness after poverty. Such a yearning in a dream also connotes evil if accompanied by crying or lamenting."}, {"id": "homeless", "label": "Homeless", "category": "Types of People", "meaning": "(See Hobo, Poverty, Stableman)"}, {"id": "homosexuality", "label": "Homosexuality", "category": "Other", "meaning": "(See Pederasty, Sexual intercourse, Sodomy)"}, {"id": "hone", "label": "Hone", "category": "Action", "meaning": "(Grindstone, Razor strop) In a dream, a hone, or a razor strop represents guidance, forthrightness, and knowledge. A phone in a dream also means incitement or promoting an activity, or encouragement to continue one's course of action. A hone in a dream is also interpreted to represent a woman, or someone who causes division between a husband and a wife, or between friends and beloveds. A hone in a dream also signifies tribadism, or lesbianism, when in use in one's dream. In a dream, a bone also signifies movement, activities, sharpness, and good nature."}, {"id": "honesty", "label": "Honesty", "category": "Feelings", "meaning": "(See Justice)"}, {"id": "honey", "label": "Honey", "category": "Food", "meaning": "(Love) In a dream, honey represents lawful money, love, prosperity, or wealth that is accumulated from a business partnership or from a successful business. As for a pious person, honey in a dream represents the delight of his religious life and good deeds, while for profane and worldly people, it means little earnings which are acquired through toiling and hardships. If one sees skies raining honey in a dream, it means confirmation of the social order, fostering proper moral standards, ease, religious assiduity, blessings, and plenitude. Honey in a dream also could represent a husband and a wife, or their private moment, taking a rest, or engaging in a marital relationship. However, honey in a dream also means distress, trouble, bad temper, jealousy, or worrying about people's perfidy, for honey also attracts flies and wasps. Purified honey in a dream means relief after suffering from a depression, or recovering from a nervous breakdown, or giving birth to a child after completing a full pregnancy, or it could mean marrying a woman after she had observed her Iddah of either the passing of her husband or divorce (See Iddah), or it could represent clean money, or earnings which are purified through paying the due alms and charities, or it could mean knowledge that is free from innovation, doubt or suspicion, or a final guidance after which there is no heedlessness. Purified honey in a dream also means hard-earned money, a medication, or the embrace and kisses of lovers. Licking honey in a dream means getting married. Eating bread and butter with honey in a dream means living a rich life. (Also see Lick, Love)"}, {"id": "honeycomb", "label": "Honeycomb", "category": "Objects", "meaning": "In a dream, a honeycomb represents an inheritance of lawfully earned money, or money from a business partnership, or profits in general, as long as the fire does not touch it. If a honeycomb is placed before someone in a dream, it means that he has knowledge which he wants people to hear about or to learn. If the honeycomb is placed as food on a table in the dream, it means booty, or blessed earnings. If it is placed in a bowl in a dream, it means lawful profits. If one sees himself feeding it to the people in the dream, it means that he will chant the Qur'an with embellishment and await people's praises and requests to encore his recital. Eating from a honeycomb with honey still in it in a dream means having sexual intercourse with one's mother. Eating a honeycomb in a dream also could mean martyrdom, or mixing between diversified interests. Purified honey in a dream means good deeds, lawful earnings, displeasing one's parents, recovering from an illness, or testifying in a court of justice. (Also see Honey)"}, {"id": "honor", "label": "Honor", "category": "Feelings", "meaning": "(Laurel) To honour someone in a dream means rising in rank. (Also see Help, Laurel)"}, {"id": "hooded-crow", "label": "Hooded crow", "category": "Animals", "meaning": "(See Crow)"}, {"id": "hoof-first-meaning", "label": "Hoof-first-meaning", "category": "Human Body", "meaning": "(Slippers) In a dream, an animal's hoof, or an ostrich's hoof, means strength or travel. It also means to wend one's way and prepare for the better. (Also see Slippers)"}, {"id": "hoof-second-meaning", "label": "Hoof-second-meaning", "category": "Animals", "meaning": "(Cattle, Horse) In a dream, a hoof represents knowledge and pursuing its references or tracks. It also represents wealth when the hoofs are those of the king's horse or his messenger's horse. Hoofs in a dream also imply making a compulsory move from one location to another. Hoofs in a dream also mean guidance for a lost soul. Hearing the sound of hoofs running through the streets in his dream means rain or floods."}, {"id": "hoofer", "label": "Hoofer", "category": "Types of People", "meaning": "(See Dancer)"}, {"id": "hoopoe", "label": "Hoopoe", "category": "Animals", "meaning": "(zool.) In a dream, a hoopoe represents a truthful messenger, an intimate person, a spy, an arguing scholar, escape from adversities and sufferings, or levelling a building. A hoopoe in a dream also represents one who knows God Almighty and understands the value of the Divine Laws. If a thirsty person sees a hoopoe in his dream, it means that he will find water. A hoopoe in a dream also represents a great scholar who is constantly barraged with accusations and blame because of the bird's offensive smell. Seeing a hoopoe in a dream also means profits, honour, and wealth. Eating a hoopoe in a dream means receiving news from the governor or hosting a traveller. A hoopoe in a dream also represents the king's advisor, the court's seer, an astrologer, a writer, a scribe, or a critic. Holding a hoopoe in one's hand in a dream means glad tidings, or profits from a business in another market or town. Owning a hoopoe in a dream means influencing someone in authority, or it could represent a writer, or a perspicacious person, but who has no religious commitment. Slaughtering a hoopoe in a dream means getting hold of such a person. Owning a female hoopoe in a dream means getting married. Slaughtering a female hoopoe in a dream means deflowering a young girl."}, {"id": "hop", "label": "Hop", "category": "Action", "meaning": "(See Jumping)"}, {"id": "horizontal-wound", "label": "Horizontal wound", "category": "Human Body", "meaning": "In a dream, a horizontal wound means enmity, backbiting, and slander."}, {"id": "horn", "label": "Horn", "category": "Animals", "meaning": "(Distinguished) In a dream, a horn means strength and invincibility. Having a horn in a dream means conquering one's enemy. If one sees a ruler having two horns in a dream, it means that such a ruler will control interests throughout the East and the West. A horn in a dream also represents a relative from whom one can draw benefits. If one grows two animal horns in a dream, it means that he will die from grief and coercion. A horn in a dream also represents children, years, weapons, money, children, or the reason behind one's pride or his distinguished look. (Also see Trumpet)"}, {"id": "hornet", "label": "Hornet", "category": "Animals", "meaning": "A hornet in a dream represents a fighting enemy, a builder, an architect, a thief, a highway robber, a despicable person whose earnings are unlawful, a singer who sings in the wrong key, eating poisonous food, or disclosing someone's secret. A hornet in a dream also represents a slanderer, a troublemaker, a strong fighter, a strong enemy that will argue against the truth, or merciless people, a vile person, a blood thirsty person, a stinging personality, or a harmful connection. Fighting attacking hornets in a dream means a war with evil people."}, {"id": "horoscope", "label": "Horoscope", "category": "Celestial Bodies", "meaning": "(Stars, See Moon)"}, {"id": "horse", "label": "Horse", "category": "Animals", "meaning": "(Castle, Chivalry, Generosity, Goodness, Merchant, Nobility, Partner, Son, Travels, Wife) Owning horses in a dream means prosperity or victory over one's enemy. Riding a horse in a dream means dignity, honour, and wealth. Perhaps it could mean that one will befriend a noble person or meet a good companion on the road. Owning a mare in a dream means begetting a beautiful son. If it is a nagor or a workhorse in the dream, it means that he will live satisfied, or that he may marry a rich and noble woman who will bear his children. Seeing a horse in a dream may also connote owning a good house. If it is a blond horse in the dream, it means knowledge, devotion, piety, and fear of wrongdoing. A nag in a dream represents a wife or a husband. A saddled horse in a dream means a woman in her menstrual period, during which time it is not permissible for the husband to engage in marital intercourse with her. A gathering of horses in a dream represents a gathering of women for a funeral or a wedding. Owning a herd of horses, or taking care of their feed in a dream, means presiding over people, or it could mean managing a business. If a horse dies in one's presence in a dream, it means loss of his house or business. The fit of a horse in the dream represents a state. Descending from a horse in a dream means committing a sin that will force one to resign from his position or be dismissed from his work. A hairy horse in a dream represents a large family. If the tail of one's horse is cut off at its end in a dream, it means that one may come to see the death of his children and clan before his own eyes. If the tail of one's horse is simply clipped in the dream, it connotes his death and that his name will be quickly forgotten. If one is attacked by a horse in a dream, it means that a noble person, or a young boy, will stand to him and require just retribution from him. A flying horse with two wings in a dream means that one may be tried with affections toward a perverted boy or a woman who will tempt him, then follow him. If a descendant of the family of God's Prophet, upon whom be peace, sees himself flying on a winged horse in a dream, it means that he will rise in station and preside over people. If one sees horsemen coming through the skies in a dream, it means that a war may take place in that land. Riding a horse and holding a spear in one's hand in a dream means forcing people to do something, or forcing them to pay what they owe. If one sees his horse drowning in a dream, it means that he may die from an illness. Buying a horse and tending the money to the seller in the dream means profits in one's business, or earning money from teaching. Selling one's horse in a dream means doing good and being grateful for it. If one's horse bites him in a dream, it means that he will lead an army in a war. If one kills a horse in his dream, it means that he will be awarded status, rank, and money. Slaughtering a horse for other than food in a dream means spoiling one's livelihood. If one sees a horse whose owner is not known entering a town in a dream, it means that a noble person will enter that town, and people of his trade will fear his competition or his becoming a danger to their business. If such a horse reverts its course and leaves that town in the dream, it means that a great, though unknown person from that locality will die shortly. Horses running across the streets in a dream represent a destructive rain or devastating floods. A feeble horse in a dream represents the weakness of its owner. (Also see Dung, Horse fright, Nag)"}, {"id": "horse-fright", "label": "Horse fright", "category": "Action", "meaning": "Saying, as in horse fright, in a dream, means hastening to undertake a journey, moving quickly from one place to another, or substituting one school of thought for another, adopting a new ideology, or changing one's religion. (Also see Horse)"}, {"id": "horse-litter", "label": "Horse litter", "category": "Objects", "meaning": "(See Palanquin)"}, {"id": "horse-race", "label": "Horse race", "category": "Action", "meaning": "(See Racing)"}, {"id": "horseman", "label": "Horseman", "category": "Types of People", "meaning": "To see a horseman leading a procession, a caravan, or a group of travellers in a dream means going on a distant journey, recovering from an illness, or it could mean business activity. (Also see Ride)"}, {"id": "hose", "label": "Hose", "category": "Objects", "meaning": "(See Watering hose)"}, {"id": "hospitality", "label": "Hospitality", "category": "Feelings", "meaning": "(Dinner, Food) In a dream, hospitality means getting together for a charitable cause or to perform good deeds. If one invites people for a dinner and they eat to their satisfaction in the dream, it means that he will preside over them. Preparing a guest room in one's house in a dream means the arrival of a long-awaited traveller. (Also see Food, Guest, Invitation, Table)"}, {"id": "hostage", "label": "Hostage", "category": "Types of People", "meaning": "(Pawn, Deposit) If one sees himself as a hostage in a dream, it means that he has earned an accumulation of sins that made him a pawn for repayment of his debts. If one sees himself holding someone as a guarantee for a promise, or keeping him as a pawn until his demands are met in a dream, it means that he is veering toward injustice. A hostage in a dream also represents mistakes, errors, exposing people's private lives, divulging people's secrets, slander, or a debt that keeps the person subject to constant harassment. Being a hostage in a dream also means adversities, trials, or falling in love with someone, whereby one's heart becomes a hostage of their beloved. (Also see Enemy, Enmity)"}, {"id": "hostel", "label": "Hostel", "category": "Objects", "meaning": "(Inn, Hotel, Lodge, Pub) In a dream, a hostel represents fornication, adultery, temporary marriage for pleasure, renting a space, renting tools or machinery, leasing an area for storage, or renting a garment. If a sick person rents a room in a hostel or an inn on the highway in a dream, it means his death, or it could mean that he will recover from an illness, or dispel anxiety, or take residence in a new country, or it could mean marriage after being single for a long time, or buying a vehicle, finding a money pouch, or something one can sell to help him during his financial crises. A married person resting in a hostel in a dream means that he will beget a son who, when he grows, will help his father in his trade and bring him happiness and comfort. If one's child is disobedient or recalcitrant, it means that he will repent and come back to live under his father or mother. If a heedless person sees a hostel in a dream, it means that he will find guidance and return to walk on God's path. (Also see Hotel)"}, {"id": "hot", "label": "Hot", "category": "Weather", "meaning": "(Bathhouse, Boiling water, Hot pepper, Pungent) Eating hot food or drinking a hot drink in a dream may represent arduous earnings or abundance that becomes a burden. It may also represent unlawful earnings, illegal profits, losses, or losing any blessing that may be contained in one's deeds. Washing a deceased person with boiling water in a dream means that he is destined for hellfire."}, {"id": "hot-water", "label": "Hot water", "category": "Water", "meaning": "Washing one's dirt with hot water in a dream means benefits. Drinking hot water from the boiler in a dream means sickness, stress, depression, or a scare by evil spirits. (Also see Bathhouse, Drink, Hot)"}, {"id": "hotbed", "label": "Hotbed", "category": "Objects", "meaning": "(See House garden, Nursery)"}, {"id": "hotel", "label": "Hotel", "category": "Objects", "meaning": "(Hostel, Inn, Travelling to a foreign country) A hotel in a dream represents one's house, body, name, property, glory, bathhouse, oven, or a court of justice. Whatever may happen to him in that dream could take place in conjunction with any of the above elements and relationships to his condition. Staying overnight in an unknown hotel in a dream means travel, or it may indicate the abode of this world from which one travels to reach the abode of the hereafter. (Also see Hostel, Travel)"}, {"id": "hourglass", "label": "Hourglass", "category": "Objects", "meaning": "(Sandglass) In a dream, the two bulbs of a sandglass represent two sons, or two brothers, or two partners. Whatever happens to them in the dream will reflect on such people. An hourglass in a dream also means makeup, beauty, or marriage. The sand trickling from the upper bulb into the lower bulb in a dream represents man's semen."}, {"id": "house", "label": "House", "category": "Objects", "meaning": "(Cage, Dwellings) In a dream, one's house holds different meanings. One of them is life. If one sees himself entering his house in a dream, it means that he will get married or have sexual intercourse with his wife. Building one's own house in a dream means that a sick person will recover from his illness. If such construction is hard and if it is customary in that family to bury its dead under the compound of the same property, then it means the death of a sick person in the family. If no one is sick in that house and the construction is accompanied by music and celebrations in the dream, then it means adversities, trials, and hardships. If under such circumstances the person in the dream is unmarried, it means marriage, and if he is married, it means that he will marry off one of his daughters. If one sees himself tied up and imprisoned inside a house in a dream, it means that he will receive glad tidings, or it could mean good health and prosperity. If one sees himself carrying a house over his shoulders in a dream, it means that he takes care of a needy woman or a wife. If one sees his house made of gold in a dream, it means that a fire will burn it down. If the house has no roof, whereby one can see the sky, sun, or moon in a dream, it represents the marriage of a woman from that household. If one sees a big house within his own house in a dream, it means that a righteous woman will live there or move into that family to become a blessing for such a house. If there is a tunnel under such a house in the dream, it denotes deception or that a perfidious person has access to that household. A house without lights in a dream represents a woman of evil character, and if a woman sees that house in her dream, then it represents a man of evil character. Demolishing one's house in a dream means a fight within that family. If one sees grass growing inside his house in a dream, it means a wedding. (Also see Cage, Dwellings, Glasshouse)"}, {"id": "house-garden", "label": "House garden", "category": "Plants", "meaning": "In a dream, a house garden means protection of women's chastity, the honour of men's abstinence, denial of suspicion regarding the lawfulness of one's earnings, or protection of children's innocence. A private garden in a dream may mean stinginess, or refusing to satisfy the needs of someone who asks for help, whether his needs are financial or relating to acquiring knowledge. A house garden in a dream also represents one's private devotion, fasting, asceticism, piety, fear of wrongdoing, celebrating God's praises, and exalting His holiness. A house garden in a dream also could mean a marriage within the family, insanity on the part of the house dwellers, paying a financial penalty, or it could mean an imposition. (Also see Garden, Nursery)"}, {"id": "household", "label": "Household", "category": "Types of People", "meaning": "(See Dependents)"}, {"id": "housekeeper", "label": "Housekeeper", "category": "Types of People", "meaning": "(See Lantern, Wick)"}, {"id": "hubbub", "label": "Hubbub", "category": "Feelings", "meaning": "In a dream, hubbub means witnessing social disorder, a public outcry, participating in a religious festival, or joining an important event that involves the interests of all people. (Also see Shout)"}, {"id": "hud", "label": "Hud", "category": "Prophets", "meaning": "(God's prophet Hud, upon whom be peace, who was sent to the people of the king 'Ad.) If one sees God's prophet Hud in a dream, it means that he will suffer harm from ignoble and ignorant people, then he will escape from a great distress, and be saved from their evil. Seeing God's prophet Hud in a dream also means that one will receive guidance, blessings, and be able to save others from plagues and destruction."}, {"id": "hug", "label": "Hug", "category": "Action", "meaning": "(Cuddle, Embrace, Hold) To embrace a living person in a dream means to associate with him and to love him. To give a deceased person a short hug in a dream means longevity. To give a deceased person a long and continuous embrace in a dream means one's death. To embrace a woman in a dream means embracing the pleasures and attractions of this world and to despair of any reward in the hereafter. To hold tight to a piece of fruit, or to endear certain loved ones in a dream, means easy profits or lawful earnings. If an unmarried person holds tight or embraces a garment in a dream, it means that he will get married. If one buys a pair of shoes in a dream, it means that they will hold a new position or a job that will make them extremely happy. (Also see Embrace, Grabbing, Gripping, Sexual intercourse)"}, {"id": "hulk", "label": "Hulk", "category": "Objects", "meaning": "(See Giant)"}, {"id": "human-being", "label": "Human being", "category": "Types of People", "meaning": "To see one of the children of Adam, one does not recognize in the dream, perhaps may represent oneself. If he does good, then it represents one's deeds, and if he does evil, the seer may pursue the same. If one recognizes such a being in the dream, it means that they will receive something from him. If one likes what he receives from him in the dream, it means that he will attain his personal goals. If he receives a shirt in a dream, it means an appointment to a high-ranking position. If he receives a rope in the dream, it means an agreement, a commitment, or a covenant. If he takes money from him in the dream, it represents something he will lose and forgo in despair, or perhaps that a fight will take place between them. Each human being in a dream represents himself, his kind, look alike, someone by the same name, his town, or his craft. If the person whom he recognizes in the dream holds an elevated rank, it means that he will lose it, and if he holds a lower rank, it means that he will be promoted. (Also see Man, Mankind)"}, {"id": "human-body", "label": "Human body", "category": "Human Body", "meaning": "(See Body)"}, {"id": "human-brain", "label": "Human brain", "category": "Human Body", "meaning": "(See Body, Brain)"}, {"id": "human-call", "label": "Human call", "category": "Action", "meaning": "(See Shout, Voice)"}, {"id": "human-cry", "label": "Human cry", "category": "Action", "meaning": "(See Shout, Voice)"}, {"id": "human-flesh", "label": "Human flesh", "category": "Food", "meaning": "(See Flesh)"}, {"id": "human-rights", "label": "Human rights", "category": "Other", "meaning": "(See Destruction)"}, {"id": "human-voice", "label": "Human voice", "category": "Human Body", "meaning": "(Human sound. See Voice)"}, {"id": "humiliation", "label": "Humiliation", "category": "Feelings", "meaning": "To see oneself humiliated in a dream means that one will triumph and rise in station. However, humiliation in a dream may also mean poverty, frugality, lack of spiritual depth, or religious attendance. Suffering from humiliation in a dream also means earning a rank of honour. (Also see Meekness)"}, {"id": "humourist", "label": "Humourist", "category": "Types of People", "meaning": "(Comedian, Storyteller) In a dream, a humourist represents frivolity, prankishness, satire, falsehood, deceit, or sarcasm. (Also see Comedian)"}, {"id": "hump", "label": "Hump", "category": "Human Body", "meaning": "A hump in a dream represents a condition that will make one a celebrity, or it could represent a debt one is unable to pay. This is because one's back is the point that carries his burdens. A hump in a dream may also be interpreted as a burden, longevity, or bearing children. (Also see Hunchback)"}, {"id": "hunchback", "label": "Hunchback", "category": "Types of People", "meaning": "(Friend, Good luck, Money, Prosperity) A hunchbacked in a dream means prosperity, longevity, or having a large family. Seeing oneself in a dream as a hunchback means acquiring wealth and a large property through an influential person in one's family or a son. One who sees that in a dream will also be gifted with vigilance and astuteness. (Also see Back, Body, Hump)"}, {"id": "hunger", "label": "Hunger", "category": "Feelings", "meaning": "In a dream, hunger means wearing the garments of mourning, being seized by fear, or tightening one's fist. Hunger in a dream also represents financial losses, eagerness to maintain a certain level of standards, persistence in seeking one's livelihood or pursuing one's trade, or love for the world. Some dream interpreters perceive hunger as over-satiation and thirst as thirst-quenching in a dream. If one sees himself hungry during the winter season in a dream, it means that he will be tried with gluttony. If one's hunger lasts long in the dream, it means that they will receive benefits after a long wait. Hunger in a dream is also considered to mean money, bad company, visiting, asceticism, fasting, inflation, oppression, poverty, and perhaps sometimes it may mean piety and fear of wrongdoing, or remembering and thanking God Almighty."}, {"id": "hunt", "label": "Hunt", "category": "Action", "meaning": "(Food) In a dream, a hunt represents booty or profits. If one hunts a deer or a rabbit in his dream, it means money and profits. If one hunts for sport in a dream, it means backbiting or slandering a person. If one sees himself hunting with hunting dogs in a dream, it means that he will fulfill a long-desired wish. If one sees dogs going out to hunt in a dream, it means good news for everyone, or it could mean engaging in an act, or establishing a business. If he sees the dogs returning from the hunt in a dream, it means dispelling fears or a shortage of work. If one sees himself fishing with a fishing instrument in a dream, it means making an honest living or seeking lawful earnings. Hunting in a dream represents one's diligence and determination to succeed in life, and to earn his livelihood with his sweat. If one happens to be unmarried, then hunting in a dream means that he will get married. If one is married, it means that he will beget a son. If a woman sees herself hunting in a dream, it means that she has control over her husband's money, her father's assets, or it could mean that she will receive an inheritance or control vast interests in a business. Hunting small prey in a dream represents knowledge, a trade, or an inheritance. (Also see Dog, Hunter)"}, {"id": "hunter", "label": "Hunter", "category": "Types of People", "meaning": "In a dream, a hunter represents a philanderer, a womanizer who rounds up women, or a pimp. If one sees himself befriending a hunter, or if he helps him, and if the hunter is pursuing what is lawful to kill for food, one's dream then connotes personal advantages. If the hunt is after an animal that is unlawful for food, then the dream means suffering. Hunting a lion in a dream means acquiring great power through deception. Hunting sparrows, hawks, or falcons in a dream also means gaining power. Hunting birds or pigeons in a dream represents a tricky merchant. Hunting beasts in a dream means cheating travellers. Fishing means womanizing. A beast hunter in a dream represents someone who takes advantage of foreigners. A bird hunter in a dream also represents a school teacher, a music teacher, or a preacher. (Also see Beast, Dog, Hunt)"}, {"id": "hunter-snare", "label": "Hunter snare", "category": "Objects", "meaning": "(See Trap)"}, {"id": "hunting", "label": "Hunting", "category": "Action", "meaning": "(See Dog, Hunter, Shooting)"}, {"id": "hunting-dog", "label": "Hunting dog", "category": "Animals", "meaning": "(Lust, Desire, Want. See Dog)"}, {"id": "hurl", "label": "Hurl", "category": "Action", "meaning": "(See Thrust)"}, {"id": "hurricane", "label": "Hurricane", "category": "Weather", "meaning": "(See Collapsing walls, Destruction, Wind)"}, {"id": "hurry", "label": "Hurry", "category": "Action", "meaning": "(Celerity, Haste, Hastiness, Quick pace) Walking with dispatch, or with a quick pace in Mecca or in any town in a dream, means victory over one's enemy. Celerity in a dream also represents haste, or the dispatch through which one leaves this world. Moving with a quick pace in a dream also means loss of one's position, or it could mean attending the pilgrimage season in Mecca. (Also see Hastiness)"}, {"id": "hurt", "label": "Hurt", "category": "Action", "meaning": "(See Pain)"}, {"id": "husk", "label": "Husk", "category": "Plants", "meaning": "(See Shell)"}, {"id": "hyacinth", "label": "Hyacinth", "category": "Plants", "meaning": "(Bulbs, Gem, Sapphire) These bulbous and bell-shaped flowers in a dream differ in meaning depending on their type, shape, and fragrance. If one smells a hyacinth flower in a dream, it means relief from sorrow, the end of adversities, good deeds, or making a true promise. If one sees a deceased person carrying such a flower, or offering him a hyacinth flower to smell in a dream, it means that the deceased person is dwelling in paradise. If an unwed person sees a hyacinth flower in his dream, it means that he will get married. If a married person sees a hyacinth flower in his dream, it means that he will beget a son, or he may acquire knowledge, or specialize in a scientific project that will add to his pride. Perhaps a fragrant hyacinth in a dream could mean disturbances, distress, or a sickness. It is said that any flower from the lily family may represent death when presented to a sick person in a dream. A healthy hyacinth plant in the ground means a beautiful son, or good words. A garland of hyacinth flowers in a dream means honour. A hyacinth flower salesman in a dream represents a worrisome person, for such flowers do not remain long in his possession. If any of the flowers of the lily family are cut, or made into a bouquet in the dream, then they mean sorrow, and if they are seen on their mother plant, they mean happiness, a husband or a son. If one sees a hyacinth flower being raised to the heavens in a dream, it means the death of a gnostic or that of a renowned scholar. A hyacinth in a dream also represents a son when standing erect in the fields, and it represents a woman when gathered as a bouquet, while it means a calamity if seen cut and placed inside a flower pot, a vase, or in an inappropriate place. A hyacinth flower in a dream also represents a beautiful woman or blessings, its fragrance represents one's love for his wife, and its tenderness represents one's concern and support for his family. Seeing branches of hyacinth spread inside a house in a dream means lauding or commending someone. If one is offered a hyacinth flower but finds that it carries no fragrance in the dream, it means an adversity. If one throws a hyacinth flower at another person in a dream, it means that the receiver will experience sorrow at their hand and that their friendship will be hampered. If one sees another person sitting inside a mosque and surrounded by hyacinths in a dream, it means that the other person is backbiting him, though what he is saying is not true. (Also see Lily of the valley, Water lily, Stone)"}, {"id": "hyena", "label": "Hyena", "category": "Animals", "meaning": "(Hog-like wolf) A hyena in a dream represents a fierce, unjust, and perfidious enemy whose actions stem from the directives of an evil and ugly old witch. If one sees himself eating the meat of a hyena in a dream, it means that he is bewitched and does not know it, though subconsciously, he will desire and seek to be free from such an evil spell. Riding a hyena in a dream means marriage. A lame hyena in a dream represents a witch, or the wife of an unknown person, a jobless person, a loafer, or a cheater. Riding a hyena in a dream also means gaining authority. A hyena in a dream also may denote exposing one's secrets, interfering in people's business, effeminacy, a hermaphroditic person, a wretched wife, or an ugly, treacherous, and disloyal woman. Thus, when interpreted to mean a woman, it means that one may marry such a woman. Shooting a hyena with an arrow in a dream means corresponding with such a woman. Throwing a stone or a walnut at a hyena in a dream means slandering a woman. Hitting a hyena with a sword in a dream means lashing at such a woman with bad words. Drinking hyena's milk in a dream means suffering losses at the hand of such a woman through betrayal. Stabbing a hyena in a dream means doing business with such a woman, or managing her business, or getting married to someone in her family. Getting hold of the skin, bones, or hair of a hyena in a dream means taking advantage of such a woman and using her for her money. If it is a male hyena in the dream, then it represents a criminal and a despised person."}, {"id": "hymn", "label": "Hymn", "category": "Action", "meaning": "(See Zikr)"}, {"id": "hypocrisy", "label": "Hypocrisy", "category": "Feelings", "meaning": "(Lumber, Wood)"}]