[{"id": "kaaba", "label": "Kaaba", "category": "Objects", "meaning": "(God's house in Mecca.) In a dream, the holy Kaaba represents the caliph of all Muslims, his chief minister, a leader of a country, or it may represent a wedding. Seeing the holy Kaaba in a dream also means that one may enter it, or it could mean receiving glad tidings and dispelling evil. Praying inside the holy Kaaba in a dream means enjoying the guardianship and protection of someone in authority, and safety from one's enemy. Entering the holy Kaaba in a dream means entering before a ruler. Taking something from inside the holy Kaaba in a dream means receiving something from the ruler. If one of the walls of the holy Kaaba crumbles in a dream, it means the death of the Caliph or the local governor. Entering the holy Kaaba and failing to perform any of the prescribed rites in a dream means standing before God Almighty on the Day of Judgment, having performed one's obligations, or it could mean repenting from one's sins. To look at the holy Kaaba in a dream means safety and protection against fear. If one is given a job in Mecca in a dream, it means that he may become an Imam. Stealing anything from the holy Kaaba in a dream means sinning. Walking toward the holy Kaaba, or seeking it in a dream, means correcting one's religious standing. Seeing oneself in Mecca mixing with departed souls who are inquiring from him about the world in a dream means to die testifying to the Oneness of God Almighty and to the prophethood of His Messenger, upon whom be peace. Seeing the Kaaba inside one's own house in a dream means that one is still in power and living with grace. If the holy Kaaba does not look right in one's eyes in the dream, then it means adversities. If one sees the holy Kaaba as his own house in a dream, the holy Kaaba then represents the Imam of all Muslims, who is the representative and vice-regent of God's Messenger, and it means that one truly follows the Imam. Praying on top of the holy Kaaba in a dream means becoming an apostate. Entering the holy Mosque in Mecca and praying on the roof of the holy Kaaba in a dream represents peace, tranquillity, presiding over others, it also means that one will become victorious wherever one goes, though with a questionable conduct, he also may follow innovation and depart from the traditions and teachings of God's Messenger, upon whom be peace. Walking by the holy Kaaba, or leaving it behind in a dream, means going against the traditions of God's Prophet, upon whom be peace, following the path of innovation, or interpreting things according to one's mind and liking. If one sees angels descending from the heavens to lift away the pillar of God's House from Mecca and place it in a different town in the dream, it means that people have gone astray, and the time of destruction has come. It also means that the pillar of the faith, the righteous guide of the believers, and God's vice-regent on earth, AI-Mahdi, will soon emerge to dwell in that town. If one sees the holy Kaaba burning in a dream, it means that one has neglected or abandoned their prescribed prayers. Any changes, decrease or increase in the shape of the holy Kaaba, moving of it away from its place, or changing its look in a dream will reflect upon the Imam, or the guide of all Muslims. Circumambulating the holy Kaaba or performing any of the prescribed rites in a dream means walking the path of righteousness, or correcting one's religious life as much as one does in his dream. Failure to perform some of the prescribed rites that are associated with being at the holy Kaaba in a dream indicates one's deviation from God's path, and such innovation is equal to changing the direction (arb. Qibla) of one's prayers. The holy Kaaba in a dream also represents one's prayers, for it is the focal point of all praying Muslims. The holy Kaaba in a dream also represents God's House, a mosque, a community centre of all Muslims, and it represents a teacher, a guide, Islam, the holy Qur'an, the prophetic traditions, one's son, a religious scholar, a shaikh, a master, a husband, one's mother, and the heavenly paradise. The holy Kaaba is God's House, and thereat people will be gathered and led into paradise. The holy Kaaba in a dream also represents the annual pilgrimage to Mecca, the gathering of believers, the local markets, and the vicinity of the holy Mosque. If one sees that his own house has become the Kaaba and people are seeking it and crowds are gathering at his door in a dream, it means that he will be endowed with wisdom, gain knowledge and act upon it, and that people will learn at his hand and follow his example. Performing some of the required rites at the holy Kaaba in a dream also means that one may work for someone in authority, or serve a man of knowledge, a shaikh, a renunciate, one's father, one's mother, or it could mean that one has a master who demands clarity, true following and hard-work from his students and disciples. (Also see Circumambulation, Entering Paradise, Gutter of Mercy)"}, {"id": "kajawah", "label": "Kajawah", "category": "Objects", "meaning": "(See Palanquin)"}, {"id": "kasha", "label": "Kasha", "category": "Food", "meaning": "(See Breakfast food)"}, {"id": "kawthar", "label": "Kawthar", "category": "Other", "meaning": "(Plenitude, Abundance, A river in paradise.) To drink from the Kawthar river of paradise in a dream means acquiring knowledge, developing correct deeds, having perfect certitude, and truly emulating the leading practices and character of God's Messenger, upon whom be peace. Drinking from the Kawthar river in a dream also means repentance from sin, abandoning innovations, marriage to a chaste and pious woman, replacing unlawful earnings with lawful ones, and an endowment of leadership and victory. (Also see River)"}, {"id": "keenness-of-mind", "label": "Keenness of mind", "category": "Feelings", "meaning": "(See Wakefulness)"}, {"id": "keeper-of-the-gate", "label": "Keeper of the gate", "category": "Types of People", "meaning": "(Personal guard, Prison guard) If a notable or a public figure sees his keepers of the gates, or his guards standing up in a dream, it means that they are not performing their duty correctly. If they are sitting in the dream, it means that they are failing their duties. The governor's keeper of the gate in a dream represents glad tidings. Usually, he represents a notable person, or a great person who is sought for advice, whereby both great and little people depend on him for access. The keeper of the gate in a dream also represents abeyance, or blocking one's access. (Also see Doorman)"}, {"id": "keeper-of-the-sea", "label": "Keeper of the sea", "category": "Types of People", "meaning": "(See Breakwater)"}, {"id": "keeping-a-secret", "label": "Keeping a secret", "category": "Action", "meaning": "(Secretary) In a dream, hiding a secret means concealing knowledge from those who need it, or it could mean having a good nature, or having good qualities. (Also see Secretary)"}, {"id": "kerbela", "label": "Kerbela", "category": "Other", "meaning": "(See Ashura)"}, {"id": "kerchief", "label": "Kerchief", "category": "Objects", "meaning": "(See Handkerchief)"}, {"id": "kernel", "label": "Kernel", "category": "Objects", "meaning": "(See Pith)"}, {"id": "kettle", "label": "Kettle", "category": "Objects", "meaning": "(Boiler) Seeing a kettle in a dream means sitting in the seat of honor, or it could represent a public roast."}, {"id": "key", "label": "Key", "category": "Objects", "meaning": "A key in a dream represents money, a helping hand, entering the path of knowledge, or it could mean receiving divine guidance. Carrying a bunch of keys in a dream means prosperity, knowledge, and security against one's enemy. Keys in a dream also represent one's children, emissaries, spies, servants, wife, or wealth. Keys in a dream also mean attaining one's goal, or fulfillment of one's prayers. A key in a dream may also mean victory over one's enemy. Holding a wooden key in a dream indicates the character of one who refuses to help others, he holds their money in trust, which means that he does not repay them, for wood in a dream means hypocrisy. Holding onto a key that has no teeth in a dream means cheating an orphan of his inheritance, or becoming a guardian of an estate and deceiving its rightful heirs. Holding the key to Paradise in a dream means acquiring knowledge, lawful wealth, or receiving an inheritance. Keys in a dream also represent the coffers they open. Seeing a key in a dream also means performing a pilgrimage to Mecca. A key made of iron in a dream represents a strong and dangerous man. It also means openness in one's life. Turning a key to open a door or a padlock in a dream means attaining victory over one's enemies. Opening a door or a lock without a key in a dream means attaining the same through prayers. Finding a key in a dream means finding a treasure, or profits from a farmland. If a wealthy person finds a key in his dream, it means that he owes alms tax and he should immediately distribute what he owes, pay charities, and repent for his sins. Holding the key of the holy Kaaba in a dream means working for a ruler or an Imam. If a woman receives keys in a dream, it means her betrothal. Having difficulty opening a door, even with a key, in a dream, means hindrances in one's business, or failure to attain one's goal. A key in a dream also represents new knowledge for a scholar or a learned person. Putting a key inside a door in a dream means placing a deceased person inside his coffin or grave, or it could mean having sexual intercourse with one's wife."}, {"id": "khadija", "label": "Khadija", "category": "Types of People", "meaning": "(Mother of the believers, wife of God's prophet Muhammad, upon whom be peace.) Seeing her in a dream means happiness in one's life and a blessed progeny."}, {"id": "khaniqah", "label": "Khaniqah", "category": "Objects", "meaning": "(Cave, Den, Harbor, lodge, Refuge, Retreat, Sanctuary) Visiting a Khaniqah in a dream means travels, asceticism, piety, fear of wrongdoing, and reading the Qur'?n, ceasing to seek worldly gains, observing sexual abstinence, or it could mean suffering from asphyxia."}, {"id": "khatib", "label": "Khatib", "category": "Types of People", "meaning": "(arb. See Preacher, Sermon)"}, {"id": "khawf", "label": "Khawf", "category": "Feelings", "meaning": "(arb. Fear. See Five times prayers)"}, {"id": "khidr", "label": "Khidr", "category": "Prophets", "meaning": "(arb. God's prophet Enoch, Companion of Moses, upon both of them be peace.) Seeing God's prophet Enoch in a dream means prosperity after depression, being at peace with what one carries, and inexpensiveness after a juncture of soaring prices. Khidr in one's dream also represents longevity, or attending the pilgrimage in Mecca."}, {"id": "khimar", "label": "Khimar", "category": "Objects", "meaning": "(A piece of fabric worn by some women as part of their headdress, To conceal one's face, Attire, Cap, Garb, Mantle, Mantilla, Veil) In a dream, a khimar represents a husband, protection, or an ornament. The extent of its size shows the man's prosperity. Its finesse connotes clarity, and the colour white represents honour and dignity. If a woman sees herself wearing a mantilla in a dream, it means maliciousness, a bad omen, or rancour and falsehood of female companions that might cause difficulties, or separate a husband and a wife. If the khimar is made of black torn fabric in the dream, it means poverty of one's husband, or his being natural, or unsophisticated. Damage to one's veil in a dream means difficulties affecting one's marriage, loss of business, or a calamity caused by a guardian, a father, or a brother. If a man sees himself wearing a mask in a dream, it means that he will commit adultery with his servant. If a woman sees herself removing her veil in public in a dream, it means that she will be tried with a calamity that will take away her sense of shame. If she loses her khimar in the dream, it means that she may lose her husband. If she finds it again in the dream, it means that her husband will return to her. In a dream, a khimar also represents one's religion. (Also see Veil, Yashmak)"}, {"id": "khusuf", "label": "Khusuf", "category": "Celestial Bodies", "meaning": "(arb. Lunar eclipse. See Five times prayers)"}, {"id": "kicking", "label": "Kicking", "category": "Action", "meaning": "Kicking something in a dream means ingratitude. If one is kicked in a dream, it means that someone will demean him in public, or cast down his achievements, or despise him for his poverty, or show haughtiness in dealing with him."}, {"id": "kidneys", "label": "Kidneys", "category": "Human Body", "meaning": "(Daughter, Son, Servant. See Body)"}, {"id": "killing", "label": "Killing", "category": "Action", "meaning": "(Murder, Suicide) Killing in a dream represents a major sin. If one kills himself, or commits suicide in fear of the consequences of his sins in a dream, it means that he is offering true repentance from his sins, though committing suicide is a major sin that will lead its author to eternal sufferings in hellfire. Killing a human being in a dream means committing an evil and atrocious sin. On the other hand, committing an outrageous sin or a conspicuously objectionable act in a dream may mean killing someone. If one is killed in a dream, it means longevity and that he will acquire great wealth from the one who kills him in the dream. If one kills someone without slaughtering him in a dream, it means that the victim will benefit greatly from his assailant. Slaughtering in a dream means injustice. Killing someone in a dream also means relief from depression, grief, affliction, and sorrow. Killing oneself in a dream also means recognition of the value of lost benefits. If one is murdered in a dream and does not know who killed him, it indicates his failure to fulfill his religious duties. If one recognizes their murderer in the dream, then it means triumph over one's enemy. If one sees a victim swimming in a pool of blood that is pouring from his jugular vein in a dream, it means that the victim will suffer greatly from the defamation and slander of his assailant. If one intentionally commits suicide in a dream, it means that he is a subversive rebel and a disobedient servant of God Almighty. Confessing to a murder in a dream means gaining the upper hand. Killing in a dream also could mean that one is missing their prayers, or neglecting them. Killing one's son in a dream means receiving money. If one dies as a martyr in a dream, it also means profits, fulfillment of a promise, business success, or perhaps that he may be assassinated, or drown, or die under a collapsed structure. If the victim in the dream is a witness in court, it means that his testimony will be accepted, or perhaps it could mean that he will enjoy an abundance of blessings in his life. (Also see Fight)"}, {"id": "kiln", "label": "Kiln", "category": "Objects", "meaning": "(See Furnace, Oven)"}, {"id": "kindness", "label": "Kindness", "category": "Feelings", "meaning": "(Courtesy) If a respected person sees himself showing friendliness and kindness toward lowly people in a dream, it means self-degradation, loss of status, dismissal from one's position, poverty, and need for others' assistance."}, {"id": "king", "label": "King", "category": "Types of People", "meaning": "(God Almighty, Governor, Mayor, President, Royalty, Sultan) The true King is God Almighty. If the king is pleased with someone in a dream, it means that God Almighty is pleased with him, and if the king is angry with him in the dream, it means that God Almighty is displeased with him. If one sees the king frowning in a dream, it means that he fails to properly perform his prayers or show true religious devotion. If one sees him smiling in a dream, it means profits in one's material as well as spiritual life. If one sees that God Almighty has appointed him as a king over a land, it means that he will receive such a regency, should he qualify. Later on, unrest will bring tyrants or dictators to justice, while people of knowledge and piety will survive and regain their authority. If one sees himself as a caliph or as an Imam in a dream, and should he qualify, it means that he will receive such an honour, rank, trust, and fame in the land, though his vice-regency will not become hereditary. However, it is a bad omen if he becomes a caliph in the dream and does not qualify for such an appointment. In such a case, and by contrast, he will be humiliated and dispersed, and his helpers will become his superiors, while his enemies will rejoice at his misfortune. If one sees himself as a king in a dream, though in reality he does not qualify, it means that he may die quickly, and the same is true if a sick person sees himself turned into a king. If he is healthy, it means that someone in his family may die shortly. Seeing a king in a dream also denotes exposing hidden secrets. If a philosopher or a fortune-teller sees himself transformed into a king in a dream, then it denotes glad tidings, should he not complain about it in his dream. If a slave sees himself becoming a king in a dream, it means that he will be set free. If one sees himself becoming one of the great kings of this world in a dream, it means that he will attain worldly success in his life, though it will be accompanied by religious failure. If the person is a natural con artist, it means that he will be captured and imprisoned. If a man sees himself awarded a knighthood that is suitable only for a woman, then it means his death. If one sees the king reprimanding him in a dream, it means peace between them. If one sees himself arguing a case with knowledge and wisdom before a king in a dream, it means that he will win his case and receive what he came for. If one sees himself complaisant with the king about his case in the dream, it means that he will lose his case, and the judgment will go the king's way. If one sees himself walking with a king and rubbing shoulders with him in the dream, it means that he will oppose the king or disobey him. If he sees himself following the king in a dream, it means that he will pursue the king's traditions during his lifetime or after his death. If one enters the king's palace prostrating in a dream, it means that he will be appointed to a leadership position and receive the king's pardon. If one sees himself mixing with the king's harem, or sleeping with them, and should there be signs of comfort, trueness, or wisdom in his act in the dream, it means that he will enter the king's inner circles. Otherwise, should he in the dream fear the consequences of what is happening, or if he lacks trueness, or if he slanders them, or indulges in what is unlawful for him to do, then should he reach the king's door, it means that he will triumph against his enemies inside that palace, and they can cause no harm to him. If in his dream, the king gives him a gift, it means that he will win victory and honour in his life to equal the value of that gift. If the king gives him a brocaded silk garment in the dream, it means that he will give him a wife from the royal family. If the king speaks to someone in a dream, it means honour, fame, wealth after poverty, release from jail, expansion of one's business, or victory over one's enemy. If an appointed governor sees himself looking into a mirror in a dream, it means that he will be dismissed from his post. If an appointed king sees someone who looks like him sitting on his throne in a dream, it means that he will beget a son. If he divorces his wife in a dream, it means that he will abdicate his throne. To see oneself sleeping with the king in the same bed and without a curtain between them, and if the king leaves the bed while one remains resting therein in the dream, it means that his mixing with the king will incur jealousy, or that he will inherit him. If one leaves the bed before the king, it means that he will escape from a great danger. If one sees himself sleeping alone in the king's bed in a dream, it means that he will marry a woman from the governing family, or that he may spend from his own money for the sake of a woman in that palace. If the bed is in the palace, though unknown in the dream, it means that he will become a member of that government. If a king hears his subjects praising him in a dream, it means that he will show good qualities. If his subjects shower him with money in a dream, it means that they speak ill of him or cast blame at him. If they shower him with sugar in the dream, it means they speak nicely of him, and if they shower him with stones in the dream, it means that they will speak harshly of him. If one sees the people paying obeisance and bowing to him in a dream, it means that they will stand humbly before him. If they prostrate themselves before him in a dream, it means that they truly praise him. If a king sees himself following the opinion of a woman in a dream, it means that he will lose his kingdom or fall victim to depression, or he will be thrown into jail. If he opposes her in the dream, it means that he will escape from a great danger. If a king sees himself walking in a dream when a common subject comes near him and whispers something in his ear, the commoner here represents the angel of death, Azrael, and it means that the king may die a sudden death. Eating from the hand of one's servant in a dream represents the growth of one's authority, increase of his business, knowledge, or wisdom. If a king sees himself preparing a banquet for guests in a dream, it means that his opponents will come to argue their case, though he will win over them. If he sees himself placing food on the table in a dream, it means that a messenger will come to see him concerning a dispute. If the food is sweet, then the problem will end nicely. If the food is greasy, then the problem will be a lasting one. Sour food then means steadfastness. Eating at the table of a just and righteous king in a dream means blessings and honour. If the king is seen walking alone in the markets in a dream, it means that he is a humble, just, and strong ruler. A sick king in a dream represents weakness in his faith and injustice toward his subjects. If the king is carried over people's shoulders in a dream, it means a lack of faith and a lack of attendance to one's religious obligations, or weakness in his ruling. If the king dies and does not get buried in a dream, it means that the king and his subjects are deviants. If he is buried and the people walk away from his grave in the dream, it means that one will pursue something of no benefit, unless God Almighty decrees otherwise. If one sees the king's head transformed into a ram's head in a dream, it means that the king is just and a kind ruler. If his head is transformed into a dog's head in the dream, then it represents his vile nature. If his chest turns into a stone in the dream, it means that his heart will become like a rock. If one sees his hand turn into the king's hand in a dream, it means that he will receive a leading job. If one sees the king flying with wings in a dream, it means that his authority will spread. If his fingers increase in shape or number in the dream, it means that his greed and injustice will manifest. Any dream about a deceased king will manifest in his successors or his progeny."}, {"id": "kismet", "label": "Kismet", "category": "Feelings", "meaning": "(See Calamity)"}, {"id": "kiss", "label": "Kiss", "category": "Action", "meaning": "(Love, Passion, Rose, Tenderness) A kiss in a dream means satisfying one's need, want, or desire, or it could mean subordinating one's enemy. Kissing a man or embracing him lustfully in a dream means getting hold of what one intends to acquire from him. If it is a lustful kiss, then it means accomplishing one's pursuit of benefits, knowledge, or guidance. If it is an amicable kiss, it means that the one who received the kiss will receive benefits from the one who kissed him, or learn something from him, or reap a new understanding of things through him. Kissing a child in a dream means love, care, and tenderness toward that child. Kissing a servant in a dream means soliciting the friendship of her master or employer. Kissing a married woman in a dream means seeking friendship with her husband. Kissing someone in authority in a dream means replacing him in his function. Kissing a judge in a dream means that one's testimony will be accepted by the court. If a judge kisses someone in a dream, it means that the latter will win a court case, or benefit from such a judge, and the same interpretation applies if a leader or a boss kisses someone in a dream. Kissing one's father in a dream also means benefiting from one another. Kissing one's son with passion in a dream means saving money for him or building a business for him. Giving one's son a tender kiss in a dream means receiving joy or money from him or his mother. Kissing someone between the eyes in a dream means marriage. Kissing someone's eyes in a dream means pursuing both heterosexual and homosexual life, and such a dream carries a warning to cease such loathsome and unlawful practices before contracting an unknown illness. Kissing one's beloved on the mouth in a dream means money. Kissing a woman in a dream means desiring her, or receiving news from one's beloved. Kissing an old woman in a dream indicates an excuse or regret for a slip of the tongue. Kissing a young girl in a dream means drinking a glass of wine. If a scholar kisses a beautiful woman in a dream, it could mean reciting the Qur'an or speaking words of wisdom. If such a scholar is known to love the world and its pleasures, then what he has kissed in his dream is the world itself. Kissing God's right Hand in a dream means attending a pilgrimage to Mecca and kissing the black stone. Kissing God Almighty in a dream means kissing the holy Qur'an, or kissing God's holy Name. If one sees God Almighty kissing him in a dream, it means that his deeds are accepted. Kissing an adorned woman or sleeping with her in a dream means marrying a wealthy widow. Kissing a known deceased person in a dream means benefiting from his knowledge or inheriting his money. Kissing an unknown dead person in a dream means that one will receive money from an unexpected source, or perhaps do business with his heirs. If a deceased person kisses someone in a dream, it means that the latter will receive unanticipated benefits. Lustfully kissing a deceased person in a dream means satisfying one's needs, lust, or completing a project. If a sick person sees himself kissing a deceased person in a dream, it means his death. Finally, if a healthy person kisses a deceased person in a dream, it means that his words are not true. (Also see Rose)"}, {"id": "kissing-a-snake", "label": "Kissing a snake", "category": "Action", "meaning": "(See Weasel)"}, {"id": "kitchen", "label": "Kitchen", "category": "Objects", "meaning": "A kitchen in a dream means preparing food, or it could represent a servant, menial work, a cook, a greasy spoon restaurant, ruins, loss of status, spoils taken from others by force, or it could mean a craft, heat, lust, tampering with the elements, or meddling with people's business. (Also see Ladle)"}, {"id": "kite-first-meaning", "label": "Kite-first-meaning", "category": "Objects", "meaning": "(Small hawk) In a dream, a kite means an insolent or a languorous ruler who is audacious, defiled, and stout-hearted. If one catches and trains a wild kite to hunt for him and he finds that it is not obeying him or holding fast to his wrist in a dream, it means that he will bear a son who will become an outlaw. Otherwise, if the kite flies away from his wrist in the dream, it means that the fetus may die before birth. If chicks represent boys and girls, banding or wrongdoing. A kite in a dream also represents an adulterous wife and a secret affair. (See Introduction)"}, {"id": "kite-second-meaning", "label": "Kite-second-meaning", "category": "Objects", "meaning": "(Aircraft, Soar) In a dream, a kite represents exaltedness, rising in station, determination, or gaining respect. A kite in a dream also means being dismissed, or banished, or it could mean sorcery and magic. If one sees himself playing with a kite in a dream, it means that he might suffer from a spell of black arts. If a kite falls over one's house in a dream, it means that he will be evicted from it."}, {"id": "kneading", "label": "Kneading", "category": "Action", "meaning": "(See Dough, Flour)"}, {"id": "knee", "label": "Knee", "category": "Human Body", "meaning": "(Brotherhood, Health, Kneeling in prayers, Movement, Partnership, Prayers, Servants) One's knee in a dream represents his efforts, toiling, purpose, and share in earning his livelihood. If the skin covering the kneecap appears healthy and flawless in the dream, it means that one's livelihood will become easier to manage, and his financial standing will become stronger. However, if the skin of one's kneecap is detached or hangs loosely in the dream, it denotes coming hardships. If the skin looks rough and swollen in a dream, it means that his hard-earned money will be lost in a bad investment, and subsequently, his earnings will be scarce and hard to get. Knees in a dream also represent the condition of one's health, movements, freedom, and level of professionalism. Healthy knees in a dream also represent travels or business activities. If a sick person experiences knee pain in a dream, it may mean that he is nearing his death. As for a traveller, knees in a dream represent his travelling vehicle. They also connote giving and receiving, quietness, one's residence, savings, expenditures, or immobility. A broken kneecap in a dream means separation between friends, or damage to one's vehicle."}, {"id": "knee-brace", "label": "Knee brace", "category": "Objects", "meaning": "(See Brace)"}, {"id": "knife", "label": "Knife", "category": "Objects", "meaning": "(Dagger, Kitchen knife) In a dream, a knife represents the servant of the house or its sire who strives to serve and benefit his family and friends. The sharpness represents the effectiveness of his commands, the force by which they are carried, or one's magnanimity and distinct personality. If a woman sees herself carrying a knife, or if she gives someone a knife in a dream, it represents her love for a famous person. A pencil-sharpening knife in a dream represents an author or a writer. A slaughtering knife in a dream represents a butcher, while a soldier's knife means strength and service. If a kindergarten teacher is seen stealing a knife in a dream, it means that he is tempted by one of his children, and that he may abuse him. A table knife in a dream represents a lazy person who does not like to work and who cheats when he does go to work. Using a table knife in a dream means the voidance of a project one supports. A knife in a dream also implies proof. A knife in a dream also means acquiring strength and prosperity at the hands of a servant or an employee. Swallowing a knife in a dream means depriving one's son of his inheritance, or stealing his money or property. If one's wife is pregnant, then seeing a knife in a dream means that she will give birth to a son. If one who is going to appear in court sees himself carrying a knife in a dream, it means that he will win his case. If one is given a knife as a gift in a dream, it means that he will beget a son, or have a new brother. If one is not expecting a son or a brother, then it means that he will receive money or an inheritance. Cutting one's hand with a knife in a dream means that one will see wonders. Sheathing a knife in a dream means getting married. If one is married, and if his wife is pregnant, then it means that she will give birth to a boy, if what she carries with her in the dream is more suited for a girl, then it means that she will give birth to a baby girl. If one needs a witness for a trial, and if he sees himself carrying a knife in a dream, it means that he will find such a witness. If the knife is sharpened in the dream, it means that one will find a true witness. If the knife is dull in the dream, it means that his witness is shabby, or that his witness may be hurt before the trial. If the knife is sheathed in the dream, it means that the witness will cower and the court will be satisfied with one's testimony instead. On the other hand, a knife in a dream could mean profits, benefits from a brother, a close friend, or a servant."}, {"id": "knife-handle", "label": "Knife handle", "category": "Objects", "meaning": "(Haft, Saber guard, Sword hilt) Seeing a knife handle or a sword haft in a dream means that one still has a property or a minimum amount of property, including but not limited to livestock, gold, silver, or cash savings, that is subject to the obligatory (Zakat) alms tax."}, {"id": "knife-sharpener", "label": "Knife sharpener", "category": "Objects", "meaning": "A knife sharpener in a dream represents someone who teaches people skills, sagacity, and adroitness. A knife sharpener in a dream also represents sobriety, a dignified bearing of adversities, or he could represent a vile person, a troublemaker, or a decisive person."}, {"id": "knight", "label": "Knight", "category": "Types of People", "meaning": "(See Chess Knight)"}, {"id": "knighthood", "label": "Knighthood", "category": "Other", "meaning": "(See Raiment)"}, {"id": "knitting", "label": "Knitting", "category": "Action", "meaning": "(Interlacing yarn or thread, Weaving) In a dream, knitting represents a problem solver, garments, travel, or hesitation. Knitting in a dream also means the passing of one's life and the nearing of its end. Knitting in a dream also means living under acceptable conditions, or experiencing the gifts of life between exhilaration and deflation. Knitting a garment in a dream means traveling. If one sees himself wrapping the knit in a dream, it means that his mind is set on travelling. If one unravels his knitted item after completing it in a dream, it means that his goal was reached, then obstructed. In such a dream, if one is incarcerated, it means that they will be released. If he is disputing something, it means that his disagreements will be solved. Knitting in a dream could also denote sodomy."}, {"id": "knock", "label": "Knock", "category": "Action", "meaning": "(Door) Knocking on one's door in a dream means a fight waged by an intruder. (Also see Close, Door)"}, {"id": "knocker", "label": "Knocker", "category": "Objects", "meaning": "A door knocker in a dream represents the door attendant, the announcer, a messenger, a warning guard, a security system, or a guard dog. If the knocker is made of gold or silver in the dream, it represents honour and prosperity for the people of such a house. If one sees two door knockers at his door in a dream, it means a debt he owes to two people. If one pulls out the door knocker, and if it breaks in his hand in the dream, it means that he follows a path of innovation. (Also see Club)"}, {"id": "knocking", "label": "Knocking", "category": "Action", "meaning": "(See Smashing)"}, {"id": "knot", "label": "Knot", "category": "Objects", "meaning": "(Bond, Bridge, Contract, Liaison, Tie) To make a knot in one's shirt in a dream means engaging in business. Tying a knot with a rope in a dream represents one's religious commitment. Tying a knot with a handkerchief in a dream means giving fringe benefits to a servant or to an employee. Tying a belt over a pair of pants in a dream means marriage. Tying a knot with a thread in a dream means asserting one's intention, or stipulating one's plan, or it could mean sorcery and an evil spell. If one sees himself tying a rope or a thread around a pouch or a bag and could not open it again, and if an unknown person comes by and unties the knot in the dream, it means distress, stress, up tightness, or suffering from political persecution, or financial adversities that will be lifted unexpectedly by God's leave. (Also see Contract, Thread, Tie, Untying something)"}, {"id": "knowledge", "label": "Knowledge", "category": "Other", "meaning": "(Bread, Learning, Wall) To see oneself acquiring knowledge in a dream means marriage and rising in status. Such a wedding will be announced publicly. If one earns a title of recognition, or if he becomes renowned, or if he is awarded a great prize for his work in a dream, it means glad tidings of a beautiful son he will beget and who will follow his father's footsteps, learn his trade, or work at spreading his father's knowledge or traditions, or he may govern or lead after him. To learn about God Almighty, or about the prophetic traditions of His Messenger, upon whom be peace, in a dream means being encompassed with God's mercy and subtle kindness. To learn about sorcery, black magic, or similar arts in a dream means following innovation and walking the path of heedlessness. (Also see Learning)"}, {"id": "kohl", "label": "Kohl", "category": "Objects", "meaning": "(Eye makeup, Makeup) Kohl, in a dream, represents money and clarity. If one is given some powdered kohl in a dream, it means money. If a righteous and Godfearing person places kohl on someone's eyes in a dream, it means blessings and guidance. Finding a container of kohl in a dream means receiving money. Smearing one's eyes with kohl in a dream means becoming more religious. If a blind person smears his eyes with kohl in a dream, it means that he will miraculously recover his sight. If one smears his eyes with a silver-white powdered mixture or antimony in a dream, it means that he will have two wives. If one coats his eyelids with butter or lathers in a dream, it means that he is pursuing an unlawful heterosexual or a loathsome homosexual relationship. Beautifying children's eyes with anything other than kohl or antimony in a dream means molesting them. If one uses kohl as medicine for his eyes in a dream, it means that he will correct his religious performance and commit his life to a godly cause. If he intends to beautify himself with kohl in the dream, it means that he is seeking material success or worldly promotion. If someone smears one's eyes with kohl to the degree of blinding him in the dream, it means that he will defraud him of some money. If a virgin girl or a widow places kohl over her eyelids in a dream, it means her marriage. Coating or encrusting one's eyes with blood or ashes in a dream means corruption and an unacceptable marriage, or an illegal marriage. (Also see Makeup)"}, {"id": "kohl-jar", "label": "Kohl jar", "category": "Objects", "meaning": "In a dream, a kohl jar represents a woman who serves others, advises them in managing their finances, and teaches women about their religious and spiritual roles. One's eyes in a dream represent his religious standing, while the kohl is used to beautify them or as a cure. Putting the kohl brush or stick inside a kohl jar to extract kohl powder and apply it to his eyelid in a dream means marriage for a single person, profits for a poor person, or knowledge for an ignorant person. If the kohl jar contains ashes, or butter, or a foamy substance, or feces in the dream, it means that one is seeking earnings from falsehood and innovation. A kohl jar in a dream may also represent a coffer, lost money, or a box to keep one's papers or documents. (Also see Kohl)"}, {"id": "kursi", "label": "Kursi", "category": "Objects", "meaning": "(arb. See Chair, Divine Throne)"}, {"id": "kusuf", "label": "Kusuf", "category": "Celestial Bodies", "meaning": "(arb. See Eclipse, Five times prayers)"}]