[{"id": "labor", "label": "Labor", "category": "Action", "meaning": "(Hard work, Toil) Hard labour in a dream means comfort in wakefulness. If a businessman or a rich person sees himself working as a labourer in a dream, it represents conceit and a sham, or that he is deceiving people to control their money, or defrauding them of their assets. If one sees himself labouring in a dream, it means thriftiness, discretion, or virtue, along with satisfaction and ease in one's life. Labouring in a dream also means a misfortune or one's peril. (Also see Labourer)"}, {"id": "labor-pangs", "label": "Labor pangs", "category": "Feelings", "meaning": "(See Tremor)"}, {"id": "labor-throes", "label": "Labor throes", "category": "Feelings", "meaning": "(See Tremor)"}, {"id": "labourer", "label": "Labourer", "category": "Types of People", "meaning": "A labourer in a dream represents an honourable worker who possesses dignity, integrity, and whose earnings are blessed. (Also see Construction worker)"}, {"id": "lactate", "label": "Lactate", "category": "Action", "meaning": "(See Colostrum, Milk)"}, {"id": "ladder", "label": "Ladder", "category": "Objects", "meaning": "A wooden ladder in a dream means distress and toiling one may endure during a journey. A ladder in a dream also represents peace and safety. Climbing a ladder in a dream means receiving a warning or an admonition to do good and eschew evil for someone who does not oblige. If one's ladder turns into concrete stairs in a dream, it means assiduity and veiling or protecting of one's privacy. A ladder laid on the floor in a dream means authority, while a raised ladder means recovering from an illness. A ladder also represents travels, comfort to a person who is struck by sorrows, or it could represent a great person. Climbing a new ladder in a dream means reaching new spiritual attainments, or it could represent his business success. Even climbing an old ladder in a dream means success in one's business, exaltation, and profits. Falling from a ladder in a dream means adversities, spiritual fall, and temptation. Climbing down a ladder in a dream means business losses. If the ladder breaks in the middle of one's ascent or descent in the dream, it means losing to one's competition. If one fixes a ladder to descend upon something he knows in a dream, it means safety from danger, arrogance, fears, or escape from an accident that might cost him his life. Climbing a ladder in a dream also means seeking the help of people who are filled with hypocrisy. If one climbs a ladder to hear something in a dream, it means that he will achieve success and attain power. A ladder in a dream also means authority, eavesdropping, or spying for evil people."}, {"id": "ladle", "label": "Ladle", "category": "Objects", "meaning": "(Kitchen, Stew) A ladle in a dream represents a household manager, or the lady of the house who properly manages its finances. Eating meat cooked with vinegar from a ladle in a dream means living happily with dignity from money one has earned from his labour, or it could mean serving the domestic needs of others, or working for rich people and making good money, making healthy profits from one's trade, or winning an important political appointment. (Also see Kitchen)"}, {"id": "lair", "label": "Lair", "category": "Objects", "meaning": "(See Hide)"}, {"id": "lake", "label": "Lake", "category": "Water", "meaning": "A lake in a dream represents judges and governors who serve others without conspiracy. A lake in a dream also represents difficulties in completing one's journey. A small lake in a dream represents a rich woman, or a woman with a military spirit, or a woman who likes to be approached."}, {"id": "lamb", "label": "Lamb", "category": "Animals", "meaning": "In a dream, a lamb represents one's son. If one sees himself slaughtering a lamb in a dream, it means that either his son or the son of one of his relatives may shortly die from an illness or an accident. If one is offered a lamb as a gift in a dream, it means that he will beget a noble and blessed son. If one sees himself eating lamb in a dream, it means that he will earn his money through such a son. If one sees himself herding sheep in a dream, it means that he will profit from blessed money and acquire honour and fame thereafter. (Also see Sacrifice)"}, {"id": "lameness", "label": "Lameness", "category": "Human Body", "meaning": "To walk lamely in a dream means concealing God's favours and blessings for selfish reasons, or pretending to be poor when in fact one is rich, or claiming to be in need when his claims are false, or it could mean cunningness, deceit, and fraud. (Also see Limping)"}, {"id": "lamenting", "label": "Lamenting", "category": "Action", "meaning": "(Mourning, Wailing, Yowling) Lamenting and desiring something in a dream connotes evil. Lamentation in a dream also represents a preacher, or it could represent a pious dirt odour that comes from opening the door of a filthy lavatory. Lamentation in a dream also represents dogs' yowling, drum beating, the ringing sound of cymbals, or it could mean a wedding. Sitting in a place where people are lamenting and mourning their dead in a dream means that an ominous evil may take place in that locality, or perhaps it could mean separation between families and friends. If one sees himself mourning a deceased person in a dream, it means that harm will come to him from the descendants or family of the departed person. Lamenting with great pain and sorrow and mourning over a deceased person in a dream also means waking up to great joy and happiness. Lamenting in a dream also means adversities that are driven by the person who is lamenting. It also means going astray, or it could denote a flute, as the flute denotes lamenting in a dream. Lamenting in a dream also represents the work of ignorance."}, {"id": "lamp-stand", "label": "Lamp stand", "category": "Objects", "meaning": "In a dream, a lamp stand represents humankind and their characteristics. The lamp itself represents one's soul, the oil represents one's blood, and the wick represents his temperature. Once the wick is used up and the oil is burned in the dream, it means one's death. If one sees the wick in good condition, and the oil clean and radiant in the dream, it means that he will enjoy a life of purity and happiness. If the wick is black and the oil is murky in the dream, it means experiencing a wretched life. If the stand itself has some deficiencies in the dream, it means an illness of one's body. If the stand is strong and clean, it means that one's body and blood are free from illness. A broken lamp stand in a dream represents a terminal illness. (Also see Lamp, Wick)"}, {"id": "lamp-first-meaning", "label": "Lamp-first-meaning", "category": "Objects", "meaning": "(Candle, Flame, Light, Torch) If a pregnant woman sees herself carrying a lamp in a dream, it means that she will give birth to a son. As for a sick person, a lamp represents his life. If the lamp is dimmed in the dream, it means his death. If one sees himself repairing a lamp in a dream, it means that he will recover from an illness. A lamp with a weak battery or low electrical current represents health problems for a pregnant woman. A strong lamp that lights one's entire house denotes righteousness in that house. If one turns off the light in his house in a dream, it denotes the suspicious character of the owner, his financial troubles, his death, the death of a father, a mother, a wife, a child, or a sick person. If one sees a sick person rising to the sky and carrying a lamp in a dream, it means the return of his soul to its Lord. If one draws light from someone else's lamp in a dream, it means that he will acquire knowledge. Extinguishing the light of an oil lamp in a dream means attempting to conceal the truth by opposing a truthful witness, yet he will fail to win his case. Carrying a lighted lamp in the daylight in a dream represents a religious and righteous person. Walking with a lamp during the night in a dream means observing a night vigil and prayers. If such a person is religious by nature, then it represents benefits. Otherwise, it means that he will see wonders. Carrying a lamp at night in a dream also means repentance from one's sins. Carrying an unlit lamp, candle, or torch in a dream means business losses or problems at the workplace. If one sees a lamp filled with oil that does not burn in a dream, it means sorrow and distress. (Also see Lamp stand, Wick)"}, {"id": "lamp-second-meaning", "label": "Lamp-second-meaning", "category": "Objects", "meaning": "(Housekeeper, Lamp, Steward, Wick) In a dream, a lamp represents a steward, a housekeeper, or a butler. If the oil burns up in one's dream, it means the death of any of the above. If a spark falls on a piece of cotton fabric and burns it in the dream, it means that he or she will face a mishap. If the lamp is put off in the dream, it means that a sick person in that family will soon die from their illness, or that the family will receive news of the death of a relative."}, {"id": "lance", "label": "Lance", "category": "Objects", "meaning": "In a dream, a lance represents a branch of wood, stability based on one's strength, or stepping away from the wrong path. A lance in a dream also represents a woman, a child, testifying to the truth, or going on a journey. A lance in one's hand in a dream represents a grandson or a blessed son who will grow to preside over people and defend them with his own life. A broken lance in a dream represents an incurable deficiency or a disease that will afflict one's child. Carrying a lance while riding a horse in a dream means authority with honour. If someone denies his ownership of a lance in a dream, it means an accident or a betrayal. If the lance belongs to a brother, then it means a calamity. If one does repair a broken lance in a dream, it means recovering from an illness. A lance without a spearhead in a dream means the death of one's brother or child. A lance in a dream also represents a brother or a friend who will part with his brother or friend, or it could mean loss of one's job. Walking with a lance in one's hand in the middle of a marketplace in a dream means walking or strolling with one's son. As for a pregnant woman, a metal lance means that she will deliver a girl, and that she will receive a gift of money or a present after her birth from other daughters. Carrying a lance with a flag raised on top of it in a dream means attaining a position that will earn fame. If one is challenged by someone holding a lance against him in a dream, it means that someone will hurt him with their words or slander his family. Owning an extra lance in a dream means having a brother or a friend who will stand for one's defence when needed. A long spear means injustice, or it could mean good health. If one bleeds from a wound caused by a lance in a dream, it means that he will be compensated for pain and suffering, or that he will return home from a long journey. Multiple wounds from a lance in a dream mean financial compensation, though the source of money is loathsome. Fighting one's enemies with a lance means earning dirty money. A person holding a lance in a dream also represents a teacher, an educator, or someone who helps his brothers and friends. (Also see Javelin)"}, {"id": "lancet", "label": "Lancet", "category": "Objects", "meaning": "In a dream, a lancet represents a slanderer. To cause a horizontal cut to someone with a lancet in a dream means backbiting him, slandering him, and causing enmity between people. If the wound is vertical in the dream, then it means speaking well of someone and bringing people's hearts together. (Also see Javelin, Lance)"}, {"id": "land", "label": "Land", "category": "Earth", "meaning": "(See Earth)"}, {"id": "landmark", "label": "Landmark", "category": "Earth", "meaning": "(See Milestone)"}, {"id": "landscaping", "label": "Landscaping", "category": "Action", "meaning": "(See Earth)"}, {"id": "lane", "label": "Lane", "category": "Earth", "meaning": "(Avenue, City gates, Path, Road, Trail) Seeing a lane in a dream is like seeing the city's gates. If it is closed during the daylight hours in the dream, it means that an accident will take place inside the city or at the end of the lane, and that such an accident will necessitate the closing of its gates or the blocking of the lane. A lane in a dream also represents a servant or cohabitation. Whatever shape the lane takes in one's dream, one will see the same in wakefulness. Following that trail of thinking, walking a lane in a dream means suffering the wrong treatment of a merchant, a person in authority, or a craftsperson. An open road in a dream means that one may work for someone in the government. (Also see Alley, Road)"}, {"id": "language", "label": "Language", "category": "Other", "meaning": "(Tongue, Speaking, Speech) Speaking the language of other people in a dream may represent their country or culture. Speaking Arabic in a dream means honour and dignity. Speaking Persian in a dream means associating with a higher class of people and benefiting from them in business. Speaking Hebrew in a dream means receiving an inheritance. Speaking Turkish in a dream means hearing pleasing words. Speaking Italian in a dream means eagerness to amass money. Speaking French in a dream means drawing benefits from one's profession. Speaking English in a dream means love for the world. If one can speak in all tongues in a dream, it means that he will acquire wealth, strength, and fame. (Also see Reading, Speaking)"}, {"id": "language-teacher", "label": "Language teacher", "category": "Types of People", "meaning": "(See Engraver, Language, Teacher, Writer)"}, {"id": "languid", "label": "Languid", "category": "Feelings", "meaning": "(See Log)"}, {"id": "languor", "label": "Languor", "category": "Feelings", "meaning": "(See Lassitude)"}, {"id": "lantern", "label": "Lantern", "category": "Objects", "meaning": "(Housekeeper, Light) The lantern of a house in a dream represents the housekeeper or a woman. (Also see Lamp, Minaret)"}, {"id": "lapidate", "label": "Lapidate", "category": "Action", "meaning": "(Stoning to death. See Stoning)"}, {"id": "large-hall", "label": "Large hall", "category": "Objects", "meaning": "(See Hall)"}, {"id": "lark", "label": "Lark", "category": "Animals", "meaning": "(zool.) A lark in a dream represents a little boy."}, {"id": "lashing", "label": "Lashing", "category": "Action", "meaning": "(Beat, Hit, Whip) Lashing someone with a whip in a dream means speaking ill of him or slandering him. If he bleeds in the dream, then it means business losses. (Also see Beating)"}, {"id": "lassitude", "label": "Lassitude", "category": "Feelings", "meaning": "To see oneself in a state of listlessness or stillness in a dream is a sign of deviating from one's intention and goal. It also means depleting one's resources, or the conclusion of his life."}, {"id": "last-day", "label": "Last Day", "category": "Other", "meaning": "(Also see Day of Resurrection, Reckoning, Trumpet of Resurrection)"}, {"id": "lasting-dynasty", "label": "Lasting Dynasty", "category": "Other", "meaning": "(See Donkey)"}, {"id": "latch", "label": "Latch", "category": "Objects", "meaning": "(Doorknob, Door latch) A door latch or a doorknob in a dream represents a door attendant, a guard dog, or a servant."}, {"id": "latent", "label": "Latent", "category": "Other", "meaning": "(See Log)"}, {"id": "laughing", "label": "Laughing", "category": "Action", "meaning": "Laughing in a dream means happiness and joy in wakefulness, except if one bursts with a horselaugh or falls over his back from laughing in his dream. If so, then it means crying. If one's laughter in his dream is caused by a joke, then it denotes his dishonesty. The same goes for laughing by imitation in a dream, which means falling into sin. Laughing in a dream also could mean sorrow in wakefulness. Laughing in a dream also means that one will receive news about a newborn son. If one's laughter in a dream is gentle and soft as a smile, then it denotes his good character and means happiness, or it could denote exactly what he shall see in wakefulness. If one sees the earth laughing in a dream, it means a good harvest in that land. If one sees a deceased person laughing in a dream, it means that he is in paradise and enjoying the blessings of the hereafter. Laughing in a dream also represents light-headedness, frivolity, and buoyancy. This is particularly true when it denotes capable people, or people in authority, where laughing in a dream could mean their dismissal from office. (Also see Crying, Laughter)"}, {"id": "laughter", "label": "Laughter", "category": "Feelings", "meaning": "(Menstruating) Uncontrollable mirth in a dream means a misdeed that one desires to eliminate but to no avail. If one does control his hilarity, or even if he repents, he will fall again into the same misdeed. (Also see Menstrual period)"}, {"id": "laurel", "label": "Laurel", "category": "Plants", "meaning": "(Honor) If one who qualifies to be honoured for his achievements is crowned and honoured with the laurel of fame or a crown of victory in a dream, it means blessings in one's life. If one does not qualify for that, then it denotes his mere passion, want, or desire. (Also see Flag, Honor)"}, {"id": "lavatory", "label": "Lavatory", "category": "Objects", "meaning": "(See Toilet)"}, {"id": "lawful", "label": "Lawful", "category": "Other", "meaning": "(Lawful earnings, Permissible, Legal) Earning a lawful income in a dream means the repentance of a sinner, and the guidance of a heedless person. The opposite represents the unlawful."}, {"id": "laxative", "label": "Laxative", "category": "Objects", "meaning": "(See Medicine)"}, {"id": "lay", "label": "Lay", "category": "Action", "meaning": "(Lie, Repose) In a dream, if a man sees himself lying on his back over the floor, it means having good strength, or gaining one. It also means winning worldly profits or the expansion of one's control. If one sees himself lying on his back on the floor with his mouth open and bread loaves coming out of his mouth, it means that he will lose control over his business, meanwhile, he may win something different."}, {"id": "laziness", "label": "Laziness", "category": "Feelings", "meaning": "(See Incomplete job, Lassitude)"}, {"id": "lead", "label": "Lead", "category": "Objects", "meaning": "(Chemical, Hunt, Pipe) Discovering lead as a mineral in one's dream means prosperity and strength in one's livelihood. Forging lead in a dream means becoming competently qualified in one's craft. Lead in a dream also represents earnings from a despicable source based on passion and wantonness. Lead in a dream also means becoming courageous, or speaking unfailingly what's on one's mind. Carrying a container of liquid lead in a dream means that one should be careful about their expenses. Melting a bar of lead means a dispute or a prattle."}, {"id": "leaders", "label": "Leaders", "category": "Types of People", "meaning": "(See Elders, Star)"}, {"id": "leaf", "label": "Leaf", "category": "Plants", "meaning": "(See Tree leaves)"}, {"id": "leaking-water", "label": "Leaking water", "category": "Water", "meaning": "(See Seeping)"}, {"id": "leap", "label": "Leap", "category": "Action", "meaning": "(See Jumping)"}, {"id": "learning", "label": "Learning", "category": "Action", "meaning": "Learning the Qur'an, the prophetic traditions, or a craft in a dream means richness after poverty, guidance after heedlessness, or marriage after celibacy. It also means begetting a son, or walking in the company of a spiritual guide. If one sees himself learning an evil act in a dream, it means that he is going astray, or that he is experiencing poverty after richness. (Also see Knowledge, School, Uncertainty)"}, {"id": "leather-shield", "label": "Leather shield", "category": "Objects", "meaning": "(Suit of mail) In a dream, a leather shield means the same as a coat of mail, though providing more protection. Buying a leather shield in a dream also means getting married. (Also see Armor, Coat of mail)"}, {"id": "leaving-one's-body", "label": "Leaving one's body", "category": "Action", "meaning": "Leaving one's body in a dream means that changes will take place in one's status, marriage, or property."}, {"id": "leech", "label": "Leech", "category": "Animals", "meaning": "(Bloodsucker, Sponger) In a dream, a leech represents the grave's worms that eat one's flesh, or it could denote one's children. If a leech falls from one's nose in a dream, it means that his wife will have a miscarriage. Leech in a dream also represents a base and a despicable enemy."}, {"id": "leek", "label": "Leek", "category": "Plants", "meaning": "(Herb, Regret) In a dream, a leek represents a dead person. Eating it raw in a dream means earning unlawful money, though feeling good about it. Eating it cooked in a dream means refraining from pursuing such ventures. Taking a bunch of leeks in a dream means saying something one will regret."}, {"id": "left-hand", "label": "Left hand", "category": "Human Body", "meaning": "(See Body, Food)"}, {"id": "leg", "label": "Leg", "category": "Human Body", "meaning": "(Thigh, Limb) In a dream, one's legs represent longevity, old age, or his source of income. If one sees his legs turned into iron in a dream, it means that he will live a long life. If they turn into glass in the dream, it means that he will die shortly. If he sees his legs crossed in a dream, it means that he has neared the end of his life, or that he is going to face a major challenge in his life, or that he is a liar. If one sees the thighs of a woman he recognizes in the dream, it means that he will marry that woman or a friend of hers. Hairy legs in a dream mean debts, or that one may die in prison. If one sees his leg twisted in a dream, it means that he will commit adultery. Legs in a dream also represent a man's wealth or his livelihood. In that sense, if one's legs turn into iron in a dream, it represents a lasting prosperity. If his legs turn into wood in a dream, it means that he will grow weaker and be unable to earn for himself. If one's legs become glass or pottery in a dream, it means that he may die shortly, and that his property and wealth will be distributed to his heirs. If one finds his leg shorter than usual in a dream, it means that he will lose some of his money. If one walks on one foot in a dream, it means that he will lose half of his wealth. If both legs are amputated in a dream, it means that he will lose everything he has. If one's leg seems fat in the dream, it denotes a good financial standing, or it could mean buying a good car, or receiving a pleasing gift. If a woman sees herself having hairy legs in a dream, it means humiliation or a trick that she will play before her husband, or that her private life will become public knowledge, or that she will receive spiritual guidance after that she lived in heedlessness. A leg in a dream also denotes hardships. If one sees his legs banded or tied together in a dream, it means fear, poverty, and adversities. Exposing one's legs in a dream means abandoning prayers, and it could mean humiliation. Legs in a dream also signify writing, admonition, advice, reading a book, wisdom, one's rank, pleasure, pitfalls, fault in advising, or wrong interpretation of religious matters. (Also see Foot, Thigh)"}, {"id": "legal-guardianship", "label": "Legal guardianship", "category": "Other", "meaning": "(Custodian, Trustee) If one receives instructions from a testator in a dream, it has six interpretations: either what he is told is true, or that he may be put in charge of an important project, thus, it represents rising in rank, increase in knowledge, celebrating forty years of age, a blessing of a spiritual attainment, or protection from sin. (Also see Sponsorship)"}, {"id": "legendary-bird", "label": "Legendary bird", "category": "Animals", "meaning": "(See Griffin)"}, {"id": "legist", "label": "Legist", "category": "Types of People", "meaning": "(arb. Faqih, Religious scholar, Scholar, Theologian) A legist in a dream represents intelligence, awareness, knowledge, and seeking to study different branches of religious knowledge. Seeing a legist in a dream also represents a physician, repentance from one's sins, or receiving guidance on the straight path. (Also see Masjid, Mosque Scholars)"}, {"id": "leguminous-tree", "label": "Leguminous tree", "category": "Trees", "meaning": "(See Garden herbs, Lentil, Sprouts)"}, {"id": "lemon", "label": "Lemon", "category": "Plants", "meaning": "Eating a lemon in a dream means blame or falling sick. However, if one sees a lemon and does not eat it in the dream, then it means money. Giving someone a lemon in a dream means criticizing him, or it could mean a bust, total loss, or a bad deal. (Also see Lemon tree, Lemon, Tree)"}, {"id": "lemon-tree", "label": "Lemon tree", "category": "Trees", "meaning": "A lemon tree in a dream represents a man who serves and benefits others, or an auspicious and pleasant woman who also has an eccentric opinion about herself. (Also see Lemon, Lime, Tree)"}, {"id": "lending-of-money", "label": "Lending of money", "category": "Action", "meaning": "Lending an object or lending money to someone in a dream means profits of equal value. (Also see Borrowing, Loan)"}, {"id": "lent", "label": "Lent", "category": "Months", "meaning": "(See Fasting, Ramadan)"}, {"id": "lentil", "label": "Lentil", "category": "Food", "meaning": "(Sprout) In a dream, lentils represent lawful money if sprouted, or they could mean depression, or earning loathsome money."}, {"id": "leo", "label": "Leo", "category": "Celestial Bodies", "meaning": "(astr. See Moon)"}, {"id": "leopard", "label": "Leopard", "category": "Animals", "meaning": "(See Tiger)"}, {"id": "leprosy", "label": "Leprosy", "category": "Human Body", "meaning": "(A blood disease, an infectious skin and nerve affecting disease, Albino) To see oneself as a leper in a dream means that one may receive an inheritance, money, or a garment without ornaments. Leprosy in a dream also means working in vain, or losing the benefits of one's deeds because of one's arrogance toward his Lord, and consequently, he will earn God's displeasure. It also means being innocent of false allegations or being subject to people's slanders. If one's leprous condition spreads throughout his entire body in the dream, it means lasting prosperity. If one sees himself praying under leprous conditions in a dream, it means possessing unlawful and forbidden earnings, or forgetting whatever one has memorized from the Qur'an. (Also see Albino)"}, {"id": "lesbian", "label": "Lesbian", "category": "Types of People", "meaning": "(Sapphism, Tribadism. See Hone, Meat, Sexual intercourse)"}, {"id": "lesser-bairam", "label": "Lesser Bairam", "category": "Months", "meaning": "(See Feast of breaking the fast)"}, {"id": "letter", "label": "Letter", "category": "Objects", "meaning": "(Message) Sending or receiving a letter in a dream represents a respectable person, a rank, or a word of authority when personally delivered. If one sends a letter addressed to someone known, exhorting him to do good and eschew evil in a dream, it means satisfying one's needs and fulfilling one's purpose. If one receives a letter containing glad tidings in a dream, it means appeasing his condition, and calming his fears, whether it is bearing a son, or getting married. If one repulses the messenger or letter carrier in a dream, it means renouncing one's religion, or dropping one's profession, or it could mean innovation, or that he may be murdered. (Also see Book, Papers)"}, {"id": "letter-carrier", "label": "Letter carrier", "category": "Types of People", "meaning": "(See Mailman, Minaret, Ostrich)"}, {"id": "levying-taxes", "label": "Levying taxes", "category": "Action", "meaning": "(Well, Circumcision)"}, {"id": "liaison", "label": "Liaison", "category": "Action", "meaning": "(See Connections, Contract, Knot)"}, {"id": "libra", "label": "Libra", "category": "Celestial Bodies", "meaning": "(See Constellations, Moon)"}, {"id": "librarian", "label": "Librarian", "category": "Types of People", "meaning": "(Compiling literary works, Pastry chef, Sweets)"}, {"id": "lice", "label": "Lice", "category": "Animals", "meaning": "Lice in a dream mean worldly success and prosperity. If one finds lice in his shirt in a dream, it means receiving an endowment or renewal of a leadership position. In a dream, lice in one's shirt may also represent something one does not care for, to last. A shirt is made of a rag, or if it is tattered in the dream, it means indebtedness. Lice on the floor in a dream represent weak people. If they surround the person in his dream, it means that he mixes with such people. If he hates them in the dream, then they represent his enemies, though they cannot cause him any harm. If they bite him in the dream, then they represent people who slander him. If a louse flies away from one's chest in a dream, it means that one's son or an employee has run away from his house or place of business. If a large louse comes out of one's skin in a dream, it means losing one's life. A louse in a dream also represents a woman, a housekeeper, a son, an illness, an invading army, soldiers, depression, or distress. For a ruler or a policeman, lice represent his helpers. As for a teacher, lice in a dream represent his students, and for merchants, they represent his envious competition, while for a craftsperson or tradesman, they mean taxes. As for sick people, lice in a dream represent what seems to be a lasting illness. Cutting a louse in half in a dream means being good toward one's children. Eating a louse in a dream means backbiting someone. A colony of lice in a dream represents punishment. Lice in a dream also represent one's dependents or relatives who backbite, slander, and divide the family. An invasion of lice in a dream means blessings, wealth, relief from difficulties, dispelling all worries and sorrows. Killing a louse in a dream means the same in wakefulness. If one wakes up from a dream in which lice were attacking him, it means that he will not escape from depression, difficulties, or adversities. Picking up a louse from one's shirt or garment in a dream means hearing lies. If one becomes allergic to lice and starts itching in a dream, it means debts. Plant lice in a dream represent wrath, a calamity, or a punishment. (Also see Nit)"}, {"id": "lice-nest", "label": "Lice nest", "category": "Animals", "meaning": "(See Nit)"}, {"id": "lick", "label": "Lick", "category": "Action", "meaning": "Licking milk, water, honey, or a dash of anything in a dream denotes frugality, tight-handedness, or meager earnings. To dip one's finger in a plate of tasty food and lick it in a dream may denote a precious metal, a jewel, or a pendant. To lick up one's fingers or any element in a dream means money or benefits from the substance one is licking in their dream. (Also see Electuary)"}, {"id": "licking-a-bowl", "label": "Licking a bowl", "category": "Action", "meaning": "(See Lick, Wooden bowl)"}, {"id": "licking-an-inkwell", "label": "Licking an inkwell", "category": "Action", "meaning": "(Homosexuality, Inkwell, Lesbian, Sodomy)"}, {"id": "licking-honey", "label": "Licking honey", "category": "Action", "meaning": "(Love. See Electuary, Honey, Lick)"}, {"id": "lies", "label": "Lies", "category": "Other", "meaning": "(See Lying)"}, {"id": "lieutenant", "label": "Lieutenant", "category": "Types of People", "meaning": "(Military) In a dream, to see oneself as a lieutenant in the police or in the army means strength, respect, fame, commendation, or perhaps such a person may become a muezzin in a mosque. (Also see Policeman)"}, {"id": "life", "label": "Life", "category": "Other", "meaning": "(Bread, Clouds, Concealment, Rain, Soldiers, Vapor, Water)"}, {"id": "lift", "label": "Lift", "category": "Action", "meaning": "(See Car)"}, {"id": "light", "label": "Light", "category": "Other", "meaning": "(Beam, Gleam, Radiance, Shine) Light in a dream means guidance. Walking from a dark place into the light in a dream means receiving guidance, divine acceptance, and protection in this world and in the hereafter, and it represents richness after poverty, honour after humiliation, repentance following sin, sight after blindness and the opposite is also true should one see himself walking from light into darkness in a dream. Light in a dream also means Islam, or submission to God Almighty. Seeing light in a dream denotes good deeds, knowledge, the Holy Qur'an, or a righteous son. In a dream, light may also mean trials and tribulations. Wearing a raiment of light in a dream means receiving knowledge, or it could represent one's growing devotion. If one sees light beaming from his body in a dream, it means that he will be gifted with a son who will grow to be a man of great knowledge, spiritual rank, and whose prayers are accepted. Thus, whatever he asks, God Almighty will grant. Light in a dream also represents a messenger, knowledge, or it could mean accomplishing one's needs in the light. Light in a dream also represents the sun, the moon, the daylight, sunshine, moonlight, the crescent moon, or the Arabic proper name Shams. (Also see Earth, Lantern)"}, {"id": "light-heartedness", "label": "Light-heartedness", "category": "Feelings", "meaning": "(See Blithe)"}, {"id": "lighthouse", "label": "Lighthouse", "category": "Objects", "meaning": "(See Minaret)"}, {"id": "likeness", "label": "Likeness", "category": "Other", "meaning": "(See Correspondence)"}, {"id": "lily", "label": "Lily", "category": "Plants", "meaning": "(See Lily of the valley, Water lily)"}, {"id": "lily-of-the-valley", "label": "Lily of the valley", "category": "Plants", "meaning": "(Flower) In a dream, a lily of the valley denotes harm or a despised act. Receiving a lily flower in a dream means displaying bad conduct or showing a bad example. (Also see Hyacinth, Water lily)"}, {"id": "limbs", "label": "Limbs", "category": "Human Body", "meaning": "(Arm, Member) Limbs in a dream represent one's family. Seeing oneself dismembered in a dream means the dispersal of his family, or that one will cut off their blood ties, or it could mean undertaking a long journey and separating from one's family for a long time. (Also see Body, Tooth)"}, {"id": "lime", "label": "Lime", "category": "Plants", "meaning": "In a dream, a lime represents money and profits. (Also see Lemon)"}, {"id": "limekiln", "label": "Limekiln", "category": "Objects", "meaning": "(See Furnace)"}, {"id": "limping", "label": "Limping", "category": "Action", "meaning": "(Hitching, Jerking, Lameness) Limping in a dream means becoming incapacitated, or being unable to conclude a project one is pursuing. Limping in a dream also means acquiring knowledge, understanding one's religion, or growing in wisdom. Limping in a dream also means travel. If the limping is caused by one's right leg in the dream, it could mean that an illness will afflict one's son. If the limping has affected the left leg in the dream, it could mean that one's daughter will be engaged. If one has no children, or if he has no plans to travel, then limping in a dream means a warning to set back, slow down and to be careful about his next move. If one's leg is dislocated in a dream, it means that his wife may get sick. Limping in a dream also means longevity, knowledge, and religious understanding. Seeing a woman limping in a dream means receiving something deficient. The same goes if a woman sees someone limping or hopping on one foot in her dream. Limping in a dream also represents trickery, perfidy, or treason. (Also see Lameness)"}, {"id": "linen", "label": "Linen", "category": "Objects", "meaning": "(Clothing) Wearing a linen shirt in a dream means living an honourable life, earning lawful money, and saving. (Also see Clothing)"}, {"id": "linen-merchant", "label": "Linen merchant", "category": "Types of People", "meaning": "(Linen shop) A linen merchant in a dream represents trials with women, depression, distress, toiling, adversities, and humiliation."}, {"id": "linguist", "label": "Linguist", "category": "Types of People", "meaning": "(Blunder, Genealogist, Grammarian) In a dream, a linguist represents a blunder and foolish talk, or he could represent a translator, a guide, a road expert, a genealogist, emulating a good example, or he could represent a talkative person who does nothing about his habit, or one who does nothing about what he says. (Also see Blunder, Grammarian)"}, {"id": "link", "label": "Link", "category": "Objects", "meaning": "(Ring, Bond, Door knocker) In a dream, a link represents the religion of Islam. Holding onto the likes of a chain in a dream means steadfastness in one's religion. In general, a door knocker in a dream represents the door attendant, an announcer, a messenger, a warning post, or a guard dog. If the knocker is made of gold or silver in the dream, it means honour and prosperity for the people of the house. If one pulls off the door knocker, and if it breaks in the dream, it means that he follows a path of innovation."}, {"id": "lintel", "label": "Lintel", "category": "Objects", "meaning": "(See Doorstep)"}, {"id": "lion", "label": "Lion", "category": "Animals", "meaning": "(A tyrant, an unjust ruler, Death, Healing from a sickness, receiving an inheritance) A lioness in a dream represents ignorance, pride, affectation, and perfidy. Seeing a lion without being seen means escape from harm one may fear, attaining knowledge, and growing in wisdom. A struggle with a lion that does not lead to one's death in a dream means observing a long-lasting diet caused by an illness. If one fights with a lion and eats or snatches off a piece of his flesh, bones, or hair in a dream, it means that he will attain success, leadership, wealth, or conquer his enemy. Sleeping beside a lion in a dream means safety from illness or protection from one's enemy. If one sees a lion inside his own house in a dream, it means that he will gain the upper hand, or it could represent longevity and a high position in the world. A lion entering a town in a dream means a plague that will strike such a town. (Also see Lioness)"}, {"id": "lioncloth", "label": "Lioncloth", "category": "Objects", "meaning": "(See Blanket, Lion)"}, {"id": "lioness", "label": "Lioness", "category": "Animals", "meaning": "In a dream, a lioness represents an evil woman, or a despot who is also affectionate toward her cubs, or she could represent the daughter of a king or a ruler. Sleeping with a lioness in a dream means conquering one's enemy. Eating the flesh of a lioness in a dream means that one may become wealthy. (Also see Lion)"}, {"id": "lips", "label": "Lips", "category": "Human Body", "meaning": "In a dream, lips represent man's pride, strength, virility, his helper, clarity of expression, eloquence, or special love for one's friend. The lower lip has more advantages than the upper lip in a dream. The upper lip represents a close friend, or someone one depends on in everything. Anything that affects one's lips in a dream will manifest in any of the above. Lips in, a dream, also represents one's wife, child, or relatives. If one suffers pain in his lips in a dream, it means that such pain will come from one's friends. If one's lips are chopped off in a dream, it means that they engage in backbiting others. If only the lower lip is chopped off in the dream, it means that one may lose a helper or a provider. If the upper lip is missing in a dream, it means that one's life is void of blessings. If the lower lip is missing in the dream, then it represents a dying wife. If the upper lip is split in one's dream, it denotes double the effects concerning the person who is understood to be meant in the dream. If the lower lip is split or chapped in the dream, it means conducting a secret relationship with two women. If it is the upper lip, which means having two friends. His chapped lips heal in the dream, then it means reconciliation between two friends, or winning their consent regarding one's opinion or decision. If one's upper lip is cut off in a dream, it means severing a relationship with a close friend. Lips in a dream also denote relatives or kinship. Lips in a dream also mean recovering from an illness, or forcing a jealous friend to follow one's directives, or hearing good news that will heal one's heart. Lips in a dream also represent a door attendant, boys, guards, locks, knowledge, guidance, food, drinks, marriage, happiness, sadness, or keeping secrets. Having no lips in a dream means losing any of the above, or one's dream could mean a broken door, or losing one's keys, or perhaps it could mean the death of one's parents, husband, or wife. Lips in a dream also represent the livelihood of singers or musicians who play wind instruments for a living, or the livelihood of a glassblower. If one's lips look thin and rosy in a dream, they denote clarity of speech, guidance, good food, good drink, and happiness. Thick lips with black or blue colour in a dream represent laziness, languor, failure to present a verifiable proof or to bring a strong witness, or they could mean discomfort, or difficulty in earning one's livelihood. If a sick person sees his lips black or blue in a dream, it could mean his death. Closed lips in a dream represent one's eyelids, a vagina, the anus, the banks of a river, or a well. (Also see Body)"}, {"id": "listening", "label": "Listening", "category": "Action", "meaning": "In a dream, listening to the Qur'an, or to the teachings of God's Prophet, upon whom be peace, or to words of wisdom, or an admonition, or a discourse of knowledge in a dream means receiving guidance, and it means turning repentantly to God Almighty. Otherwise, if one sees himself listening to backbiting, slandering, defamation, or eavesdropping in a dream, then it means that some harm will befall him. Listening to good advice and following its best guidance in a dream means receiving good news. Eavesdropping in a dream means that one tends to defame the other person. Listening, though pretending not to hear what is being said in a dream, means that one makes it a habit to lie. The sound of a crowd in a dream means money, besides other benefits. The bleating of sheep in a dream means distress and fear. The neighing of horses in a dream means might and honour. The barking of a dog in a dream means vain talk and meddling in people's business. The sound of a lynx in a dream means pampering oneself, or wantonness. The cooing of pigeons in a dream means crying, sorrows, or marriage. The chirp of swallows in a dream means beneficial words. The croaking of frogs in a dream means beatings. The sound of bells and the hissing of snakes in a dream means a fight, an argument, a warning, or a war. The braying of donkeys in a dream means cursing in the darkness. The braying of mules in a dream means vain talk, or indulging in suspicious acts. The mooing of a cow in a dream means temptation. The gurgling of camels in a dream means travels and difficulties. The roaring of a lion in a dream means threats. The howling of a tomcat in a dream means uproar, backbiting, defamation, and insinuation. The yapping of foxes in a dream means a warning to escape, or to move from one field into another. The howling of a wolf in a dream means a robbery. The squeak of a mouse in a dream means profits, reunion, love, and peace. The crying of a female gazelle in a dream means longing for one's homeland. The barking of a jackal in a dream means a mission of good intent, or a forthcoming evil. (Also see Eavesdropping, Sound of animals, Speaking)"}, {"id": "litter", "label": "Litter", "category": "Objects", "meaning": "(arb. Mahmal. See Car, Palanquin, Stretcher)"}, {"id": "little", "label": "Little", "category": "Other", "meaning": "(Insufficient, Scarce) Having little of something after having an abundance of it in a dream represents unlawful earnings, or money earned from usury, or it could denote heavy financial obligations, or liabilities. However, having little of something in a dream also could signify having plenty of it. (Also see Famine)"}, {"id": "little-bear", "label": "Little Bear", "category": "Celestial Bodies", "meaning": "(See Constellations)"}, {"id": "little-boy", "label": "Little boy", "category": "Types of People", "meaning": "(See Child)"}, {"id": "little-girl", "label": "Little girl", "category": "Types of People", "meaning": "A little girl in a dream represents prosperity, wealth after poverty, and ease after a passing adversity. Seeing a baby girl of milk suckling age is even better in a dream. It means a new and praiseworthy development in one's life, or it could mean receiving benefits one is hoping for, or living in a new world. A little girl in a dream also represents something exclusive for the one who saw her in their dream. Carrying a little girl in a dream means release of a prisoner, or if one is suffering from difficulties, or if he is at fault in an argument, or if he is indebted or poor, it means that all of his worries will be dispelled by the glad tidings of this little girl. If none of these conditions apply, then it means distress or misfortune. If a mother delivers a sick baby girl in a dream, it means relief from her difficulties. If she gives birth to such a child from her mouth, then it means death. A little girl in a dream also means a new world, while a young girl in a dream implies getting a new job. If a woman sees a little girl in a dream, it means that she cannot conceive children. If one hires a little girl to work for him in a dream, it means that he will receive glad tidings. If he hires a little boy, then it means bad news. Carrying a little girl in a dream is better than carrying a little boy. If one carries a baby boy wrapped in a swaddle in a dream, it means imprisonment or a sickness. If one is poor, then it means that they will live to an old age in misery. If he is rich and diligent in the dream, it means that he will lose his money and reason. (Also see Child, Young woman)"}, {"id": "liver", "label": "Liver", "category": "Human Body", "meaning": "(See Body)"}, {"id": "liver-pain", "label": "Liver pain", "category": "Feelings", "meaning": "(Also see Body, Pain)"}, {"id": "lizard", "label": "Lizard", "category": "Animals", "meaning": "(Bewitch, Free, Gecko, Independent, Wall gecko, Witch) Seeing a lizard in a dream means greed, gluttony, or a difference in opinion and taste. A lizard in a dream also represents a person who swindles people's money. It also means a sickness, or it could represent a wicked, damned, and abhorred person, or a lonesome person. Perhaps seeing a lizard in a dream may mean suspicious or tainted money, someone of an unknown lineage, or a reincarnated or transformed person in the form of a lizard. Noting here that the transformation of the human being into another creature in reality represents a divine punishment, though it may not last for more than three days. God knows best. (Also see Wall gecko, Monitor, Transformation)"}, {"id": "load", "label": "Load", "category": "Objects", "meaning": "(See Cargo)"}, {"id": "loaf-of-bread", "label": "Loaf of bread", "category": "Food", "meaning": "(Money) In a dream, a loaf of bread represents little money, little earnings, or a small wage. (Also see Bread)"}, {"id": "loafer", "label": "Loafer", "category": "Types of People", "meaning": "(See Destitute)"}, {"id": "loan", "label": "Loan", "category": "Other", "meaning": "(Borrowing, Charity, Lending money) Loaning someone something in a dream represents a charity to be paid to the borrower, or that the lender will need something from the borrower. A loan in a dream also represents repentance of a sinner, or guidance for a heedless person. Lending someone money in a dream also means generosity and giving due preference to others' needs. Lending people money with generosity to please God Almighty in a dream means spending money on God's path. For a sick person, being under the constraint of debts in a dream signifies further health complications. If a sick person sees himself in a dream borrowing to pay his loans, it means his death. If a borrower finds that his lender has died in a dream, it means relief from his stress. Signing a loan in a dream means being put under court restraint. (Also see Borrowing, Charity, Lending money)"}, {"id": "loathsome", "label": "Loathsome", "category": "Feelings", "meaning": "(See Shameful act)"}, {"id": "lobster", "label": "Lobster", "category": "Animals", "meaning": "In a dream, a lobster represents a strong and perfidious person who is untouchable, difficult to deal with, and who is difficult to associate with, or who requires delicate handling. Eating lobster meat in a dream represents earnings from a distant land. Eating his meat may also mean earning unlawful money."}, {"id": "locality", "label": "Locality", "category": "Earth", "meaning": "(Also see Earth)"}, {"id": "lock", "label": "Lock", "category": "Objects", "meaning": "(Padlock) In a dream, a lock represents a trustworthy person or a virgin girl. Opening a padlock in a dream means escaping from jail or being released from prison. If one who is suffering from depression sees himself unlocking a padlock in a dream, it means that his sorrows or sadness will be dispelled. A lock in a dream also represents a proof, a strong point, or a tool. Unlocking a padlock in a dream also means divorce. Locking a door in a dream means seeking a consigner for a loan or a guarantor. If one who is seeking to get married sees a lock in his dream, it means that he will meet with a trustworthy and caring woman. A padlock for a traveller in a dream means safety. A metal lock in a dream means dignity, safety, piety, deciphering a language, symbols, or acquiring knowledge. Wooden locks in a dream represent a husband, children, knowledge, wisdom, ease in one's life, or guarding one's promise. Locks in a dream also mean heedlessness. A wooden lock means hypocrisy, or hesitation in one's words and actions, or it could mean accepting a bribe. (Also see Close, Padlock)"}, {"id": "locksmith", "label": "Locksmith", "category": "Types of People", "meaning": "A locksmith in a dream represents a broker. If he locks the door of his own house in the dream, it means that he arranges marriages or works as a wedding consultant. If he locks the door of his shop in a dream, it means that he brokers merchandise and businesses. Seeing a locksmith in a dream also means concealing a secret, or it could mean marriage."}, {"id": "locusts", "label": "Locusts", "category": "Animals", "meaning": "In a dream, locusts represent an adversity, a trial, a calamity, or a punishment. They also represent a destructive rain, or an occupation by a vehement army. Eating locusts in a dream means that one will receive money. If one fills up a cup or a pitcher with locusts in a dream, it also means earnings. Any place locusts fly into without causing harm in a dream means overcoming adversities. If a rich person who has lost his wealth sees a swarm of locusts falling all over him in a dream, it means that he will recuperate his wealth."}, {"id": "lodge", "label": "Lodge", "category": "Objects", "meaning": "(Cave, Den, Harbor, lodge, Refuge, Retreat, Sanctuary. See Inn, Hostel, Pub)"}, {"id": "log", "label": "Log", "category": "Objects", "meaning": "(Inactive, Latent, Languid) In a dream, a log represents a chronic illness or paralysis. As for a butcher or a shoemaker, a log in a dream represents money and profits. (Also see Firewood)"}, {"id": "loins", "label": "Loins", "category": "Human Body", "meaning": "(See Backbone, Body)"}, {"id": "loitering", "label": "Loitering", "category": "Action", "meaning": "(See Destitute)"}, {"id": "loneliness", "label": "Loneliness", "category": "Feelings", "meaning": "(Aloneness, Isolation, Solitude) Loneliness in a dream means fame, artistry, or attaining excellence in one's craft. If a ruler or a governor sees himself alone in a dream, it represents his impeachment from office. Finding oneself alone in a dream also means poverty or separation from one's beloved. Loneliness in a dream also means humiliation, infamy, or segregation."}, {"id": "longevity", "label": "Longevity", "category": "Other", "meaning": "(See Teeth)"}, {"id": "looking-at-a-sexual-organ", "label": "Looking at a sexual organ", "category": "Action", "meaning": "(Sexual organs, Vagina) Lustfully looking at the vagina of one's wife or that of another woman, or touching it in a dream, means engaging in a rotten business. Seeing a naked woman without her knowledge in a dream represents common pitfalls and mistakes one makes in his life."}, {"id": "looking-stern", "label": "Looking stern", "category": "Action", "meaning": "(See Scowling)"}, {"id": "loom", "label": "Loom", "category": "Objects", "meaning": "In a dream, a standing loom represents travels or business activities. A loom lying flat in a dream means inhibition, restraint, or seclusion. In a dream, a loom also means support or a gift for a needy person. It also means a high-ranking position or becoming a respected chairperson. If a woman sees another woman pushing her away from her loom to sit in her place in a dream, it means death."}, {"id": "losing-a-fight", "label": "Losing a fight", "category": "Action", "meaning": "(Defeat, Depression) Losing a fight in a dream means joy. Losing a fight in a dream also could mean vanquishing one's enemy if they are compatible. Otherwise, the winner of a fight in a dream denotes the loser in wakefulness. (Also see Defeat)"}, {"id": "losing-sight", "label": "Losing sight", "category": "Action", "meaning": "(Blindness) If one sees in his dream as though the world is destroyed and that he remains alone therein, it means that he may lose his sight."}, {"id": "loss", "label": "Loss", "category": "Other", "meaning": "(Business) If one's losses relate to his earnings, then his losses in the dream mean decadence of one's principles, religious downswing, or they could mean heedlessness after guidance, disbelief after following one's religion, or losses in general. This sin is man's own. If one suffers a loss in a dream, it means dismay, horror, a scare, a shock, or a menace. Complaining about a harm one suffers, a damage, or a loss in a dream means attaining one's goal. (Also see Penny)"}, {"id": "loss-of-tracks", "label": "Loss of tracks", "category": "Action", "meaning": "(See Disappearing)"}, {"id": "lost", "label": "Lost", "category": "Other", "meaning": "(Getting lost) If a man of knowledge sees himself lost in a dream, it means that he will benefit people with his knowledge, that his teachings will spread widely, and that he will be remembered for a long time after he dies. Getting lost in a dream also means bad luck. If one loses a garment or a house in a dream, it means extra expenses, repairs, or taxes he will pay for his property. If one is stripped of his entire wardrobe in a dream, it means that he will avoid an evil and costly incident. (Also see Wandering)"}, {"id": "lost-object", "label": "Lost object", "category": "Objects", "meaning": "(See Compensation, Finding something)"}, {"id": "lot-tree", "label": "Lot tree", "category": "Trees", "meaning": "(Heavens, Highest goal, Ultimate results) Seeing the heavenly Lot tree in a dream means attaining one's highest goal and reaching the ultimate promise. (Also see Buckthorn, Lotus tree)"}, {"id": "lot-first-meaning", "label": "Lot-first-meaning", "category": "Other", "meaning": "(God's prophet Lot, Nephew of God's prophet and bosom friend Abraham, upon both of them be peace) Seeing the prophet Lot in a dream means distress and trouble caused by one's people and wife, or perhaps it could mean victory over one's enemy and witnessing God's wrath toward them. Seeing the prophet Lot in a dream also denotes obliteration of a nation, effacement, earthquake, and destruction if the people who displease their Lord and follow the conduct of the dwellers of the two cities of Sodom and Gomorrah. Seeing the prophet Lot's wife in a dream means that one's wife will rebel against him and strive to destroy his life, and perhaps she will also be destroyed during that process. If everyone sees Lot's wife in a dream, it means that evil will spread among the women of that land. Seeing the prophet Lot, upon whom be peace, in a dream also denotes a warning against sodomy, and it means that one's wife is a corrupt woman."}, {"id": "lot-second-meaning", "label": "Lot-second-meaning", "category": "Other", "meaning": "(Batch, Clump, Cluster) In a dream, a lot or a cluster represents atonement for one's sins, or something offered to compensate for failing to fulfill a vow, or it could mean earning tainted money."}, {"id": "lotus-tree", "label": "Lotus tree", "category": "Trees", "meaning": "(Lotus, Jujube tree) In a dream, a lotus tree means money and profits. Eating from its fruit in a dream means having a good spirit and a praiseworthy religious standing, or if one qualifies for leadership, it means that he will attain it. In a dream, a lotus tree is also a noble tree. As for religious people, seeing a lotus tree in a dream means spiritual growth, and for a ruler, it means gaining power. (Also see Jujube tree)"}, {"id": "loud", "label": "Loud", "category": "Other", "meaning": "(See Spell out)"}, {"id": "loud-speaker", "label": "Loud speaker", "category": "Objects", "meaning": "(See Tap)"}, {"id": "louse", "label": "Louse", "category": "Animals", "meaning": "(See Nit)"}, {"id": "love", "label": "Love", "category": "Feelings", "meaning": "(Beloved, Enamoured, Honey, Hostage, Lover, Platonic love) Love in a dream means trials and temptations. If one does something he loves in a dream, it means that he will engage in an act that has no limitations. If a man says to a woman, \"I love you,\" in a dream, it means that he truly hates her. If one sees himself indulging and satisfying every desire he has and without feeling any restrictions in the dream, it means that he will stray from God's path and live a corrupt life. Love in a dream also means distress, worries, and sorrow. Love in a dream also represents one's ability to express something. Otherwise, it could mean that he keeps to himself. Love in a dream also means trials and fame that incurs people's compassion for the person in love. Love in a dream also means poverty, sickness, and death. Death in a dream also could mean love, or living distant from one's beloved, or life after death. To burn in the fire in a dream also means love. To enter paradise in a dream also means love, and to enter hell-fire in a dream means separation from one's beloved. Yearning for one's beloved in a dream means heedlessness, and love in a dream also indicates corruption in one's religious life, or loss of money. To love someone in God in a dream means mercy between people. Otherwise, to love one another for personal interests in a dream means a partnership that will end in betrayal, or it could mean a marriage without family consent. Pretending to be in love in one's dream means straying from God's path. If a knowledgeable person or a scholar pretends to be enamoured in a dream, it means that he will deceive people with his ornate presentations and contradict their standards. (Also see Enamoured, Honey, Lick, Pretending)"}, {"id": "love-for-the-world", "label": "Love for the world", "category": "Feelings", "meaning": "(See Elephant Man, Love)"}, {"id": "love-poems", "label": "Love poems", "category": "Other", "meaning": "(See Courting, Poet)"}, {"id": "love-seat", "label": "Love seat", "category": "Objects", "meaning": "(See Couch)"}, {"id": "lover-of-boys", "label": "Lover of boys", "category": "Types of People", "meaning": "(See Pederasty)"}, {"id": "lowland", "label": "Lowland", "category": "Earth", "meaning": "(Basin, Cavity, Depression) Walking through a lowland in a dream means suffering from adverse conditions, or it could mean depression, and hoping to reach a time of recovery."}, {"id": "lubrication", "label": "Lubrication", "category": "Objects", "meaning": "(Fat, Oil) A motor lubricator in a dream represents knowledge, guidance, serving the people of knowledge, or being close to people in authority. (Also see Grease)"}, {"id": "luck", "label": "Luck", "category": "Other", "meaning": "(Dwellings)"}, {"id": "lumber", "label": "Lumber", "category": "Objects", "meaning": "(Hypocrisy) In a dream, lumber represents a person who mixes with hypocrites, or one who mixes goodness and hypocrisy in his life, or one who appears better than he is in reality. Damp lumber represents boys. If a traveller on a boat sees lumber in his dream, it represents the boat he is traveling on."}, {"id": "lumber-merchant", "label": "Lumber merchant", "category": "Types of People", "meaning": "(Wood) In a dream, a lumber merchant represents the chief of hypocrites. One's dream could also mean building homes and roads."}, {"id": "lumberman's-saw", "label": "Lumberman's saw", "category": "Objects", "meaning": "(See Saw)"}, {"id": "luminary", "label": "Luminary", "category": "Celestial Bodies", "meaning": "(See Fame)"}, {"id": "lunar-eclipse", "label": "Lunar eclipse", "category": "Celestial Bodies", "meaning": "(See Eclipse)"}, {"id": "lunar-months", "label": "Lunar months", "category": "Months", "meaning": "(See Arabic months)"}, {"id": "lunatics", "label": "Lunatics", "category": "Types of People", "meaning": "(See Mental hospital)"}, {"id": "lunch", "label": "Lunch", "category": "Food", "meaning": "Having lunch in a dream means taking a brake out of exhaustion from one's work. (Also see Invitation)"}, {"id": "lung-pain", "label": "Lung pain", "category": "Feelings", "meaning": "(See Body, Lungs, Pain)"}, {"id": "lungs", "label": "Lungs", "category": "Human Body", "meaning": "(Anger, Pulmonary, Soul, Woman) In a dream, lungs represent the abode of the soul. Damaged or decaying lungs in a dream represent the nearing of one's death. If one sees his lungs turned black in a dream, it means cessation of his business or source of his livelihood. Healthy lungs in a dream represent longevity. Lungs in a dream also represent one's wife, anger, or one's composure. (Also see Body)"}, {"id": "lupine", "label": "Lupine", "category": "Plants", "meaning": "(bot.) A green lupine plant in a dream represents poverty and struggle to earn one's livelihood, or it could mean knowledge without action. Boiled lupine beans in a dream represent medicine or fast earnings."}, {"id": "lure", "label": "Lure", "category": "Objects", "meaning": "(Entice, Incite, Induce, Lure, Urge)"}, {"id": "lust", "label": "Lust", "category": "Feelings", "meaning": "(See Dog)"}, {"id": "lute", "label": "Lute", "category": "Objects", "meaning": "(See Musician, Singing, String instruments)"}, {"id": "luxuries-shop", "label": "Luxuries shop", "category": "Objects", "meaning": "(Amenity, Extravagance) A luxury salesman in a dream means enriching oneself at people's expense. A luxury shop owner in a dream means enslaving others, or he could represent a cattle merchant, or celebrating happy or sad anniversaries."}, {"id": "lying", "label": "Lying", "category": "Action", "meaning": "(Blunder, Lies, Tell a lie) Lying in a dream means giving false testimony in court, fabricating a lie, slandering someone, or it could mean constant failure in one's life. Lying in a dream also means talking nonsense, or letting one's imagination do the talking, or spreading a sharp idea. If someone hears that in a dream, and if he spreads the word, then the negative effects of his doing will bring more harm than good. If one sees himself lying to God Almighty in a dream, it means that he has no brain. (Also see Blunder)"}, {"id": "lynx", "label": "Lynx", "category": "Animals", "meaning": "(Cheetah, Panther) Lynx, a cheetah, or a panther in a dream represents might, exaltation, cuddling, and coquetry, along with anger, rage, and enmity. A lynx in a dream also represents an enemy who does not show either his enmity or friendliness. Fighting with a lynx in a dream means fighting with someone with such qualities and character. Using a lynx to hunt with in a dream means prosperity and might."}]