[{"id": "oak", "label": "Oak", "category": "Other", "meaning": "An oak in a dream represents a difficult person who loves to hoard money, or it could represent a great shaikh, or a rich person. (Also see Oak tree, Tree)"}, {"id": "oak-tree", "label": "Oak tree", "category": "Trees", "meaning": "(Evergreen) An oak tree in a dream represents profits, prosperity, honour, or associating with heedless people who live in the mountains, or perhaps it could mean visiting righteous people, ascetics, and renunciates who live in the wilderness or uninhabited ruins. An oak tree in a dream may also mean homosexuality or sodomy. An evergreen tree in a dream represents the element of longevity and strength, but it could also imply slavery because of its needles. (Also see Oak, Tree)"}, {"id": "oars", "label": "Oars", "category": "Objects", "meaning": "(Paddles) Oars in a dream represent the movement of a ship, or they could mean having a secret affair. Oars in a dream also mean reaching safety, or finding a helping friend. (Also see Boat, Ship)"}, {"id": "oatmeal", "label": "Oatmeal", "category": "Other", "meaning": "(See Breakfast food)"}, {"id": "obituarist", "label": "Obituarist", "category": "Types of People", "meaning": "(See Piper)"}, {"id": "oboe", "label": "Oboe", "category": "Objects", "meaning": "(Flute, Musical instruments, Wind instruments) In a dream, an oboe means amusement, distractions, entertainment, pleasures, celebrations, weddings, enticing rebellion, or corruption. If one receives an oboe as a gift from a governor in a dream, it means that he will preside over an administration. Placing one's fingers over the holes of an oboe in a dream means learning, memorizing, and understanding the Qur'anic revelations. Playing the oboe in a dream also means having a beautiful voice and good diction. Carrying a golden oboe in a dream represents a wise man. If a sick person sees or holds an oboe in his dream, it means his death. If a backbiter holds an oboe in his dream, it means slander, and if one who desires to have a son sees himself carrying an oboe in a dream, it means that he will beget a son. (Also see Flute)"}, {"id": "obscurity", "label": "Obscurity", "category": "Mood", "meaning": "(See Darkness, Fog)"}, {"id": "obsequious", "label": "Obsequious", "category": "Mood", "meaning": "(See Dog)"}, {"id": "observatory", "label": "Observatory", "category": "Objects", "meaning": "(See Watchtower)"}, {"id": "obstinacy", "label": "Obstinacy", "category": "Mood", "meaning": "(Obtrusive, Stubbornness) Obstinacy in a dream means witnessing or committing evil in wakefulness. To be obstinate, demanding, and persistent in a dream also means running away from something, or turning one's back to a fight, a dispute, an argument, or a business. Obstinacy in a dream may also denote a presumptuous and arrogant person who is disliked by people. Being obtrusive and obstinate in a dream also may mean being exasperated or annoyed about something, or that people dislike being in his company and have serious reservations about him. (Also see Obtrusive person)"}, {"id": "obstinate-person", "label": "Obstinate person", "category": "Mood", "meaning": "(See Donkey, Darkness, Obtrusive person)"}, {"id": "obtrude", "label": "Obtrude", "category": "Action", "meaning": "(See Darkness, Obtrusive person)"}, {"id": "obtrusive-person", "label": "Obtrusive person", "category": "Other", "meaning": "(Demanding person, Ignorant person, Obstinate) It is common among people of knowledge to describe an obtrusive person as a stone. (Also see Darkness, Obstinacy)"}, {"id": "obviating", "label": "Obviating", "category": "Action", "meaning": "(See Cauterize)"}, {"id": "occultist", "label": "Occultist", "category": "Types of People", "meaning": "(See Ophthalmologist)"}, {"id": "occupied", "label": "Occupied", "category": "Mood", "meaning": "(See Busy)"}, {"id": "ocean", "label": "Ocean", "category": "Water", "meaning": "(Government) The element of the ocean in a dream represents a prison where sea creatures are incarcerated, and it means losses, fear, despair, limitless knowledge, a city without walls, or the world, its trials and wonders. An ocean or a sea in a dream also represents a strong ruler who is just, compassionate toward his subjects, and whom people revere, have access to, and seek for their daily needs. If a businessman sees an ocean in a dream, it represents his merchandise. As for a worker or an apprentice, the ocean in a dream represents his veteran teacher or master. If one sees the ocean in a dream, it means that they will succeed in their goals. If one sees himself entering the ocean or sea in a dream, it means that he will enter before a ruler, or stand before someone in authority. If one sees himself sitting or lounging at the sea shore in a dream, it means that he will work for such a person or a ruler, though he will be observing caution and diplomacy with him. If one sees himself drinking the entire water of the sea, though no one sees him except the king in a dream, it means that he will reign and live a long life. Drinking any portion thereof also means equal earnings to what he takes in. If one sees himself drinking from it to quench his thirst in the dream, it means riches, strength, and longevity. If one sees himself asking for some of its water to drink in a dream, it means that he is seeking to work for such a strong person or ruler. If he pours water into a pitcher in the dream, it means prosperity, or that he will receive a bounteous gift from God Almighty to encompass a high rank as well as riches. However, his status will last longer than his money. To drink water from the sea in a dream means acquiring knowledge and adopting proper conduct. Crossing the ocean in a dream means booty. If one sees strong waves bringing seawater to his street without causing damage in a dream, it means that a ruler or a great person will enter or visit that locality. Bathing in seawater in a dream means repentance from one's sins. Seeing the ocean from a distance in a dream means that calamities, temptations, and trials are coming to one's community. If one sees the sea receding, whereby he can see the edges of the earth it covers in a dream, it means diminishing of his authority and control, or that the wrath of God Almighty has descended upon that locality. This calamity could be caused by one's government, economic tribulations, drought, or one's enemies. Standing over seawater in a dream means attaining something one did not seek. Walking in the air, the seawater in a dream represents the person's good intentions, his clarity, faith, and certitude. If a sick person sees himself taking ablution in seawater in a dream, it means that he will recover from his illness, or it could mean payment of one's debts and relief from worldly pressures. (Also see Water)"}, {"id": "october", "label": "October", "category": "Months", "meaning": "(See Earthquake, Thunder)"}, {"id": "odor", "label": "Odor", "category": "Other", "meaning": "Smelling a bad odour in a dream means hearing bad words, or it could mean distress. Smelling an odour that emanates from under the armpit in a dream means headache, nasal congestion, cold, or hearing bad news, divulging secrets, dispelling rancour and jealousy, or it could mean relaxing after an exhausting workday, contracting an eye disease, or it could mean loathsome. If a child smells such an odour from under his armpit in his dream, it means that he has reached puberty, or it could mean an illness or an accident that could take away his life. (Also see Cloud of smoke, Perspiration, Smell)"}, {"id": "offensive-odour", "label": "Offensive odour", "category": "Other", "meaning": "(See Odor, Perspiration)"}, {"id": "offering", "label": "Offering", "category": "Action", "meaning": "(Immolation, Sacrifice, Vow) In a dream, an offering represents the wife who is the delight of her husband, or the child who is the delight of his father. An offering in a dream also represents one's good deeds, although it also could mean trouble, adversities, enmity, dispute, fight, argument with one's family, an invasion, or profits from hunting. (Also see Immolation, Sacrifice)"}, {"id": "office", "label": "Office", "category": "Objects", "meaning": "(Employment) In a dream, an office means attaining a leadership position, or it could mean degradation, contemptible position, parsimony, living under tight circumstances, poverty, worrying about one's children, and fear for one's future."}, {"id": "officer", "label": "Officer", "category": "Types of People", "meaning": "(See Exhibition)"}, {"id": "officiant", "label": "Officiant", "category": "Types of People", "meaning": "(Wedding) An officiant in a dream means a wedding, a divorce, or he could represent a pimp, depending on the mental condition, or the type of work one who is seeing the dream performs. (See Saddler)"}, {"id": "offspring", "label": "Offspring", "category": "Other", "meaning": "(See Backbone)"}, {"id": "oil-mill", "label": "Oil mill", "category": "Objects", "meaning": "(See Oil press)"}, {"id": "oil-press", "label": "Oil press", "category": "Objects", "meaning": "(Oil mill, Oil refinery, Refinery) In a dream, an oil press represents spiritual guidance, knowledge, a foster mother, or a wet nurse. (Also see Sugar mill)"}, {"id": "oil-refinery", "label": "Oil refinery", "category": "Objects", "meaning": "(See Oil press)"}, {"id": "oil-first-meaning", "label": "Oil-first-meaning", "category": "Other", "meaning": "(Food) Anointing oneself with oil in a dream means receiving blessed and lawful earnings, or it could mean recovering from an illness. Drinking oil in a dream has a bad connotation and implies a bad omen, an evil spell, or an illness. However, olive oil in a dream also represents knowledge, wisdom, spiritual guidance, inner light, blessings, and lawful earnings. Drinking any other type of oil in a dream, such as oil from rape seeds of the crucifer family tree (Brassica napus), or cashew oil from the terebinth tree (Pistacia terebinthus), then it represents earning money from a suspicious source, or receiving illegal money. Oil in a dream also represents the light of the heart, spiritual growth, a growing insight, or it may denote birth control, murders, assassinations, or breaking someone's bones. Oil in a dream also denotes a broker. If good oil turns putrid or stale in a dream, it means revoking one's covenant, while if a putrid or a stale oil turns good in a dream, it means growing awareness, certitude, and adopting a good standard in dealing with others. (Also see Extracting oils from seeds, Olives)"}, {"id": "oil-second-meaning", "label": "Oil-second-meaning", "category": "Other", "meaning": "(See Amber, Musk, Perfume)"}, {"id": "ointment", "label": "Ointment", "category": "Objects", "meaning": "(See Electuary)"}, {"id": "old-man", "label": "Old man", "category": "Other", "meaning": "(See Elderly person)"}, {"id": "old-woman", "label": "Old woman", "category": "Other", "meaning": "In a dream, an old woman represents the ending of one's life in this world, sorrows, the hereafter, wine, or bearing children after having lost hope in fertility. An old woman in a dream also could represent deceit, cunningness, duplicity, backbiting, or slander. Seeing an old and sick woman in a dream may mean impotence, weakness, or disability. Seeing a thirsty old woman in a dream means drought. If she turns a young girl in the dream, then she represents rain. If an unknown old woman visits a sick person in a dream, it means his death. Otherwise, if an unknown old woman visits a pregnant woman in a dream, it means the glad tidings of a son. If one is engaged in an important project and sees himself sleeping with an old woman in a dream, it means that his project will not succeed. An old woman in a dream also represents non-arable land. If one sees her wearing a veil in a dream, it means that they will meet with hardships and regret. If one sees an ugly old woman, or a hag in a dream, it means adversities and war. If a young woman sees herself as an old woman in a dream, it means earning respect and dignity. An unknown old woman in a dream also represents a bad crop for that year. If one sees an old woman descending from the skies and people are wondering about her, she represents the passing year. Seeing an ugly old woman in a dream also could mean glad tidings of an ending war, or the end of drought. An emaciated old woman in a dream represents a year of drought. If she gains weight and turns beautiful in the dream, she represents changes in the weather conditions, bringing a prosperous and happy end for the farmers in that year. An ostentatious old woman in a dream represents a prosperous life, or good news that will arrive shortly. If she looks frowning or unhappy in the dream, then she represents distress and loss of prestige. If she looks ugly in the dream, she represents facing adverse conditions. If she is naked in the dream, she represents a scandal. If an old woman enters a house in a dream, it means prosperity and business success, and if she leaves a house in the dream, it means the opposite. An unknown old woman in a dream has a stronger connotation than a known old woman. If one sees himself frequenting an old woman in a dream, his dream denotes his attachment to worldly gains. If an old woman who passed her menopause sees herself in a dream experiencing her menstrual period again and regaining her sexual drive, and if she sees herself engaged in sexual intercourse in the dream, it means that she will become religious and have strong material and spiritual success in her life if her sexual intercourse in the dream is marital intercourse and of a lawful nature. Otherwise, if it is unlawful, then it represents her attachment to worldly gains and neglects her spiritual values. If a young woman sees herself as an old woman in a dream, it means that she will prosper and have a successful marital life."}, {"id": "olfaction", "label": "Olfaction", "category": "Human Body", "meaning": "(See Body, Smelling)"}, {"id": "olive-tree", "label": "Olive tree", "category": "Trees", "meaning": "(See Oil, Olives)"}, {"id": "olives", "label": "Olives", "category": "Food", "meaning": "(Blessed tree) In a dream, olives represent money, pleasures, or one's prosperity. An olive tree in a dream represents a blessed man who benefits his family, a chaste woman, or it could mean a son who may become a governor. A yellow olive in a dream represents heavy concerns about one's religious life. If one presses olives for oil in a dream, it means that he will earn blessings and benefits. If one sees himself watering an olive tree with olive oil in a dream, it means that he sleeps with his mother. The same interpretation applies if one sees himself watering a garden with vinegar. If one buys an olive tree, or eats from one, or drinks from its oil in a dream, it means blessings, or that he will marry a noble and chaste woman. Seeing the leaves of an olive tree in a dream means following the straight path, or fulfilling one's spiritual obligations, guidance, light, reciting the Qur'an, comforting someone's heart, making money for a poor person, except if one eats the olive raw in the dream, then it means the opposite, or it implies poverty, indebtedness, or it could denote the place, or the direction it comes from. The leaves of an olive tree represent righteous people or spiritual leaders. The fruit of an olive tree represents easy money or living a rich and happy life. Selecting olives or pressing them for oil in a dream means toiling or hardships. As for a sick person, olives in a dream mean regaining strength and recovering from his illness. The fruit itself and the leaves also denote assiduousness and resoluteness, however, olives in a dream also denote slow growing. (Also see Oil)"}, {"id": "omar", "label": "Omar", "category": "Other", "meaning": "(The commander of the believers, Omar bin Al-Khattab, may God be pleased with him.) Seeing him in a dream means longevity, trustworthiness, and praiseworthy deeds. One who sees him in a dream will speak the truth, be just, and call people to the straight path. He also may be able to attend to the Sacred House in Mecca in an auxiliary pilgrimage ('Umrah). If one shakes hands with Omar bin Al-Khattab in a dream, it means that he will prosper and live a pious life, and he will be a vigilant and a strong believer, the value of whose deeds will surpass his fame. If one sees him frowning in a dream, it means that Omar is calling for justice, commanding what is good and forbidding what is evil. If there is a drought in a town and one sees Omar in a dream, it means that rain will fall and be a blessing for that land. If there is tyranny in that land and one sees Omar in his dream, it means that justice will prevail. If Omar hits someone with a stick, or warns him, or threatens him in a dream, it means that one must renounce the course of his current actions or deviation from God's path, or perhaps that someone in authority or a scholar will persecute him. If one sees himself being Omar in a dream, or if he wears one of his garments in a dream, it means that he will be awarded honour, a dignified status, or die as a martyr. If one sees Omar smiling in a dream, it means that he follows the correct precepts of God's Messenger, upon whom be peace, and emulates his practices. Seeing him in a dream also means that justice and truth will prevail in his time, or that he is a trustworthy person, or that the propagation of truth is prominent in his time. Seeing him in a dream also could mean signing a peace treaty with one's enemy, annihilating hatred with love, good luck with one's in-laws, renouncing one's attachment to worldly things, though being capable of winning it, or presiding over people with justice, love, and compassion."}, {"id": "omayyad-mosque", "label": "Omayyad mosque", "category": "Earth", "meaning": "(See Masjid)"}, {"id": "ombrograph", "label": "Ombrograph", "category": "Objects", "meaning": "(See Water level)"}, {"id": "ombrometer", "label": "Ombrometer", "category": "Objects", "meaning": "(See Water level)"}, {"id": "omelette", "label": "Omelette", "category": "Food", "meaning": "(Eggs) An omelette in a dream means prosperity, joy, celebrations, profits, or marriage. (Also see Eggs)"}, {"id": "ominous", "label": "Ominous", "category": "Mood", "meaning": "(Threatening, See Scowling)"}, {"id": "omit", "label": "Omit", "category": "Action", "meaning": "(Forget) Omitting something in a dream means worries, trouble, misplacing things, or heedlessness."}, {"id": "one-eyed", "label": "One-eyed", "category": "Human Body", "meaning": "(Blind in one eye) If one loses one of his eyes in a dream, it means that he may lose half of his wealth, or divorce his wife, or fail to attend to his religious obligations, or commit a major sin, or it could mean that he has wasted half of his life in vain. To be blind in one eye in a dream also could mean expecting something and hoping for its arrival, or it could mean loss of a brother or a son. If a humble and hard-working person sees that, it testifies to the truth of his faith. If an impious person, or a corrupt person, or an impostor sees that dream, it means distress, a sickness that could bring him near his death, or to lose one hand in an accident, or to lose one's wife, or sister, or partner, or loss of blessings, or becoming sacrilegious and profane. (Also see Antichrist)"}, {"id": "onion", "label": "Onion", "category": "Food", "meaning": "Eating a raw onion in a dream denotes an evil happening. If a sick person eats a small amount of onions in a dream, it means that he will die from his illness, but if one sees himself eating a large quantity in his dream, it means that he will be cured of his illness. However, eating a green onion, or a scallion, in a dream, means prosperity and good health, though they will be accompanied by stress, sadness, or separation from one's wife. Eating a strong-smelling or a fragrant herb in a dream means contempt, loathing on the part of some members of his family toward him, or it could mean that hidden matters will finally surface. If such herbs are the type of bulbs that require skinning before eating, then they denote curiosity and eavesdropping, representing what is usually discarded. In a dream, onions for a businessman represent the element of money, and for a traveller, they represent health, success, and a safe return. Onions in a dream also mean distress and difficulties. Gathering onions in the field in a dream means suffering from harm caused by one's own family."}, {"id": "open", "label": "Open", "category": "Other", "meaning": "(See Unlock)"}, {"id": "opening", "label": "Opening", "category": "Action", "meaning": "(See Window)"}, {"id": "ophthalmia", "label": "Ophthalmia", "category": "Human Body", "meaning": "(See Eye inflammation)"}, {"id": "ophthalmologist", "label": "Ophthalmologist", "category": "Types of People", "meaning": "(Eye doctor, Occultist) In a dream, an ophthalmologist represents a spiritual guide who brings people out of darkness into light and who brings peace and unity between beloveds. An ophthalmologist in a dream also represents a teacher who entices people to seek knowledge, to reflect in advance about the consequences of their actions, and to develop a sharp sight. An ophthalmologist in a dream also could represent a pearl diver, an ocean diver, one who digs wells or restores old springs, or an eye expert who can tell the difference between false eyes from the true ones. An ophthalmologist in a dream also represents a preacher or a counsellor who can show the difference between the path of righteous people and the path of the heedless ones. An ophthalmologist in a dream may also represent someone who has something to say or news to report."}, {"id": "opium", "label": "Opium", "category": "Other", "meaning": "(See Intoxicants)"}, {"id": "opponent", "label": "Opponent", "category": "Types of People", "meaning": "(Adversary, Contrast, Opposite) If one's opponent is a dead person in a dream, then the good luck goes to the living in wakefulness. If the opponent is alive, then the better luck goes to the departed person. Opposition in a dream brings forth the better of the two in wakefulness. (Also see Orbit)"}, {"id": "opposite", "label": "Opposite", "category": "Other", "meaning": "(See Opponent)"}, {"id": "opposition", "label": "Opposition", "category": "Feelings", "meaning": "(See Opponent)"}, {"id": "oppression", "label": "Oppression", "category": "Feelings", "meaning": "If one sees people oppressing one another in a dream, it means that a tyrant or an unjust ruler will seize their land. Oppression in a dream is also interpreted as guidance, and guidance in a dream is interpreted as oppression. (Also see Injustice, Terrorization)"}, {"id": "orange", "label": "Orange", "category": "Food", "meaning": "(See Colour, Safflower, Yellow)"}, {"id": "orange-blossom-water", "label": "Orange-blossom water", "category": "Drinks", "meaning": "(See Distilled water)"}, {"id": "orbit", "label": "Orbit", "category": "Celestial Bodies", "meaning": "(Sun or moon orbits) In a dream, these two orbits may represent encircling one's opponents, surrounding the path of debtors, a sign of a major meeting of leaders, adversities, or despise. The circle itself represents the noble and just people. (Also see Opponent)"}, {"id": "organize", "label": "Organize", "category": "Action", "meaning": "(Adjust, Arrange, Institute) Organizing things in a dream means knowledge, or earning and saving lawful money."}, {"id": "orgasm", "label": "Orgasm", "category": "Other", "meaning": "(See Pleasure, Sexual intercourse)"}, {"id": "oriole", "label": "Oriole", "category": "Animals", "meaning": "(zool.) In a dream, an oriole represents doubt, wonderment, subsiding, concealment, trusting, confiding, associating with people in authority, or fear of one's enemy."}, {"id": "orion", "label": "Orion", "category": "Celestial Bodies", "meaning": "(See Constellations)"}, {"id": "ornaments", "label": "Ornaments", "category": "Objects", "meaning": "(Decoration) In a dream, ornaments are a sign of poverty. If one sees the world decorated for him and he can ask for whatever he wishes from it in a dream, it means that he will become poor, or that he may face destruction. As for unusual ornaments that are not recognizable, or decorated lands one does not recognize, then ornaments are a good sign, and the same goes for wearing customary or traditional ornaments one is used to adorn oneself with. (Also see Earrings, Gem, Gold, Necklace)"}, {"id": "orphan", "label": "Orphan", "category": "Other", "meaning": "(Foundling, Waif) Picking up an abandoned infant in a dream means picking up one's enemy, in conjunction with the story of Moses and Pharaoh. Picking up an abandoned child in a dream also could mean returning things to the way they should be, or dispelling distress and sorrow. If one sees himself planting an apple tree in a dream, it means adopting an orphan, or caring for one. To find oneself as an orphan in a dream means depression, which is caused by injustice. To be an orphan in a dream also means feeling depressed because of one's love for a woman, loss of property, or money."}, {"id": "orthopaedist", "label": "Orthopaedist", "category": "Types of People", "meaning": "(Bonesetter) An orthopaedist who corrects skeletal deformities and sets broken bones in a dream represents a pious governor who governs with justice, teaches righteousness, balances substances, and conforms to equanimity. Seeing an orthopaedist in a dream also means presumptuousness, might, and audacity. He also represents officiousness, adroitness, and resoluteness, for he discards the deficient and brings together what is broken. Seeing an orthopaedist in a dream also means distress and trouble. He also represents an architect, and an architect represents an orthopaedist in a dream. Thus, seeing him in a dream also means construction and could represent a generous person who comforts, accommodates, and helps a needy person, or a wise man who comforts the broken hearts, a just judge, a great scholar, a shoe repairman, or a tailor. If one sees himself standing before an orthopaedist in a dream because of a broken bone or another fracture and then complains about an abscess in his neck, and if the orthopaedist opens that abscess with pliers to drain the puss in the dream, then it represents a debt one has to repay, or a votive offering one has to fulfill, or it could mean giving a testimony in court, or accepting the ruling of a scholar. If an orthopaedist sets one's broken right arm and ties it to his neck in a dream, it means that someone will oblige him to do him a personal favour and consequently deprive him of attending to other duties, or restrain him from serving other charities. The same interpretation is given for a broken leg."}, {"id": "oryx", "label": "Oryx", "category": "Animals", "meaning": "(Antelope, Gemsbok, Wild cow, Wild gazelle, Wild goat) In a dream, all kinds of genus oryx of the world, large African and Asian antelopes with long and straight horns, represent a great leader, a pious and reclusive person, though he does not follow the prophetic traditions, or he could be an ascetic, or an innovator. If one finds the eyeball of an oryx in a dream, it means that he will marry a chaste and beautiful woman whose life will be short. If one's head becomes that of an oryx in a dream, it means prosperity, or that he will receive an appointment to a leadership position. (Also see Buffalo, Mountain goat)"}, {"id": "oscillator", "label": "Oscillator", "category": "Objects", "meaning": "(See Fan)"}, {"id": "osprey", "label": "Osprey", "category": "Animals", "meaning": "(Angel of death, Bone-breaker, Eagle) In a dream, an osprey represents a mighty warrior and a merciless man whom no one trusts. If one sees an osprey over his roof, or inside his house, or standing over his head in a dream, it represents the angel of death. Catching an osprey in a dream means frequenting a ruler and remaining constantly wary of him, whether one obeys him or opposes him in opinion. If an osprey scratches someone with its claws in a dream, it means depression and financial losses. Eating the flesh of an osprey in a dream represents a demanding person. An osprey in a dream also represents a ruler about whom people speak very scarcely, but who is the direct cause of the fall of many neighbouring rulers. Seeing an osprey in a tree means profits, favours, and blessings. A flying osprey in a dream means victory in one's life. An osprey standing on top of a mountain or a rock, or a cliff in a dream, means success for the one who is starting a new job or a new business. However, it also could mean bad news if one is afraid of something, or if he is travelling. As for rich and noble people, riding an osprey in a dream means death, while for poor people it means profits and success that will benefit their families and neighbours. An osprey in a dream also means returning from a journey. It is also glad tidings of success and profits if an osprey comes near someone in a dream and talks to him. If a pregnant woman dreams of an osprey in her dream, it means that she will give birth to a son who will grow to be a courageous soldier or a leader in his community. A dead osprey in a dream means death. If thieves or robbers see an osprey in a dream, it means that they will suffer the consequences of their evildoing. If an osprey carries someone in the air in a dream, it means rising in station and honour. Fighting an osprey in a dream means fighting people in authority. Carrying the emblem of an osprey in a dream means winning victory over one's enemy. A female osprey in a dream represents homeless women who are driven into prostitution, while osprey chicks in a dream represent children born from adultery."}, {"id": "ostrich", "label": "Ostrich", "category": "Animals", "meaning": "(Mail, Male ostrich) In a dream, a male ostrich represents a servant, a Gypsy, a deaf person, a castrate, an eunuch, or announcing someone's death. An ostrich in a dream also represents wealth and blessings. If one sees himself slaughtering a male ostrich in a dream, it means homosexuality. Receiving a male ostrich in a dream means that one will become a man of knowledge, a judge, or preside over a high-ranking post in conjunction with one's qualifications. Riding an ostrich in a dream also means carrying a postal pouch or becoming a courier. Riding an ostrich in a dream also means living on unlawful money. Seeing an ostrich living in one's house in a dream means longevity. Carrying an ostrich in a dream means carrying one's sins. Finding an ostrich egg in a dream means pursuing a woman to satisfy an erotic intention."}, {"id": "outcry", "label": "Outcry", "category": "Feelings", "meaning": "(See Shout)"}, {"id": "outdoor-bench", "label": "Outdoor bench", "category": "Objects", "meaning": "(See Bench)"}, {"id": "outer", "label": "Outer", "category": "Other", "meaning": "(Manifest)"}, {"id": "oven", "label": "Oven", "category": "Tools", "meaning": "(Fire, Furnace, Grill, Head of household, Kiln, Range) If one sees himself lighting an oven for heating, or cooking on it in a dream, it means an increase in earnings and benefits for one's growth. An oven in a house in a dream means bringing a solution to a problem, or winning a victory over one's enemies. An oven without accumulation of ashes in a dream means a bad marriage. Dream interpretation of ovens varies sometimes depending on the type of oven one sees in their dream. A grilling oven in a dream means imprisonment for a free man and freedom for a jailed one. A grilling oven in a dream also represents a respected man of knowledge who is sought to deliver legal opinions or views of wisdom that will satisfy both parties in a claim. The house range in a dream represents the head of the household, the housekeeper, the butler, a treasure chest, one's coffer, or a safety box. The baker's oven in a dream represents the governor's house, a juvenile correction house, fulfillment of one's needs, earning one's livelihood, or recovering from illness. If one bakes dough in a dream, it means satisfying one's needs, recovering from illness, winning a victory over one's enemies or opponent, winning a court case, teaching one's son a craft, sending one's child to a school, enlisting one's son in the army, or it could mean becoming wealthy. A bakery oven in a dream also represents one's source of income, revenues, or shop, or it could denote one's carnal self, its good and evil nature, or it could mean changes in one's life, profits and losses. Seeing an unknown bakery oven in a dream also represents the governor's house, or the courthouse, because of the fires that are kindled therein from time to time, as fire in a dream signifies power and sovereignty. An oven in a dream also represents a marketplace. (Also see Furnace, Heater)"}, {"id": "overcoat", "label": "Overcoat", "category": "Objects", "meaning": "(Cap, Coat, Capote) Wearing an overcoat in a dream means strength and support. Wearing a decorated ceremonial overcoat in a dream signifies power, dispelling depression, or satisfaction of one's needs. (Also see Cap, Coat, Raincoat)"}, {"id": "overlay", "label": "Overlay", "category": "Objects", "meaning": "(See Blanket)"}, {"id": "overseas", "label": "Overseas", "category": "Other", "meaning": "(See Invasion)"}, {"id": "overseas-cap", "label": "Overseas cap", "category": "Objects", "meaning": "(Headgear) Seeing a headgear in a dream means recovering from an illness, or it could mean purification from sin. If a garment salesman visits a sick person in a dream, it means death. (Also see Headgear)"}, {"id": "oversight", "label": "Oversight", "category": "Other", "meaning": "(See Slip of a tongue)"}, {"id": "overspread", "label": "Overspread", "category": "Other", "meaning": "(See Blanket)"}, {"id": "owl", "label": "Owl", "category": "Animals", "meaning": "In a dream, an owl represents a tyrant ruler, or a haughty and dangerous thief who works alone without helpers. An owl in a dream also means being unemployed, or an aversion to fear and bewilderment. In a dream, an owl also represents a traitor. If one sees himself fighting with an owl in a dream, it means facing a fight with someone. An owl in a dream also represents a person without steadfastness or determination to do what is right. If an owl falls inside his house in a dream, it means news of someone's death. An owl also represents thieves hiding in the darkness and under the shade of ruins, and of being annoyed about having to make an effort to earn one's livelihood."}, {"id": "ox", "label": "Ox", "category": "Animals", "meaning": "(See Bull)"}, {"id": "oxidize", "label": "Oxidize", "category": "Action", "meaning": "(See Rust)"}]