[{"id": "qada", "label": "Qada", "category": "Other", "meaning": "(arb. See Five times prayers)"}, {"id": "quail", "label": "Quail", "category": "Animals", "meaning": "(A mountain short-winged and a stout-bodied bird, Mountain quail, Partridge, Woman) In a dream, a mountain quail represents a thief, a confidant, or a pimp who secretly conducts his business of soliciting clients for his prostitutes. However, a quail in a dream also represents a blessed food, an answer to one's prayers, repelling a calamity, or overcoming an adversity. In dream interpretation, a quail also could represent a double-faced person. If a hobbyist finds himself seeking to hear the cry of a quail in a dream, it means profits from suspicious sources, or earnings made from reciting poems, singing, or gambling, or it could mean squandering money. In this sense, seeing a quail in a dream could represent a crime that is punishable by death or life imprisonment."}, {"id": "quake", "label": "Quake", "category": "Earth", "meaning": "(See Tremor)"}, {"id": "quantity-surveyor", "label": "Quantity surveyor", "category": "Types of People", "meaning": "(See Measurer)"}, {"id": "quarrel", "label": "Quarrel", "category": "Action", "meaning": "(See Dispute, Gambling)"}, {"id": "quartz", "label": "Quartz", "category": "Objects", "meaning": "(See Stone)"}, {"id": "qubba", "label": "Qubba", "category": "Other", "meaning": "(See Dome)"}, {"id": "queen", "label": "Queen", "category": "Types of People", "meaning": "(See Chess queen)"}, {"id": "queer", "label": "Queer", "category": "Mood", "meaning": "(See Pimp)"}, {"id": "question", "label": "Question", "category": "Other", "meaning": "(Vestige) In a dream, a question means pursuing someone's tracks, following a sign, or ascertaining the truth. If one sees himself asking questions in a dream, it means that he is seeking knowledge and that he will humble himself before God Almighty, who will raise him up in station."}, {"id": "questioning", "label": "Questioning", "category": "Action", "meaning": "(See Reckoning)"}, {"id": "quick-pace", "label": "Quick pace", "category": "Action", "meaning": "(See Hurry)"}, {"id": "quicksilver", "label": "Quicksilver", "category": "Objects", "meaning": "(See Mercury)"}, {"id": "quince", "label": "Quince", "category": "Plants", "meaning": "(Fruit) A quince in a dream denotes a sickness. However, if a sick person eats this fruit in his dream, it means that he will recover from his illness. If a governor eats a quince in his dream, it means that he will achieve his goals. If a healthy person eats it in his dream, it means that he will receive spiritual guidance. If a merchant eats it in his dream, it means prosperity. Extracting juice from a quince in a dream means undertaking a business trip and reaping good benefits from one's venture. A quince tree in a dream represents a prudent, discreet, and firm man from whom no one can benefit, or it could represent a vile person. A green quince in a dream is better than a yellow one. A quince in a dream also represents a beautiful and noble woman. Many interpreters disliked the quince fruit because of its yellowish colour, and they mostly qualify it to mean sickness because of the constipation it causes if eaten raw. However, its yellowish colour can also be interpreted as the colour of gold. Seeing or eating a quince in a dream also means travelling with good companions, though some of them may be of no benefit. However, in general, a quince or a quince tree in a dream can still be interpreted in a positive sense under all circumstances."}, {"id": "quintessence", "label": "Quintessence", "category": "Other", "meaning": "(See Pith)"}, {"id": "quiver", "label": "Quiver", "category": "Objects", "meaning": "(Case, bag) In a dream, a quiver represents a good wife, a trustworthy companion, or one's confidant. If one draws arrows from his quiver in a dream, it means that he will beget a son. Buying a quiver in a dream means getting married. Receiving a quiver as a gift in a dream denotes a political appointment."}, {"id": "qur'an", "label": "Qur'an", "category": "Other", "meaning": "(Garden, Holy Book, The Last Revelation) In a dream, the holy Qur'an represents a garden because when one looks at it, it looks like a beautiful garden, and its verses are the fruit of knowledge and wisdom that the reader can pluck. Learning a Qur'anic verse, a saying of God's Prophet, a prophetic tradition, or a craft in a dream means richness after poverty, or guidance after heedlessness. If one sees himself in a dream reading from the pages of the holy Qur'an, it signifies honour, command, happiness, and victory. Reciting the Qur'an by heart and without reading the pages of the holy Book in a dream means proving to be true, or having a true claim, being pious, commanding what is good and forbidding what is evil. If one is told a verse from the holy Qur'an in a dream, he should understand it, memorize it, and comply with the same. If the verse reads about mercy or glad tidings or other admonitions in the dream, the interpretation of one's dream should be the same. If the Qur'anic verses recited in the dream connote advice, one should act upon it to reap its benefits. If one hears a Qur'anic verse containing a warning, promising punishment for the disbelievers, or announcing a swift retribution for their sins, then one should immediately repent for their sins, even if the verses relate to previous nations or times. If one sees himself reciting the Qur'an and understanding what it says in a dream, it denotes his vigilance, intelligence, faith, and spiritual awareness. If a Qur'anic verse is recited to someone, and if he does not agree with the divine judgement in the dream, it means that he will suffer harm from someone in authority, or that a punishment from God Almighty will soon befall him. If an unlettered person sees himself reading the holy Qur'an in a dream, it could also mean his death, or his reading of his records. If one sees himself reading the holy Qur'an without true interest in it in a dream, it means that he follows his mind, personal interpretations, and innovations. If one sees himself eating the pages of the holy Qur'an in a dream, it means that he earns his livelihood from his knowledge of it. If one sees himself completing the reading of the entire Qur'an in a dream, it means that a splendid reward from his Lord is awaiting him, and that he will get whatever he asks for. If a disbeliever sees himself reading the holy Qur'an in a dream, the verses of admonition will help him in his life, the verses of punishment will be his warning from God Almighty, and the parables will denote his need to contemplate the meaning. If one sees himself writing the verses of the holy Qur'an on slabs of mother-of-pearl, or on a piece of cloth in a dream, it means that he interprets it according to his liking. If one sees himself inscribing a Qur'anic verse on the ground in a dream, it means that he is an atheist. It is also said that reading the Qur'an in a dream means fulfillment of one's needs, clearing of one's heart, and establishment of one's success in his life. If one discovers that he has memorized the Qur'an in a dream, though in wakefulness he has not memorized it, it means that he will own a large property. Hearing the verses of the holy Qur'an, the strengthening of power, reaching a praiseworthy end to his life, and that one will be protected from the envy and jealousy of evildoing people. If a sick person sees himself reciting a verse from the holy Qur'an, but cannot remember to which chapter it belongs in the dream, it means that he will recover from his illness. Licking the holy Qur'an in a dream means that one has committed a major sin. Reciting the holy Qur'an in a dream means an increase in one's good deeds and rising in his station. (Also see Holy Book, Pearl necklace, Reading)"}, {"id": "qur'an-reader", "label": "Qur'an reader", "category": "Types of People", "meaning": "(Holy Book, Qur'anic recital) Reciting the Holy Qur'an in a dream means admonition to do good and to forbid evil. (Also see Qur'anic recital)"}, {"id": "qur'anic-commentaries", "label": "Qur'anic commentaries", "category": "Other", "meaning": "(arb. Tafsir. See the Reference book."}, {"id": "qur'anic-recital", "label": "Qur'anic recital", "category": "Action", "meaning": "Reading the holy Qur'an or part of it in a dream means rising in station, gaining power, repenting from sins, prosperity, paying one's debts, witnessing the truth, or delivering a trust to its rightful owner. Reciting the holy Qur'an with a beautiful voice in a dream means honour, dignity, and good fame. Reading the holy Qur'an and adding one's own words to it in a dream means wavering from the truth, or betraying one's promise or covenant. If in the latter case one does not understand the meaning of what he is saying in the dream, it means that he will give false testimony in a court of justice, or that he will be involved in something evil, the consequences of which cannot be foreseen. If one sees people listening to his recital of the Qur'an in a dream, it means that he will command a job, and that people will follow his instructions. Hearing, or reading any Qur'anic chapter which is customarily read for a deceased person in a dream, signifies the death of a sick person in that family. Professional Qur'an readers in a dream represent the leading people of the society. To hear a professional Qur'anic recital in a dream means that people in authority will soon gather in the place where the recital is seen in one's dream. If one sees himself reading his book of records on the Day of Judgment in a dream, and if he is an unlettered person in wakefulness, it means that he will become rich after having suffered from poverty, and that he will answer all the questions he will be asked on the Day of Reckoning, or that he will be protected by God Almighty from what he fears most. This happens if one's reading of his records is positive, but if it reads his sins and pitfalls in the dream, then it denotes distress, trouble, or suffering. (Also see Holy Book, Reading)"}, {"id": "qur'anic-verses", "label": "Qur'anic verses", "category": "Other", "meaning": "Reading or listening to Qur'anic verses in a dream may carry needed interpretations related to one's current studies of God's holy Book. If they indicate verses of mercy in the dream, it means that he will receive it, and if they carry admonition in the dream, and unless one immediately repents, they mean a punishment for one's sins. (Also see Pearl necklace)"}]