[{"id": "rabbit", "label": "Rabbit", "category": "Animals", "meaning": "In a dream, a rabbit represents a cowardly man, a wife, an evil woman, or someone who talks continuously about unimportant matters. Eating rabbit meat in a dream means getting little money or profiting from a woman. A rabbit's foot in a dream represents superstition or a talisman."}, {"id": "rabihul-awwal", "label": "Rabihul Awwal", "category": "Months", "meaning": "(See Arabic months)"}, {"id": "rabihul-thani", "label": "Rabihul Thani", "category": "Months", "meaning": "(See Arabic months)"}, {"id": "racing", "label": "Racing", "category": "Action", "meaning": "(Car racing, Competition, Contest, Horse race, Pigeon racing) Racing on foot in a dream means activities, actions, accomplishments, workout, amusement, playfulness, idling, a vacation, or travelling without a purpose. If a sick person sees himself racing in a dream, it means his death. If a poor person sees himself racing in a dream, it means financial gains. If a traveller sees himself racing in a dream, it means returning to his home. Horse racing in a dream means indulging in what is forbidden, arrogance, self-deceit, or guaranteeing the success of what has no prospect of succeeding. Horse racing in a dream could also mean engaging in a dangerous adventure that could lead to one's death, corruption, and divisiveness. Pigeon racing in a dream means sodomy. Car racing in a dream means exceeding the boundaries of safety, or crossing into the boundaries of danger."}, {"id": "radiance", "label": "Radiance", "category": "Other", "meaning": "(See Light)"}, {"id": "radish", "label": "Radish", "category": "Plants", "meaning": "In a dream, a radish represents a nomad, a pilgrim, lawful money, blessed earnings, or starting something with a good intention, then regretting it."}, {"id": "rage", "label": "Rage", "category": "Feelings", "meaning": "(See Anger)"}, {"id": "ragman", "label": "Ragman", "category": "Types of People", "meaning": "(See Junk dealer)"}, {"id": "raiment", "label": "Raiment", "category": "Objects", "meaning": "(Knighthood, Robe) To put on a new raiment in a dream means a knighthood for a person who has lost his rank or position. It also means rising in station for an appointed person, wearing a new garment, or having constant disputes with one's wife. Wearing a new raiment in a dream also could represent one's love to preside over others or to be perceived as a great person."}, {"id": "rain", "label": "Rain", "category": "Weather", "meaning": "(Clouds, Drizzling, Life, Vapor, Water) If no harm or destruction is caused by a rainstorm in a dream, then it means blessings, profits, and mercy. Rain in a dream also represents life, an earthly being, or fulfillment of a promise. If the rain falls exclusively on a particular location in a dream, it means sorrow and distress for its dwellers, or it could mean the loss of a beloved. If one sees rain falling exclusively over his house in a dream, it means personal blessings. Otherwise, if he sees it falling over the whole town in a dream, it means blessings for everyone. Rain falling exclusively over one's house in a dream also means that someone will fall sick in that house, or suffer from a debilitating and excruciating pain. If the skies rain stones or blood in a dream, it means calamities and punishment for people's sins. If it rains dust or sand in a dream, it represents an unjust ruler in that locality. If the skies rain dirt without dust, it also means prosperity and a good harvest. If a traveller sees rain in a dream, it means hindrances along his journey. A destructive rainstorm in a dream denotes dishonesty, cheating with measures, or the spread of sodomy in the community. Seeing a destructive rainstorm tearing down structures, destroying homes, and pulling down trees in a dream represents a punishment for the corruption and sins of the dwellers of that place. A good rain in a dream could mean reconciliation with one's enemy, or it could mean helping a needy person. Rain in a dream also represents a caravan of camels, and a caravan of camels in a dream represents rain. A good rain in a dream also means prosperity, happiness, refilling wells with rainwater, and the gushing forth of springs with sweet, fresh, and pure waters. Rain in a dream also means reviving an old and stagnant matter, or it could mean benefits, profits, blessings, relief from distress, payment of debts, or feeling relief. In a dream, a good rain means blessings, a good harvest, and profits for a farmer. If the skies rain honey, butter, oil, or food people like in the dream, it means blessings for everyone. Rain in a dream also represents mercy from God Almighty, a helping hand, knowledge, wisdom, the Quran, rejuvenation, revival, resurrection, and life. If one sees himself standing under a cover, a roof, or behind a wall to take shelter from a rainfall in a dream, it means that he may suffer because of someone slandering him. If the rain falls in season in one's dream, it means a roadblock barring travel, business losses, inability to get medicine for a sick person because of one's poverty, or it could mean imprisonment. If one washes himself in the rain, or takes a ritual ablution to perform his prayers, or washes his face with it, or washes away filth in a dream, it means repentance from sin, receiving spiritual guidance, or abolishing religious innovations and polytheism from one's heart. If he is poor, it means that God Almighty will enrich him and satisfy his needs, or if he needs something from a ruler or a governor, it means that his request will be answered favourably. Drinking from rainwater, and if it is clear and pure in the dream, it means receiving blessings and benefits. If the water is dirty and polluted in the dream, it means a sickness. (Also see Water)"}, {"id": "rain-gauge", "label": "Rain gauge", "category": "Tools", "meaning": "(See Water level)"}, {"id": "rainbow", "label": "Rainbow", "category": "Weather", "meaning": "(Fantasy, Illusion, Pipe dream) In a dream, a rainbow means peace and tranquillity. If the red colour is dominant in the dream, then it means witnessing bloodshed during the same year. If the yellow colour is more dominant in the dream, it means an illness. If the green colour is more dominant in the dream, then it means safety, peace, and tranquillity. A rainbow in a dream also means marriage. Seeing a rainbow over one's right side in a dream means blessings. If it appears on one's left side in the dream, then it means prosperity and a good harvest. As for poor people, seeing a rainbow on one's right side also means richness, while for a rich person, it means short-lived difficulties. A rainbow in a dream also represents wonders or a military coup. If thunder accompanies the rainbow in the dream, then it means war."}, {"id": "raincoat", "label": "Raincoat", "category": "Objects", "meaning": "(Overcoat, Trench coat) In a dream, a raincoat means comfort, superiority, backing, cooperation, and strength. As for a merchant, wearing a raincoat in a dream means prominence, distinction, and fame in his field. Wearing a heavy raincoat in a dream means profits in one's material and spiritual life. Wearing a cotton overcoat in a dream means lesser benefits. Wearing a silk brocaded overcoat in a dream signifies attachment to one's worldly gains and disregard for one's religious and spiritual benefits. Being the only person who is wearing an overcoat or a raincoat in a dream means becoming poor and mixing with good people by displaying praiseworthy qualities. (See Overcoat)"}, {"id": "rainworm", "label": "Rainworm", "category": "Animals", "meaning": "(See Worms)"}, {"id": "raise", "label": "Raise", "category": "Action", "meaning": "(Allowance) In a dream, a raise means satisfying one's needs, and it could indicate the house servant or an employee."}, {"id": "raisins", "label": "Raisins", "category": "Food", "meaning": "Eating raisins in a dream means profits, no matter what kind or colour they are."}, {"id": "rajab", "label": "Rajab", "category": "Months", "meaning": "(See Arabic months)"}, {"id": "rake", "label": "Rake", "category": "Tools", "meaning": "(Shovel) A rake in a dream represents an employee or a servant. Its function is to sweep and gather dirt or manure, and all of that means money in a dream. Only one who uses a rake in wakefulness will see one in his dream. As for an unmarried person, seeing a rake in a dream means getting married and protecting one's chastity, or uniting with one's beloved, or it could mean a crop, a good appetite, a ladle, a son, a comfortable financial standing, a hard working man, a helper, a hard working and a patient woman, or business activities. (Also see Shovel)"}, {"id": "ram", "label": "Ram", "category": "Animals", "meaning": "In a dream, a ram represents a noble person. Holding a ram by its wool in a dream means taking money from a noble person. Holding a ram by its horn in a dream means being restrained by a noble man from engaging in something. Holding a ram from its buttock in a dream means controlling or managing the interests of a nobleman, or it could mean inheriting him, or marrying his daughter. Holding a ram from its belly in a dream means taking money from a noble person. Killing a ram for other than food in a dream means killing a noble person. If one kills a ram during wartime in a dream, then it represents his enemy. A slaughtered ram in a dream represents a murder. Buying a ram from a butcher in a dream means that a noble and a great person will come to need the person seeing the dream, who will save him from a foreseeable danger, or help him to recover from an illness. Slaughtering a ram in a dream means recovering from an illness. Carrying a ram over one's head in a dream means caring for or managing the business or accounts of a noble and a rich person. Riding a ram and driving it at will in a dream means conquering a great person. If one sees a ram riding him in a dream, then it means that such a great and powerful person will rise above him and control his life. Breaking the horns of a ram in a dream means weakening a powerful person. Fighting with a ram in a dream also means fighting with a powerful person. Whoever wins the fight in the dream will eventually win it in wakefulness. Seeing a dead ram in a dream means the death of such a great person. Dividing the meat of a ram in a dream means dividing the wealth of a great person after his death. Sacrificing a ram to eat and to distribute from its meat as a charity to poor and needy people in the dream means the release of a prisoner, his escape from capture, dispelling distress and worries, payment of one's debts, attending the annual pilgrimage to God's House in Mecca, or recovering from an illness. Slaughtering and skinning a ram, then hanging it in a dream, means stripping one's enemy of his money and wealth. Seeing a skinned ram inside one's house in a dream means the death of a relative. If it is the leg of a ram, then it means the death of the closest relative. Broiling a ram in a dream means governing for one year, after which period one may be imprisoned. The number of rams in a dream represents the number of years. Thus, seeing them also represents the number of years one will serve in their job. The wool of a ram in a dream means money. A ram in a dream also represents the muezzin in a mosque, a general in the army, a deposed ruler, or a humiliated person. If a ram attacks someone in a dream, it signifies an attack by one's enemy. If a ewe becomes a ram in a dream, it means that one's wife will no longer bear children. If one is not married, then it means winning in his life. (Also see Ewe, Sacrifice, Sheep)"}, {"id": "ramadan", "label": "Ramadan", "category": "Months", "meaning": "(See Arabic months, Fasting)"}, {"id": "rancher", "label": "Rancher", "category": "Types of People", "meaning": "(See Stableman)"}, {"id": "rancour", "label": "Rancour", "category": "Feelings", "meaning": "(Grudge, Hatred, Spite) To have rancour or to suffer from others' rancour in a dream means attaining a high rank or becoming a governor. Rancour in a dream also represents unlawful earnings. (Also see Anger, Handcuff, Grudge)"}, {"id": "range", "label": "Range", "category": "Other", "meaning": "(See Oven)"}, {"id": "rank", "label": "Rank", "category": "Other", "meaning": "(Ceremony, Religious rank) Awarding a meek person a ceremonial rank or a station of honour in a dream represents a wedding, a job, or a good deed through which God Almighty will raise such a person in station. (Also see Rising in station)"}, {"id": "ransom", "label": "Ransom", "category": "Other", "meaning": "(See Enemy, Enmity)"}, {"id": "rape", "label": "Rape", "category": "Action", "meaning": "(See Adultery)"}, {"id": "rapture", "label": "Rapture", "category": "Feelings", "meaning": "(See Delight)"}, {"id": "rare-book", "label": "Rare book", "category": "Objects", "meaning": "(See Reference book)"}, {"id": "rash", "label": "Rash", "category": "Human Body", "meaning": "(See Hives)"}, {"id": "rasp", "label": "Rasp", "category": "Tools", "meaning": "(See File)"}, {"id": "rat", "label": "Rat", "category": "Animals", "meaning": "A rat in one's house in a dream means that he will emigrate from one land to another. If the person seeing the dream owns a house, it means that he will sell it. Rats in one's house in a dream also represent thieves one must guard his house against, or that he must guard himself against the betrayal of a close acquaintance. Eating a rat in a dream means backbiting others, or earning unlawful money. In general, rats in a dream represent insolence, causing damage, fornication, adverse marital conditions, or problems in the upbringing of one's children. Catching a rat in a dream means suffering from humiliation and despise."}, {"id": "ratio", "label": "Ratio", "category": "Other", "meaning": "(See Measurer)"}, {"id": "raven", "label": "Raven", "category": "Animals", "meaning": "(Carrion crow, Crow, Hooded crow, Rook) In a dream, a raven represents a high-ranking man, a forbearing and patient person, or a strong and well-feared person. (Also see Crow, Rook)"}, {"id": "razor", "label": "Razor", "category": "Tools", "meaning": "(Straight razor) In a dream, a straight razor represents a son. If one causes wounds to a pigeon or an animal with a razor in a dream, the razor then represents his tongue and the base language he hurls at people. Seeing a straight razor in a dream also signifies perfidy, enmity, and the use of harsh language."}, {"id": "razor-strop", "label": "Razor strop", "category": "Tools", "meaning": "(See Hone)"}, {"id": "reading", "label": "Reading", "category": "Action", "meaning": "Reading the front page of a letter, a paper, or a book in a dream means receiving an inheritance. Reading the last page, or the back cover of a book, in a dream means indebtedness. Reading a book in a dream also means receiving an inheritance. If one finds himself as a lettered person and if he reads well in his dream, it means that he will attain a high-ranking job. If one sees himself reading his book of records in a dream, it means that he will repent for his sins. Reading a book in another language in a dream means travelling to such a country, or going to places one is not familiar with, and performing a job that will earn him fame. If one sees himself reading a book in a foreign language and is unable to properly decipher its words in a dream, it means that he will escape from a potential danger he could face in such a land, or it could mean falling sick in a foreign country, then recovering from one's illness before returning to one's homeland. (Also see Language, Qur'anic recital, Reckoning)"}, {"id": "rear-side", "label": "Rear side", "category": "Human Body", "meaning": "(See Back, Buttock)"}, {"id": "rebellious-child", "label": "Rebellious child", "category": "Types of People", "meaning": "(See Profligacy, Recalcitrant child)"}, {"id": "rebellious-son", "label": "Rebellious son", "category": "Types of People", "meaning": "(See Profligacy, Recalcitrant child)"}, {"id": "rebuke", "label": "Rebuke", "category": "Action", "meaning": "(Calumniation, Fire, Harsh words, Slander. See Blame, Censure)"}, {"id": "recalcitrance", "label": "Recalcitrance", "category": "Feelings", "meaning": "(See Recalcitrant child)"}, {"id": "recalcitrant-child", "label": "Recalcitrant child", "category": "Types of People", "meaning": "(Accursed, Disobedient, Disrespectful, Rebellious, Undutiful) To see a recalcitrant child who stubbornly refuses to obey his parents in a dream means committing a major sin, such as associating partners with God Almighty, or committing a violent crime or murder, etcetera. (Also see Disobedience)"}, {"id": "receiving", "label": "Receiving", "category": "Action", "meaning": "(See Giving)"}, {"id": "reciting", "label": "Reciting", "category": "Action", "meaning": "(See Poem)"}, {"id": "reckoning", "label": "Reckoning", "category": "Action", "meaning": "(Day of Reckoning, Doomsday, Resurrection) Seeing the reckoning of a deceased person in a dream denotes his sufferings in the hereafter. If a traveller is asked to account for his travel expenses, and if he is treated with kindness during the reading of his report in the dream, it means profits from his journey and a safe return to his homeland. If one dreams of himself in a dream, it means that he will repent for his sins. If one is brought for judgment on the day of reckoning, and if his questioning is made easy in the dream, it means that God has blessed him to marry a pious wife who has love and compassion for him, and who cares about his interests. If his questioning is strict and detailed in the dream, it means that he will incur losses. If a person sees himself questioned, probed, and investigated in a court by people he does not recognize in the dream, it means that he has strayed into innovation, and that he will remain accountable for his actions. If he sees them well dressed and fragrant, congratulating him and greeting him with the salutation of peace: '''As-Salamu Alaikum\", then it is an indication of righteousness and good deeds. (Also see Intercession, Reading, Resurrection)"}, {"id": "recognition", "label": "Recognition", "category": "Feelings", "meaning": "(See Fame)"}, {"id": "recognize", "label": "Recognize", "category": "Action", "meaning": "(See Uncertainty)"}, {"id": "reconciliation", "label": "Reconciliation", "category": "Other", "meaning": "Reconciliation between a husband and a wife in a dream connotes the consequences of an illness, embracing one's former religion, or it could mean returning to one's old trade. (Also see Conciliation)"}, {"id": "record-keeper", "label": "Record keeper", "category": "Types of People", "meaning": "(Accountant, Calculator, Drawing board, Gambler, Inscription tablet, Speculator) A calculator in a dream represents a painter or a photographer. If one sees himself as a calculator, an accountant, or a record keeper in a dream, it means that he might become a secretary, a writer, a stockbroker, a jobber, a dealer, a speculator, an operator, a bookmaker, a bookie, or an operator of a gambling table. (Also see Abacus)"}, {"id": "record-keepers", "label": "Record keepers", "category": "Types of People", "meaning": "(Angels, Spiritual) Representing the heedful angels in charge of guarding the writings of the Preserved Tablets, and the heavenly beings or scribes in charge of recording people's deeds. In a dream, the blessed angels in charge of keeping people's records represent the gnostics, the renowned people of knowledge, religious scholars, and the trustworthy ones. Seeing the scribes of the records in one's dream brings him glad tidings in this life and the next. If the person lives a pious life, it means that the heavenly paradise is his final abode, but if he is impious, it could represent a clear warning. Meeting the blessed angels in charge of keeping people's records in a dream also means facing adversities, then becoming free from one's trials. (Also see Scribes)"}, {"id": "records", "label": "Records", "category": "Objects", "meaning": "(See Book)"}, {"id": "red", "label": "Red", "category": "Other", "meaning": "(The colour red, Dignity, Nobility, Happiness) Wearing a red silken garment in a dream means a sickness. If a warrior sees himself wearing a red silken garment in a dream, it means that he will be decorated for his chivalry. Red in a dream also represents the world, its glitter, and material pleasures. (Also see Blushing)"}, {"id": "red-anemones", "label": "Red anemones", "category": "Plants", "meaning": "(bot.) In a dream, anemones represent fire, red cheeks, blushing, a beauty mark, the sickness of one's brother or sister."}, {"id": "red-rose", "label": "Red rose", "category": "Plants", "meaning": "(See Rose)"}, {"id": "red-brown-beard", "label": "Red-brown beard", "category": "Human Body", "meaning": "(See Reddish beard)"}, {"id": "reddish-beard", "label": "Reddish beard", "category": "Human Body", "meaning": "(Red-brown) Unless one has a reddish beard as the natural colour of his hair, having a reddish beard in a dream means trials or temptations, and particularly if grey hair is mixed with it."}, {"id": "reddish-brown", "label": "Reddish-brown", "category": "Other", "meaning": "(See Maroon)"}, {"id": "reed", "label": "Reed", "category": "Plants", "meaning": "(Cane) A reed in a dream represents the worst of people, or it could connote engaging in a despicable and loathsome conversation. Leaning on a stick of reed in a dream represents the short span of life that remains for such a person, and it could mean that he will become poor before he dies. Reed in a dream also represents a frugal person who has loyalty to nothing, and who has no respect for the common norms or ideals. If one sees strips of reed turn into strips of silver or gold in a dream, then they denote good and valued deeds. Reeds in a dream also signify prosperity and wealth, which is made from lawful earnings, a pure and chaste wife, or good children. However, reeds in a dream also represent hypocrites, and if one hears their sound in his dream, it means an argument or a fight. (Also see Caning, Sugar cane)"}, {"id": "reference-book", "label": "Reference book", "category": "Objects", "meaning": "(Compilation, Encyclopaedia, Qur'anic commentaries, Manual, Journal, Papers, Rare book, Source book) Reading any reference book, Qur'anic commentaries, or compilation of the prophetic sayings in a dream means correcting one's actions and thoughts and walking on the straight path. Reading the studies of religious scholars or science books in a dream means acquiring knowledge and benefiting from it. Reading history books or journals in a dream means becoming close to people in the government. Reading a book on logic, rhetoric, or explicative apposition in a dream means working in an amazing field of science and discoveries."}, {"id": "refinement", "label": "Refinement", "category": "Other", "meaning": "(See Elegance)"}, {"id": "refinery", "label": "Refinery", "category": "Other", "meaning": "(See Oil press)"}, {"id": "reflection", "label": "Reflection", "category": "Other", "meaning": "Seeing one's picture reflected in a wall means his death, and connotes that his name will be etched on his gravestone."}, {"id": "refuge", "label": "Refuge", "category": "Other", "meaning": "(Cave, Den, Harbor, Retreat, Sanctuary)"}, {"id": "refund", "label": "Refund", "category": "Other", "meaning": "(See Tax refund)"}, {"id": "refuse", "label": "Refuse", "category": "Other", "meaning": "(See Garbage)"}, {"id": "regent", "label": "Regent", "category": "Types of People", "meaning": "(See King)"}, {"id": "regret", "label": "Regret", "category": "Feelings", "meaning": "(Hastiness) In a dream, regret represents hastiness, and hastiness represents regret."}, {"id": "reins", "label": "Reins", "category": "Objects", "meaning": "(Bridle, Harness) In a dream, reins represent mastery of one's craft, control of his trade, or it could signify power and a strong financial standing. Reins in a dream also represent a coachman, or the driver who never disobeys his master, and who goes wherever he is told to go. Riding on a workhorse that is fitted with a harness, or on a bridled nag in a dream, means occupying an important office and letting everyone who works for the leader make an oath of allegiance before hiring them for work. If the bridle and the martingale are unadorned in the dream, then such a dream represents a humble person, and connotes that his heart is better than what his outer look may suggest. Reins in a dream also connote safety or a safety belt. Wearing a harness in a dream means safety, and that one does not interfere with others' business or talk about them. However, should one who has to appear in court see himself wearing a harness in a dream, it means that his proof will not be accepted by the judge, and subsequently he will lose his case. If the reins of one's horse are broken in a dream, it could mean the death of his rider. Reins in a dream also denote chastity, guardianship, and protection. They also represent the obligatory payment of alms tax, which cleanses and protects one's capital. If the reins or the harness fall from one's hand in the dream, it means corruption in one's religious life, a decline in his devotion, or that one's wife will become unlawful to him (i.e., living together after a divorce), or that she will remain in his house without a legal marriage. To see oneself bridled in a dream also means refraining from sin, or observing a voluntary religious fast. A broken bridle in a dream is good for one who services it and bad for its owner. (Also see Bridle)"}, {"id": "reins-of-power", "label": "Reins of power", "category": "Other", "meaning": "(See Bridle, Reins)"}, {"id": "reject", "label": "Reject", "category": "Action", "meaning": "In a dream, rejecting something means ingratitude or disbelief."}, {"id": "relationships", "label": "Relationships", "category": "Other", "meaning": "(Bond, Connection, Liaison) To have important connections in a dream means compelling one's enemy to retreat or to accept one's conditions. To have strong relationships in a dream cools the divine wrath, as does giving charity in secret. This is true unless one's connections or circle gather a group of evil companions, or if one is mingling with a band of conspirators."}, {"id": "relaxation", "label": "Relaxation", "category": "Mood", "meaning": "(Ease, Leisure, Repose, Rest) To see oneself relaxing after toiling in a dream means wealth after poverty, or a happy marriage after a miserable one. If a sick person sees himself relaxed in a dream, it means the nearing of his death, and taking a rest from the adversities and toiling of this world. On the other hand, relaxing in a dream may mean misery, worries, and unhappiness."}, {"id": "relief", "label": "Relief", "category": "Feelings", "meaning": "(See Death, Freedom, Manumission, Slaughter)"}, {"id": "religion", "label": "Religion", "category": "Other", "meaning": "(See Rope, Spool, Uncertainty, Veil)"}, {"id": "religion-of-islam", "label": "Religion of Islam", "category": "Other", "meaning": "(See Islam)"}, {"id": "religious-commitment", "label": "Religious commitment", "category": "Other", "meaning": "(See Rope)"}, {"id": "religious-doctors", "label": "Religious doctors", "category": "Types of People", "meaning": "(See Legist, Scholars)"}, {"id": "religious-endowment", "label": "Religious endowment", "category": "Other", "meaning": "(See Endowment)"}, {"id": "religious-rank", "label": "Religious rank", "category": "Other", "meaning": "(See Rank)"}, {"id": "religious-rites-relating-to-a-newborn", "label": "Religious rites relating to a newborn", "category": "Other", "meaning": "(See Aqiqah rites)"}, {"id": "religious-scholar", "label": "Religious scholar", "category": "Types of People", "meaning": "(See Legist, Scholars)"}, {"id": "relish", "label": "Relish", "category": "Food", "meaning": "(See Pickled fruit)"}, {"id": "remembrance-of-god", "label": "Remembrance of God", "category": "Action", "meaning": "(See Zikr)"}, {"id": "reminiscence", "label": "Reminiscence", "category": "Feelings", "meaning": "(See Institute)"}, {"id": "remorse", "label": "Remorse", "category": "Feelings", "meaning": "(See Worries)"}, {"id": "renegade", "label": "Renegade", "category": "Types of People", "meaning": "(See Betrayal)"}, {"id": "renowned", "label": "Renowned", "category": "Other", "meaning": "(See Fame)"}, {"id": "renter", "label": "Renter", "category": "Types of People", "meaning": "(See Carrier)"}, {"id": "reorganization", "label": "Reorganization", "category": "Action", "meaning": "(See Bankruptcy, Fraudulent bankruptcy, Slave)"}, {"id": "repairing", "label": "Repairing", "category": "Action", "meaning": "Repairing a broken jar or a utensil in a dream means correcting oneself, giving medicine to a sick person, or setting a broken bone."}, {"id": "repel", "label": "Repel", "category": "Action", "meaning": "Repelling someone in a dream means ingratitude or disbelief."}, {"id": "repentance", "label": "Repentance", "category": "Action", "meaning": "In a dream, repentance means release from prison. It also means reversing the course of one's life to attain success and to replace failure. If one sees himself refraining from evil and sins in a dream, it means that he will be tried with an adversity, then repents to regain honour after humiliation. If one repents for a sin he is not even aware of in a dream, it may be feared that he will fall into its trap, though the conclusion will turn positive. If a musician or an adulterer repents from sin in a dream, it means that he may experience poverty after wealth. (Also see Prostration, Tithe collector)"}, {"id": "reprimand", "label": "Reprimand", "category": "Action", "meaning": "(See Blame, Censure)"}, {"id": "reproof", "label": "Reproof", "category": "Action", "meaning": "(See Blame, Censure)"}, {"id": "repudiation", "label": "Repudiation", "category": "Other", "meaning": "(Desertion, Denial, Divorce, Estrangement) Repudiating one's wife in a dream means unveiling or exposing disturbing secrets. Repudiation in a dream also denotes a vow one has forgotten about. Repudiation in a dream also denotes having loathsome sexual preferences, or desiring anal intercourse with one's wife, or it could mean running away from one's enemy."}, {"id": "requital", "label": "Requital", "category": "Other", "meaning": "(Retaliation, Retribution) In a dream, requital means longevity, departure from one's past, or it could mean instituting justice, or performing penance that will purify the person from his sins, such as prayers, voluntary fasting, and alms giving. (Also see Atonement)"}, {"id": "rescind", "label": "Rescind", "category": "Action", "meaning": "(See Marriage bond, Reconciliation)"}, {"id": "research", "label": "Research", "category": "Action", "meaning": "Inciting someone to research, or to impel one's animal to drive faster in a dream, means investigating the secrets of life after death, or explaining its meaning. (Also see Impel)"}, {"id": "reservoir", "label": "Reservoir", "category": "Water", "meaning": "(See Water level)"}, {"id": "resignation", "label": "Resignation", "category": "Action", "meaning": "(See Justice)"}, {"id": "resigned", "label": "Resigned", "category": "Mood", "meaning": "(See Despair, Uptight)"}, {"id": "resin", "label": "Resin", "category": "Objects", "meaning": "(Conifers, Pitch) In a dream, resins mean travels. (Also see Conifer tree)"}, {"id": "respite", "label": "Respite", "category": "Other", "meaning": "Granting respite or a timetable to another person in a dream represents one's sufferings. If this is done in anger in the dream, then the measure of suffering will be awesome."}, {"id": "responding", "label": "Responding", "category": "Action", "meaning": "(arb. Talbiyah) Responding to a call, or uttering and repeating a formula \"Labbaika Allahumma Labbaik,\" during the pilgrimage season in a dream, means that one will capture his enemy and bring him to justice. Loudly answering a call in a dream means complaining before a judge, and winning the case thereafter. (Also see Hajj, Feast of Immolation, Pilgrimage)"}, {"id": "resurrection", "label": "Resurrection", "category": "Other", "meaning": "(Day of Reckoning, Day of Resurrection, Last Day, Reckoning, Rising of the dead, Trumpet of Resurrection) Seeing the Day of Resurrection, or Doomsday, in a dream is a serious warning for a sinner, or it could represent a warning for someone who is contemplating a sinful act. Seeing the Day of Resurrection in a dream also denotes justice. Being the only person resurrected on such a day means one's death. Standing up awaiting judgment on the Day of Resurrection in a dream means travels. If one sees himself and his wife being the only people who are brought for judgment on the grand Day of Gathering in a dream, it means that he is being unjust. If a warrior sees the Day of Resurrection in a dream, it means that by God's decree, the aggressor shall be defeated. The land of the grand gathering in a dream represents a chaste woman or a noble man. The blowing of the Trumpet of Resurrection in a dream represents the salvation of the righteous ones. Seeing any of the great, extraordinary events or signs that shall precede the Day of Resurrection in a dream means glad tidings for a believer who does good, and a warning for a disbeliever to correct himself and repent for his sins before it comes. Seeing the Day of Resurrection in a dream also denotes that some of the major signs are taking place, such as blood shedding, spread of evil, belligerence of atheism, pride about wealth, ruling of the working class, building high rises, the end of the era of kings on earth, or it could remind the person of the prophesied signs, such as the rising of the sun from the West, the emergence of a beast that will speak with a human tongue, the rising of the Imposter (arb. Dajjal, Antichrist), etcetera. Seeing the Day of Resurrection in a dream also represents the spread of evil, the presence of an extended police force, and the ruling of large armies and dictatorships around the world. Thus, seeing the Day of Resurrection in a dream is a reminder and a warning to the one who sees it. If one sees the graves splitting open, dead people resurrected back to life and are walking out of them, accompanied by their angels in a dream, it means that justice will prevail in that land. If one experiences the resurrection in a dream, then discovers that the world went back to continue its prior course, it means that justice will dominate that land for a while, then it will be followed by a tyranny that will be carried by people who are not even suspected to be of such character. Such a dream also could be interpreted to suit a person who is seeking the impossible, or one who is adamant in pursuing the path of wrongdoing, falsehood, and lies. Recognizing the imminent final signs of the Day of Reckoning in a dream means that one is unaware of his heedlessness, and such a dream constitutes a warning. If one's reckoning is easy in a dream, it denotes his wife's piety, compassion, and love for him. If one's reckoning is detailed and painful in a dream, then it represents major losses. If one's good deeds weigh heavier than his bad deeds in the dream, it means that his devotion is true and that his reward will be greater. If one sees himself carrying the scale to weigh his deeds in a dream, it denotes his righteousness and correctness. If one sees an angel handing him his records and telling him to read his book in a dream, it also means that he is on the right path. Walking on the bridge of the Day of Judgment, carrying one's records and crying in a dream means that one is praying for God's forgiveness and to ease his reckoning. If one sees Doomsday in a dream, it means that he will escape from dangerous enemies, or that perhaps a major trial will befall the dwellers of that place. If one crosses the Bridge of Judgement in a dream, it means that he will escape a major trial, or perhaps it could represent a major hurdle one may have to cross in this life. If one sees himself carrying his book of records in his right hand in a dream, it means that he will win righteousness, wealth, and honour. If one sees himself carrying his book of records in his left hand in a dream, it means that he will fall into sin and the consequent poverty and need of others, for wealth and adultery do not mix. If one witnesses the emergence of the Imposter (Antichrist) in a dream, it signifies new trends, innovations, and masses straying from the straight path. (Also see Intercession, Reckoning, Rising of the dead, Trumpet of Resurrection)"}, {"id": "retaliation", "label": "Retaliation", "category": "Action", "meaning": "(See Driving force, Requital)"}, {"id": "reticent", "label": "Reticent", "category": "Mood", "meaning": "(See Naked)"}, {"id": "retreat", "label": "Retreat", "category": "Action", "meaning": "(Sanctuary, Spiritual retreat. Arb. Ihtikaf) The place where one may see himself observing a spiritual retreat in a dream represents what the person is inclined to do. If it is a mosque in the dream, it means blessings or a marriage to a righteous woman. If one's retreat takes place inside his shop in the dream, it means that his business has become his primary concern. In a dream, a spiritual retreat represents devotion, prayers, hunger, a votive fast, depression, humbling oneself, controlling one's passions and desires. If one secludes himself in a known location in a dream, it means that such a place is a source of comfort. If one takes refuge in his shop in a dream, it means clinging to one's livelihood. (Also see Hermitage, Temple)"}, {"id": "retribution", "label": "Retribution", "category": "Other", "meaning": "(See Requital)"}, {"id": "return", "label": "Return", "category": "Action", "meaning": "(Return from a journey) When one returns from a trip in a dream, it means paying one's dues, dispelling sorrow and sadness, escaping from ill consequences, receiving a reward, or repenting from sin. (Also see Debt)"}, {"id": "return-of-one's-soul-to-its-lord", "label": "Return of one's soul to its Lord", "category": "Other", "meaning": "(Death, Give up the ghost, To die) In a dream, the return of one's soul to its Lord means remitting a trust to its rightful owner, the recovery of a sick person from his illness, the release of a prisoner from jail, or perhaps it could represent the reunion of beloveds."}, {"id": "returning-from-a-journey", "label": "Returning from a journey", "category": "Action", "meaning": "(See Debt, Return)"}, {"id": "returning-merchandise", "label": "Returning merchandise", "category": "Action", "meaning": "(Business) Returning merchandise to the merchant in a dream represents a highway robber, a thief, obstructing the trade, delaying a traveller, failing to observe the laws, or being careless about violating the law."}, {"id": "reunification", "label": "Reunification", "category": "Other", "meaning": "(See Reunion)"}, {"id": "reunion", "label": "Reunion", "category": "Other", "meaning": "(Reunification) To sit with one's beloved, enjoying love, affection, and unity in a dream, means marriage or prosperity. Sitting with one's beloveds and enjoying one's financial accomplishments in a dream means loss of rank and wealth. If a woman sees herself sitting with her beloved in a dream, it means that they will get married. A visit from one's beloved in a dream means valuing and cherishing one's happiness."}, {"id": "reverence", "label": "Reverence", "category": "Feelings", "meaning": "(See Majesty)"}, {"id": "reverie", "label": "Reverie", "category": "Feelings", "meaning": "(See Moon)"}, {"id": "reversal-of-sentence", "label": "Reversal of sentence", "category": "Other", "meaning": "(See Wrecker)"}, {"id": "review-officer", "label": "Review officer", "category": "Types of People", "meaning": "(Military. See Exhibition)"}, {"id": "reviewer", "label": "Reviewer", "category": "Types of People", "meaning": "(See Critic)"}, {"id": "reward", "label": "Reward", "category": "Other", "meaning": "(See Compensation, Bribe)"}, {"id": "rheum", "label": "Rheum", "category": "Human Body", "meaning": "(See Mucous)"}, {"id": "rhinoceros", "label": "Rhinoceros", "category": "Animals", "meaning": "In a dream, a rhinoceros represents a great king or a powerful ruler. If one sees himself milking a rhinoceros in a dream, it denotes money one may earn from such a great person. Riding a rhinoceros in a dream means rising above such a ruler, or it could mean betraying him."}, {"id": "ribs", "label": "Ribs", "category": "Human Body", "meaning": "(Women) In a dream, ribs represent women. Whatever may affect one's ribs in a dream will manifest in his wife, for it is said that Eve was created from Adam's rib. Ribs in a dream represent a protective shield. Their parable is like that of a tent and its pillars, a house and its foundation, the roof of a house, or a boat and its boards. Ribs in a dream also represent relatives of different social environments, or they could represent their stations of love, unity, compassion toward one another, or help they render to one another. Ribs in a dream also denote secret deeds or concealed actions. Ribs in a dream also mean punishment. If one sees his ribs standing out or exposed in a dream, he may face punishment for a crime or a sin he has committed. If one's ribs grow strong and the flesh surrounding them becomes healthier in a dream, then they represent prosperity, recovering from an illness, gaining weight, or growing fat. If one sees himself in a dream without ribs, it means that he will lose what the ribs represent of either a wife, a child, money, or perhaps, he could have engaged in something wrong, thinking it to be right. One's ribs in a dream also mean a sickness, or bending of one's shoulders because of old age. Eating one's ribs in a dream means becoming a burden to his family and relatives, or it could mean that he may sell wood for a living, or work at a lumberyard. (Also see Body)"}, {"id": "rice", "label": "Rice", "category": "Food", "meaning": "In a dream, rice means money, which is earned with toiling, distress, or passion."}, {"id": "rice-drink", "label": "Rice drink", "category": "Drinks", "meaning": "(See Amazaki)"}, {"id": "rice-flour", "label": "Rice flour", "category": "Food", "meaning": "In a dream, rice flour means a blessing or a favour. (Also see Flour)"}, {"id": "rice-pudding", "label": "Rice pudding", "category": "Food", "meaning": "In a dream, rice pudding means celebrations, a reception, a wedding, a contract, knowledge, or prosperity."}, {"id": "richness", "label": "Richness", "category": "Other", "meaning": "Richness in a dream means poverty or contentment. (Also see Star)"}, {"id": "ride", "label": "Ride", "category": "Action", "meaning": "(Animal, Carrier, Mount, Vehicle) A vehicle in a dream represents care, concern, attaining one's purpose, or it could mean reaching one's destination through striving and hard work. To ride an animal in a dream means following one's desires and passions. However, to be carried by any animal, or by any type of vehicle, in a dream is a sign of honour and authority. Riding a horse one cannot control in a dream means following one's passions and wantonness. If one can adequately tame his horse and control it in a dream, it means that he will be saved from adversities. Riding an elaborately dressed horse for a parade, being surrounded by servants and an entourage in the dream, means receiving an inheritance, or it could mean becoming the guardian of an estate one will inherit in a short while. Riding over the shoulder of another man and forcing him to accept it in a dream represents one's funeral, and it means that the other person will have no choice but to carry the coffin. If the person carrying him in the dream is willingly doing so, then it means that he will care for his needs and bear his encumbrance. Riding over someone's shoulders in a dream also means facing a major adversity. Should he meanwhile fall in the dream, it means that such a trial will not take place. If one sees himself riding over someone's shoulder backward in a dream, it means that he does not accept any advice or excuse, or it may mean that he turns to the other side if he is asked for help, or it may mean that he engages in the forbidden sexual intercourse during women's menstrual period, or that he engages in sodomy. To see a horseman leading a procession or a caravan of travellers in a dream means taking a distant journey, or it could represent business activities, or recovering from an illness."}, {"id": "ridhwan", "label": "Ridhwan", "category": "Angels", "meaning": "(The archangel Ridhwam, peace be upon him.) Seeing the guardian angel of paradise in a dream means blessings and comfort in one's life, glad tidings, an unalterable happiness, and protection from illness. In a dream, Ridhwan represents the treasurer of the king and his messenger, seeing him also could mean fulfilling a promise or satisfying one's needs. If one has disagreements with his superiors, then if he sees Ridhwan in a dream, it means that they will wind up in blessings and harmony, and particularly if Ridhwan hands the person a heavenly fruit or a heavenly garment, or meets him cheerfully with a comforting smile, showing a sign of God's pleasure with him. Seeing him in a dream also denotes a divine grace that is bestowed secretly and openly upon the one who sees him. Seeing Ridhwan in a dream also denotes a happy life, joy, peace, comfort, and blessings in this world and in the next. If one sees the heavenly angels coming before him to congratulate him in a dream, it means that God Almighty has forgiven that person his sins and endowed him with the gift of patience and forbearance through which he will triumph in this life and be blessed in the next. (Also see Paradise)"}, {"id": "rift", "label": "Rift", "category": "Earth", "meaning": "(See Rupture of relations)"}, {"id": "right-hand", "label": "Right hand", "category": "Human Body", "meaning": "(See Food)"}, {"id": "righteous-men", "label": "Righteous men", "category": "Types of People", "meaning": "(See Scholars, Shepherd)"}, {"id": "righteous-people", "label": "Righteous people", "category": "Types of People", "meaning": "(Companions of God's Prophet, upon whom be peace, Followers, Successors) Seeing God's blessed people and His righteous ones, or any of the early companions of God's Messenger, whether such a companion is known or not in a dream, represents blessings in one's life and denotes one's correct following of their example, and their advice or comments in one's dream must be heeded. To see oneself as one of such true ones, or to enter their circles in a dream, means that one is following their example and enjoying or suffering similar trials to theirs, then one will triumph over one's enemies. To see one of the companions living in a city in a dream also represents the joy, happiness, prosperity, and justice the inhabitants of such a city enjoy under the leadership of a righteous governor. (Also see Companions of the Prophet, Scholars, Serving, Shepherd)"}, {"id": "rigor", "label": "Rigor", "category": "Other", "meaning": "(See Harshness)"}, {"id": "rind", "label": "Rind", "category": "Other", "meaning": "(See Shell)"}, {"id": "ring", "label": "Ring", "category": "Objects", "meaning": "In a dream, a ring represents peace, tranquillity, authority, a wife, a child, or a job, the reward of which will equal the value and size of the gemstone that is placed on it. If one's wife is pregnant, and if he sees himself wearing a golden ring in a dream, it means that she will give birth to a son. The king's ring in a dream represents his kingdom. Cutting off a tight ring with a pair of pliers in a dream means the end of one's authority. Any incrustations on one's ring in a dream represent his goals. If the gemstone of one's ring falls in a dream, it may mean the death of his child or the loss of his business. A broken ring in a dream means divorce. Wearing a ring made of iron in a dream means that one will receive benefits, though with great strain on oneself. Wearing a golden ring carrying a precious stone in a dream means that such benefits will come with ease. If it is a plain ring or a band with no stone, it means engaging in a strenuous project and getting nothing out of it. Rings made of ivory or from an animal's horn in a dream represent glad tidings for a woman. Seeing someone in authority stamping a document with his ring as a seal in a dream means that one will receive an important political appointment. If one who is accustomed to wearing a silver ring sees himself offering it as a gift to whoever he wishes in a dream, it means that he will preside over an honourable post. Wearing the governor's ring in a dream means an appointment as a dignitary, or inheriting such a rank from one's father. If one's father does not hold such a position, then it means the opposite of one's wishes. Finding a lost ring in a dream means earning money from a foreign land, or having a newborn son, or it could mean a marriage to a righteous woman. If the stone of one's ring seems unstable in the dream, it means that one will be fired from their job. Removing one's ring in a dream means that one may be removed from his job. If a woman sees herself removing her wedding ring in a dream, it means the death of either her husband or of a close relative. A ring in a dream also connotes a band, an encumbrance. or a shackle. If one's ring disappears and only the stone remains in the dream, it means that once the responsibilities are gone, good memories of the person will remain. A man wearing a golden ring in a dream represents innovation, and the results will bring about afflictions, betrayal, or a revolt. Wearing a tight ring in a dream means that one will be let off from a vicious woman, or that he will be spared from a wicked duty. A borrowed wedding ring in a dream represents an ownership that will not last. If one buys an engraved ring in a dream, it means that he will own something he never owned before, such as a house, a vehicle, or perhaps he may get married, or bear a child. If one sees rings being sold in the open market in a dream, it means that the estates of the high society are for sale, or it could represent foreclosure. If one sees the skies raining rings in a dream, it means that he will conceive a child during that year.  If he is unwed, it means that he will marry a rich and a virgin young woman during that same year. If they are gold rings in the dream, it means that such a woman has lost her wealth. If one places a ring on his little finger, then removes it to place it on his ring finger, then removes it again to place it on his middle finger in the dream, it means that he solicits customers for a prostitute. If one notices his ring sometimes on his little finger, then in his middle finger, in his ring finger, without his doing so in the dream, it means that his wife will betray him with another man. If he sells his ring for pennies or a handful of sesame or a little flour in a dream, it means that he will separate from his wife, though they will have respect for one another, or it could mean that he will offer her a good financial arrangement. Receiving a ring that is inlaid with a precious stone from one's son in a dream represents the good character and qualities of such a son. A stone that is made from worthless glass beads in the dream denotes a weak authority. A ring that is inlaid with a green sapphire in the dream means begetting an intelligent son who will become a great man of knowledge. A wooden ring in a dream represents a hypocritical woman. If a woman is offered a ring in a dream, it means that she will get married, and for a married woman, it means that she will give birth to a son. If the ring in one's dream is interpreted to mean money or clothing, then it represents one's status and high esteem his field. Receiving a ring as a gift in a dream also means happy news, or a marriage to a beautiful woman. Seeing an atheist who publicly brags about his actions and thoughts wearing a ring and turning its stone toward the palm of his hand in a dream, it means that he engages in sodomy. If a believer turns his ring inside during prayers in a dream, then it represents his modesty. Wearing a ring that carries two gemstones, one to the outside and the other to the inside, in a dream means that one may chair two important appointments, material and spiritual ones, or inner and outer ones. Wearing a ring with a carnelian-red stone in a dream means an end to one's poverty. If a pious person, a religious person, or an ascetic receives a silver ring from God Almighty in a dream, it means his salvation on the Day of Judgment. If he receives a silver ring from God's Messenger in a dream, it represents a gift of greater knowledge. If it is gold, iron, or copper, then it has negative consequences, because iron rings represent the chains of the dwellers of hellfire. Somehow, to wear a simple band in one's dream is better than wearing a heavy ring. Heavy rings in a dream may also connote an assassination or deceit. On the other hand, large rings in a dream can also be interpreted to mean something great, or something that entails sizable benefits. Lead rings in a dream mean weak authority. If one sends his ring to some people who return it to him in the dream, it means that he is asking to betroth someone from such a family, but his request will be declined. If one sees his ring being forcefully pulled out from his finger in a dream, it means that he will lose his rank or whatever the ring represents to him. If one loses his ring in a dream, it means that he will experience something he hates to see happening to him. (Also see Games, Solomon's ring)"}, {"id": "ring-polishing", "label": "Ring polishing", "category": "Action", "meaning": "(Gem polishing) A ring stone polisher in a dream represents someone who offends or injures people with his words."}, {"id": "ringdove", "label": "Ringdove", "category": "Animals", "meaning": "(Dove, Pigeon, Turtledove) A ringdove in a dream represents a rebellious son, or a son who lies excessively, or a wife who lacks devotion and tenderness, who is void of piety, who lies constantly, who possesses a difficult character, or who consents only to her own opinion and interpretations of things. A ringdove in a dream also represents a beautiful and energetic woman who likes to show off. (Also see Pigeon, Turtledove)"}, {"id": "ringworm", "label": "Ringworm", "category": "Human Body", "meaning": "(See Herpes)"}, {"id": "ripe", "label": "Ripe", "category": "Other", "meaning": "(See Fresh)"}, {"id": "ripping", "label": "Ripping", "category": "Action", "meaning": "To tear open one's garment in a dream means divorce, or marrying a virgin girl."}, {"id": "rising", "label": "Rising", "category": "Action", "meaning": "(See Ascending in the skies)"}, {"id": "rising-in-station", "label": "Rising in station", "category": "Other", "meaning": "(Rank, Status) In a dream, rising in station means falling in people's esteem. Love to preside over others in a dream means the reversal of one's conditions for the worse. If one sees himself in a dream working hard at winning a leadership position, and if he wins an election in the dream, it means that he will grow in arrogance, then suffer from humiliation. Turning down an offer for a high-ranking position or an elevated station in a dream means earning respect, honour, status, and happiness. (Also see Army's flag, Rank)"}, {"id": "rising-of-the-dead", "label": "Rising of the dead", "category": "Other", "meaning": "(Resurrection) Seeing the rising of all the dead on the Day of Judgment in a dream represents people attending to their daily business and seeking profits, where some will win while others will lose. (Also see Resurrection)"}, {"id": "rising-prices", "label": "Rising prices", "category": "Other", "meaning": "(See Bread)"}, {"id": "rising-up", "label": "Rising-up", "category": "Action", "meaning": "(See Awakening)"}, {"id": "risk", "label": "Risk", "category": "Other", "meaning": "(See Gambling)"}, {"id": "ritual-ablution", "label": "Ritual ablution", "category": "Action", "meaning": "(See Ablution, Ritual bath)"}, {"id": "ritual-bath", "label": "Ritual bath", "category": "Action", "meaning": "(Ablution, Ghusul, Ritual ablution, Wash) A ritual bath (arb. Ghusul. Islamic Law) is customarily performed on a festival day, or before the Friday congregational prayers, before starting a pilgrimage, after recovering from an illness, or is necessitated by the emission of semen either during one's sleep or following marital intercourse. A ritual ablution is also given to a deceased person before his funeral and burial, or otherwise is taken by the undertaker himself after washing the dead. To take a ritual ablution in a dream before the Friday congregational prayers means purifying oneself, washing oneself from sin, repenting from sin, serving one's parents, or being true to one's friends. Taking a ritual ablution for any of the above reasons during the wintertime and using cold water in the dream means distress, trouble, or a sickness. If hot water is used, then it means profits, benefits, and recovery from sickness. Taking a ritual ablution in a dream before attending a festival means getting married. Taking a ritual ablution after seeing either a solar or a lunar eclipse in a dream means an adversity, and the same applies if one takes a ritual ablution in a dream before the prayers of asking for rain. To take a ritual ablution after washing a deceased person in a dream means abandoning one's association with heedless people. If the person who performs such an ablution is mentally deranged, it means that he will wake up cured from his condition. Taking a ritual ablution before joining the sacred pilgrimage in a dream means happiness, success, victory over one's enemy, paying one's debts, or reuniting with one's beloveds. Taking a ritual ablution before circumambulating the sacred House in Mecca in a dream means working for one's livelihood, serving rich people, or caring for one's wife and parents. If a sick person sees himself taking a ritual ablution, then putting on a new garment in a dream, it means that he will soon recover from his illness. Taking a ritual ablution in a dream also could mean the release of a prisoner, payment of one's debts, dispelling one's distress, or it could mean richness, prosperity, attending the sacred pilgrimage in Mecca, or having a successful business. If one does not put on a new garment after taking his ritual ablution in the dream, it means that he will be able to lighten his burdens or recover his good health. Walking into a pond, or descending a well, or stepping into a bathtub to take a bath in a dream means marriage. Washing oneself with soap during such an ablution means dispensing of one's debts, or dispelling one's stress. Washing one's garment after taking a Ghusl in a dream means correcting one's conduct, pursuing the correct religious life, paying one's debts, or washing away one's filth. If one sees a deceased person washing himself before his burial in a dream, it means relief for one's dependents and an increase in their wealth after him. Giving a ritual ablution to a deceased person in a dream also means that someone will repent for their sins at the hand of the undertaker. If a deceased person asks someone to wash his clothes for him in a dream, it means that he needs someone to pray for him, or to intercede on his behalf before his Lord, or to pay charity for the benefit of his soul, or to pay his debts, or to fulfill his will, or to do him justice. If does fulfills the deceased person's wish and washes his clothes for him in the dream, it means the redemption of such a person. (Also see Ablution)"}, {"id": "ritual-impurity", "label": "Ritual impurity", "category": "Other", "meaning": "(See Excretion, Feces)"}, {"id": "rituals-of-the-pilgrimage", "label": "Rituals of the pilgrimage", "category": "Action", "meaning": "(See Arafat, Circumambulation, Cradle of Ismail, Kaaba, Mina, Muzdalifa, Pelting stones, Responding, Sahi, Station of Abraham, 'Umrah)"}, {"id": "river", "label": "River", "category": "Water", "meaning": "In a dream, a river represents a noble and great person. Walking into a river in a dream means befriending or encountering such a person. Drinking from a river in a dream means trials, but if the water is clear, it means enjoying prosperity and a happy life. Jumping from one bank of a river to the other in a dream means escaping from adversities, dispelling distress or anguish, and it means winning victory over one's enemy. In a dream, a river also denotes travel. Swimming in a river in a dream means working in the government. If the river runs through the streets and markets, and if one sees people bathing in it or taking their ritual ablution in it in one way or another in a dream, such a river then represents the justice of a ruler. If the river floods the streets or runs through people's homes and damages their properties and personal belongings in the dream, then the river represents an unjust ruler, or it could represent an invading army. If a river flows from one's house and causes no harm to anyone in a dream, it represents one's good intentions or deeds. If one becomes a river in a dream, it means his death. Murky waters in a dream signify worries and fearing a great man. Crossing from one side of a river to another in a dream means dispelling one's fears or worries. It also could mean severing one's association with such a man only to meet with another one. Jumping from the middle of a river to the riverbank in a dream means escaping from the wrath of a ruler. Losing something in a river means suffering harm and damage from a ruler. A river flowing inside one's house in a dream means prosperity. If one sees people drinking from it in a dream, it denotes his generosity and sharing of his wealth with needy people, or it could mean imparting knowledge to others. If a poor person sees a river flowing inside his house in a dream, it means that he will drive a member of his household out of his house because of an abominable and sinful act, or adultery. A river in a dream also means a good deed or a regular income. A river with murky and putrid waters in a dream represents hellfire. Seeing one of the heavenly rivers of paradise in a dream means prosperity. The heavenly river of milk in a dream represents God's gift of the innate knowledge and criterion which is given to His creation, and it represents submission to His sovereignty and obedience to His commands. Seeing the heavenly river of non-intoxicating wine in a dream means elation and intoxication from one's love for God Almighty. Seeing the heavenly river of honey in a dream means knowledge or the Holy Qur'an. Drinking from Egypt's Nile in a dream means receiving great wealth, gold, and power. (Also see Euphrates, Kawthar, Walking on water, Water)"}, {"id": "rivulet", "label": "Rivulet", "category": "Water", "meaning": "(See Fountainhead, Spring, Stream)"}, {"id": "road", "label": "Road", "category": "Earth", "meaning": "(Avenue, Direction, Path, Trail, Way) A road in a dream represents the divine law. Seeing many roads in a dream denotes deviation from God's path, or it could mean religious innovation. Walking on a side road, or yielding at a fork in a dream, means going astray. If a highway robber attacks someone in a dream, it means that he will suffer from the loss of a friend. If one sees a ruler strolling through a rugged road in a dream, it means that he will establish justice and pave the way to righteousness and prosperity. A straight road in a dream represents God's path, or it could represent one's true faith in God's revelations, or in following the practice of God's Messenger, upon whom be peace, or following the guidance of a teacher or a shaikh. Walking on a straight path in a dream means repenting from one's sins and finding guidance. Seeing many roads in a dream means hesitancy, fluctuations in one's faith, doubt, heedlessness, or apostasy. A road in a dream also represents a craft, eternity, the past, aging, continuity, the good example, or the bad example. A boat following the correct sea lane in a dream means salvation. A road in a dream also represents a woman, one's livelihood, truth, or death. If a merchant sees himself walking on a road in a dream, it means that he will find new avenues to earn more money. A hidden road in a dream means pride, innovation, and self-deception. (Also see Lane, Roadless terrain, Wending one's way)"}, {"id": "roadless-terrain", "label": "Roadless terrain", "category": "Earth", "meaning": "(Rugged terrain) Walking a rugged terrain, then suddenly seeing oneself walking through plains in a dream, means overcoming one's difficulties. Walking through roadless terrain in a dream also means stress, adversities, toiling, stagnation of one's business, or it could mean looking into the ample opportunities of one's life. A roadless terrain in a dream also means fear of wrongdoing, straying from the path of righteousness, or walking the avenues of innovation. A roadless terrain in a dream also means dullness or stupidity, while a plain in a dream signifies intelligence and keenness. (Also see Road)"}, {"id": "roaring", "label": "Roaring", "category": "Action", "meaning": "(Clamour) In a dream, roaring means witnessing social disorder, a public outcry, participating in a religious festival, or in an important event that involves the interest of all people. (Also see Shout, Sound of animals)"}, {"id": "roast", "label": "Roast", "category": "Food", "meaning": "(See Boiler, Deep frying, Kettle)"}, {"id": "roasted-meat", "label": "Roasted meat", "category": "Food", "meaning": "(Grilled meat, Restaurant) To buy roasted or grilled meat from a restaurant in a dream means enrolling one's children in a school and entrusting them to a good teacher to educate them and properly train them. The owner of such a restaurant represents an educator, a trainer, or a shaikh. Buying from him in a dream also means hiring a worker who is trained at the hands of an experienced master. If one sees himself roasting or grilling meat in a dream, it means that he may become a tax collector, a physician, a jailer, a torturer, a thief, or a murderer. Seeing someone roasting meat over a fire in a dream may denote a wedding, a picnic, or celebrating the birth of a new child. If the meat is well-cooked in a dream, it means good news. Otherwise, if the meat is still uncooked in the dream, it means a headache and stress caused by one's son. Roasting a whole sheep in a dream means money. Eating the meat of a roasted sheep in a dream means money earned through one's son. Roasting a calf in a dream means appeasement of one's fears, or news about one's wife giving birth to a son, or it could mean standing in court before a judge. Eating anything that is touched by fire in a dream means profits. If one sees a roasted leg of sheep talking to him in a dream, it means that he will escape from an accident, a danger, or gain a strong foothold, or become well established in this world. A broiled rib in a dream represents a woman, for Eve was created from Adam's rib. The chest represents plants and servants. The belly represents the children. A roasted leg in a dream represents a woman's earnings that her husband regularly swindles from her. If it is uncooked, then it means slander or backbiting. Eating roasted or boiled meat in a dream also could mean hard-earned money, fears, sorrows, pain and suffering, an illness, or persecution. Broiling a female sheep, or a ewe, in a dream represents an illness that may befall one's mother, wife, or a relative. Broiling meat in a dream also means strength, marriage, health, wealth, the arrival of a traveller, love, unity, spying, telling on others, losing all benefits, squandering money, severing one's relationship with his family, cutting one's blood ties, or it could denote a fever. (Also see Stakes)"}, {"id": "roasting", "label": "Roasting", "category": "Action", "meaning": "(See Boiler)"}, {"id": "robber", "label": "Robber", "category": "Types of People", "meaning": "(Thief) In a dream, a thief represents a liar, or humiliation inflicted upon such a person. (Also see Crocodile, Robbery, Thief)"}, {"id": "robbery", "label": "Robbery", "category": "Action", "meaning": "(Burglary, Garding, Possessing) In a dream, a robbery means adultery or usury. If the thief is unknown in the dream, then he represents the Angel of Death. If the thief is known to the owner of the house, it means that he will benefit from his knowledge, his trade, a good word of wisdom, or from someone's advice. If an unknown thief enters one's house and steals his washing basin, or his blanket, or a feminine item, or a similar house item in a dream, it may mean the death of one's wife, or a woman in his immediate family. If a known thief robs someone of his money in a dream, it means that he slanders him. If it is an unknown old man in the dream, it means that a close friend will backbite him. A robbery in a dream also has positive connotations, except for a swaggerer who lives on betraying others. If one sees himself sneaking up to steal something in a dream, it means that thieves will burglarize his house or business. If one sees himself stealing something in a dream, it means that he will commit adultery or lie. (Also see Thief)"}, {"id": "robe", "label": "Robe", "category": "Objects", "meaning": "(See Garment, Raiment)"}, {"id": "roc", "label": "Roc", "category": "Animals", "meaning": "(arb. Rukhkh: A legendary Arabian bird.) Seeing the legendary giant roc in a dream means fast-traveling news coming from Western regions, or it could represent distant travels, playing with words, taunting with a serious subject, or just prattling."}, {"id": "rocking-chair", "label": "Rocking chair", "category": "Objects", "meaning": "In a dream, a rocking chair means intelligence, clarity, or it could represent a hard-working student."}, {"id": "rocks", "label": "Rocks", "category": "Earth", "meaning": "(Stone) Mountain rocks in a dream represent strong believers who hold fast to their religious duties. If one sees himself trying to lift a heavy rock, testing his strength in a dream, it means that he will face a strong opponent. If he succeeds at lifting it in the dream, it means that he will win his battle. Otherwise, it could mean that he will lose it. If one sees stones hitting him, or falling over his head in a dream, it means that his superior will delegate heavy responsibilities to him, compel him to do a personal favour, depend on him, or impose a service on him. In this case, it means that one's advice will have an effect, and their opinion will be respected. Throwing stones in every direction from a high altitude in a dream means being unjust toward others, or it could mean being in a position of strength. If one sees women throwing stones at him using a slingshot in a dream, it means sorcery and a bad spell. If a poor person sees himself hitting a rock with a staff to split it, and suddenly water gushes forth from it in the dream, it means that he will become rich. A rock in a dream also represents hard-working women who are patient and bear their sufferings with determination. A rock in a dream also means longevity, construction, forgetfulness, cattle, impudence, shamelessness, fornication, a dissolute life, immorality, or heartlessness. Seeing a town scattered with rocks in a dream could also mean lower prices. If a rock is interpreted as a rank, then it means a lasting one. If it denotes one's wife, then it means that she is patient and content. A rock in a dream also represents a threshold, a house, or a statue. Seeing a mountain of rocks in a dream represents heartless, brutal, and cruel men, or it could denote their dwellings. If one sees himself drilling a hole into a rock in a dream, it means that he is searching for something hard to get, though he will be able to reach as far as he reaches through drilling in his dream. Descending upon a rock in a dream is interpreted the same as descending upon a mountain in a dream. Rocks in a dream are also interpreted to mean dead people, heedlessness, ignorance, or immorality. (Also see Stone)"}, {"id": "rodent", "label": "Rodent", "category": "Animals", "meaning": "(See Mouse)"}, {"id": "roll-up", "label": "Roll up", "category": "Action", "meaning": "(See Wrap up)"}, {"id": "roller", "label": "Roller", "category": "Tools", "meaning": "(Any tropical bird of the Coraciidae family, Eurasian roller, Canary that rolls or trills its notes.) In a dream, a roller represents a beautiful and rich woman."}, {"id": "rome", "label": "Rome", "category": "Other", "meaning": "(Italy) Seeing the city of Rome in a dream means attainment of one's goal, or it could denote the defeat of his purpose."}, {"id": "roof", "label": "Roof", "category": "Objects", "meaning": "In a dream, a roof represents a noble and well-respected woman or man. If one sees himself running on top of a roof in a dream, it means that he will be struck with a calamity. Sitting on top of a roof in a dream during the summertime means comfort, dispelling aggravations, recovering from an illness, or divulging secrets."}, {"id": "roof-gutter", "label": "Roof gutter", "category": "Objects", "meaning": "(See Gutter, Roof)"}, {"id": "rook", "label": "Rook", "category": "Animals", "meaning": "(Carrion crow, Crow, Raven) Capturing a rook in a dream means receiving an inheritance, or it could mean presenting the truth before a jury in a court of justice that will be refuted, then presenting the judge with a false version that will be accepted. A rook in a dream also represents highway robbery. (Also see Crow)"}, {"id": "room", "label": "Room", "category": "Objects", "meaning": "(See Chamber)"}, {"id": "rooster", "label": "Rooster", "category": "Animals", "meaning": "(Fighter) In a dream, a rooster represents the man of the house, and a chicken represents the lady of the house. If one is offered a rooster in a dream, it means that he will beget a son who will spend his life serving others. A rooster in a dream also represents a man of bad character who mixes serious talk with joking, and whose words carry no weight. A rooster in a dream also represents a servant who has compassion toward his master. Receiving a rooster as a gift in a dream means making peace with a friend. If one sees himself slaughtering a rooster in a dream, it means that he does not heed the call to prayer. A rooster, hence, represents the caller to prayers. Seeing a rooster in a dream also denotes an increase in one's wisdom and knowledge, or frequenting the circles of knowledge. If one becomes a rooster in a dream, it means that he may die shortly, or it could mean that he will become knowledgeable about setting a timetable for the daily prayers. A rooster in a dream also represents a preacher, a reader of sermons, a singer, a mate who commands good but does not practice it, a sexually obsessed person, a broker, a guard, a generous man, a man with good will and determination, or a man with a large family who gives preference to helping others, and contents himself with little."}, {"id": "roots", "label": "Roots", "category": "Plants", "meaning": "(Edible roots. See Taro)"}, {"id": "rope", "label": "Rope", "category": "Objects", "meaning": "(Cable, Hawser) In a dream, a rope represents an agreement, a promise, or a covenant. A rope that is extended down from the heavens in a dream represents God's Book. However, a rope in a dream also represents rank, respect, and prosperity, or it could mean deception, misleading others, or sorcery. Holding onto a rope in one's dream represents one's strict adherence to God's path. If the rope is made from fibres in the dream, it means that the one holding it is a rough person. If it is made from leather in the dream, then it represents a bloody person. If the rope is made from wool in the dream, then it represents a religious person. Twisting a rope in a dream means going on a trip. Twisting it around one's neck in a dream means getting married. Throwing it over one's shoulders in a dream means an important appointment resulting from a business trip. Twisting one's beard to make a rope out of it in a dream means perjury, receiving a bribe, and giving false testimony. Twisting a rope, making one, or measuring it in a dream means traveling. Attaching a rope to a wooden stick or a staff in a dream means indulging in an evil act or engaging in sorcery. (Also see Cable)"}, {"id": "rose-oil", "label": "Rose oil", "category": "Other", "meaning": "(See Rose)"}, {"id": "roses", "label": "Rose(s)", "category": "Plants", "meaning": "(Blossoms, Kiss) In a dream, a rose represents a noble person, a woman, a newborn son, or it could represent the homecoming of a long-awaited traveller. Plucking roses from a rosebush in a dream means harvesting honour, love, prosperity, and blessings. Kissing a white rose in a dream means kissing a Godfearing woman. Plucking a red rose in a dream means kissing a fun-loving woman. Smelling the fragrance of a yellow rose in a dream means kissing a sick woman. A bouquet of roses in a dream means kisses, one after the other. A rosebud in a dream means a miscarriage. A rose in a dream also represents an estranged wife, or it could mean a dying woman, a losing business, a short-lived happiness, or a promise that does not last. Receiving a rose from a young man in a dream means receiving a promise that will not hold too. Seeing a crown of roses over one's head in a dream means getting married. Roses on a tray in a dream signify the pleasure of youth that does not last, or they could denote the temporary joy of this world. Roses in a dream also signify praiseworthiness or enjoying a good reputation. Rose oil or attar, which is made from the petals of damask roses, in a dream, means intelligence, clarity of mind, and a friendly and gentle person. If a sick person sees himself lying on a bed of flowers in a dream, it means that he might die within forty days, because forty days represent the life span of a rose blossom. Cutting off a rosebush in a dream means distress. Harvesting roses in a dream means joy."}, {"id": "rose-water", "label": "Rose-water", "category": "Drinks", "meaning": "(See Distilled water)"}, {"id": "rosebush", "label": "Rosebush", "category": "Plants", "meaning": "(See Rose)"}, {"id": "rough", "label": "Rough", "category": "Other", "meaning": "(See Rude)"}, {"id": "row", "label": "Row", "category": "Action", "meaning": "(Line) To see people standing in a row in a dream means love and unity, performing one's duties, or it could mean attending a congregational prayer."}, {"id": "rubber-stamp", "label": "Rubber stamp", "category": "Tools", "meaning": "(See Ring, Seal)"}, {"id": "rubbing-grease", "label": "Rubbing grease", "category": "Action", "meaning": "(See Grease)"}, {"id": "rudders", "label": "Rudders", "category": "Tools", "meaning": "(See Ship)"}, {"id": "rude", "label": "Rude", "category": "Mood", "meaning": "(Coarse, Rough) If someone in authority becomes rude, or if he is witnessed to be rude in a dream, it means loss of his job."}, {"id": "rue", "label": "Rue", "category": "Plants", "meaning": "(Peganum harmala, L., bot. Herb of grace) A wild African rue plant, the seeds of which resemble sesame seeds. Seeing it in a dream means investing lawful money to save a bad investment from an unlawful source. A dream, also known as the herb of grace, means great profits or multiplying one's earnings."}, {"id": "ruffled-hair", "label": "Ruffled hair", "category": "Human Body", "meaning": "In a dream, seeing one's hair ruffled means stinginess and a love to hoard money, or doing little for others."}, {"id": "rug", "label": "Rug", "category": "Objects", "meaning": "(Mockado carpet, World) In a dream, a rug is interpreted to represent the world."}, {"id": "rugged-terrain", "label": "Rugged terrain", "category": "Earth", "meaning": "(See Roadless terrain)"}, {"id": "ruhaniyyeen", "label": "Ruhaniyyeen", "category": "Angels", "meaning": "(See Angels)"}, {"id": "rukuah", "label": "Rukuah", "category": "Other", "meaning": "(See Bowing in prayers)"}, {"id": "ruler", "label": "Ruler", "category": "Tools", "meaning": "(See Governor)"}, {"id": "rumble", "label": "Rumble", "category": "Action", "meaning": "(See Murmur)"}, {"id": "rumbling-of-one's-stomach", "label": "Rumbling of one's stomach", "category": "Human Body", "meaning": "In a dream, the rumbling of one's stomach means a family dispute, an argument, or an antagonistic competition between relatives. (Also see Body)"}, {"id": "rump", "label": "Rump", "category": "Human Body", "meaning": "(See Backside)"}, {"id": "running-away", "label": "Running away", "category": "Action", "meaning": "(Escape, Fear, Take flight) Running away from something in a dream means turning to God Almighty and seeking refuge in Him for safety and protection. Running away in a dream also could mean receiving an appointment, or it could mean repentance from a sin, or it could mean one's death. If one sees himself running away to escape from an enemy he fears in a dream, it means that he will be safe. If a man of knowledge or a scholar sees himself running away from an enemy in fear in a dream, it means that he will be asked to sit as a judge or to govern. If one sees himself running away but has no fear in the dream, it means his death. (Also see Escape from danger, Take a flight)"}, {"id": "rupture-of-relations", "label": "Rupture of relations", "category": "Other", "meaning": "(Breach, Break, Enmity, Rift, Cutting off) Enmity among relatives and rupture of relations in a dream means straying away from God's path, heedlessness, paying a penalty, or it could mean suffering from being exiled as a punishment. (Also see Enmity)"}, {"id": "rural-warden", "label": "Rural warden", "category": "Types of People", "meaning": "(Keeper, Plantations guard, Warden) In a dream, a rural warden represents a rich person. If he looks at walnut trees in the dream, it means that he will control business interests for foreign people. If a warden looks at glass in a dream, it means that he will guard women's interests."}, {"id": "rust", "label": "Rust", "category": "Other", "meaning": "(Corrosion, Oxidize, Smut) In a dream, rust or corrosion represents an ostentatious and an affectatious person who displays piety and devotion during the day and contempt during the darkness of the night. It also could represent a thief, a highway robber, or a weak, tardy, and negligent person, or a person who hoards money and likes to live alone."}]