[{"id": "table", "label": "Table", "category": "Objects", "meaning": "(Dining table) A dining table with its food ready to serve in a dream means blessings, accepting an invitation to dinner or lunch, financial comfort, status, and winning victory over one's enemy. In this case, one's enemy is hunger. The food placed on the table represents a bounty. Clearing the dinner table in a dream means cessation of comfort and blessings. The dining table of one's house in a dream represents his livelihood and sustenance, an important project that requires the help of many people, or a great person who is gracious, true, and generous. Sitting on such a table in a dream means joining the company of such a great man. If the dining table is topped with clean food and fresh bread in a dream, it means love between friends and brethren. To have little food and some bread on the table in a dream means a lack of such love between brethren. Accepting the invitation to share a loaf of bread with someone in a dream means love, unity, and prescribing to the prophetic traditions. If one sees one or two dishes on his table in a dream, it means profits for oneself and sustenance for his dependents. Having a good appetite in a dream means longevity. If the dining table is cleared after one's meal in a dream, it denotes the conclusion of one's life. If a crowd of people sits on a table to partake of their meal in a dream, they represent one's dependents. If two opponents sit on the same table in a dream, it means war, and particularly if there is broiled meat and herbs on the table. The dining table in the dream then represents the battlefield, and eating their meal means fighting. A dining table in a dream also represents piety. If one shares his meal in a dream, it means that he will meet new friends and enjoy their company, then a conflict will arise concerning his livelihood and earnings. (Also see Food, Guest, Invitation, Hospitality, Table)"}, {"id": "table-companion", "label": "Table companion", "category": "Types of People", "meaning": "(See Messmate)"}, {"id": "table-of-contents", "label": "Table of contents", "category": "Other", "meaning": "(Chapters, Drawers, Scrolls) In a dream, the table of contents represents the subject of a hardcover book containing the bezels of wisdom, or a book of knowledge. It also means a rich woman, a rich man, a report card, forthcoming benefits, a register, an astrological sign, a scroll, or a drawer."}, {"id": "tablet", "label": "Tablet", "category": "Objects", "meaning": "(Blackboard, Preserved Tablet, Records, Scrolls) Seeing the heavenly Preserved Tablet in a dream means unveiling one's actions and thoughts, glad tidings for someone suffering from adversities, recovering from an illness for an ailing person, or falling into sin for people whose indulgence in abominable actions is a common way of life. As for godly and righteous people, seeing the Preserved Tablet in a dream means guidance relating to what God Almighty has written of commands and prohibitions. As for niggardly people, seeing the Preserved Tablet in a dream means acquaintance with one's written shares and certainty about one's limitations and his life in this world. Seeing it also means preserving knowledge, cataloguing references, or saving money for one's family and heirs. It also represents a guardian for one's properties, a treasurer, the keeper of one's secrets, or a controller. Seeing the Preserved Tablet in a dream also could denote enjoying peace after experiencing fear. If a ruler sees the Preserved Tablet in a dream, it means that his sovereignty will expand, or it could mean that he will discover a great treasure. As for the tablets that were revealed to God's prophet Moses, upon whom be peace, seeing them in a dream represents witnesses, spiritual guides, guidance, or admonition. A wooden blackboard in a dream represents one's wife, child, farmland, or finding peace\" after suffering from fear, or it could mean knowledge if one is a seeker of such avenues. In general, all boards in a dream represent admonition or prohibition of sin. Receiving a writing tablet from an Imam in a dream means an appointment to leadership, knowledge, understanding, or becoming an Imam, except if what is written on the blackboard in the dream implies admonition to do good, then the tablet means guidance and mercy. If the blackboard is made of iron in the dream, it means that one will beget a son who will become a great scholar and a strongman. A polished board in a dream means that one's son will become a man of courage who accomplishes what he intends, acquires what he wants, and who will rarely be defeated. If the blackboard is corroded in the dream, it means that one's son will have no dynasty. If the blackboard is made of stone in the dream, it means that his heart will be like a rock. If the blackboard is made of copper in the dream, it means that one's son will grow to be a hypocrite. If it is made of lead in the dream, it means that one's son will be an effeminate person. A tablet in a dream also denotes a woman, and the writing on it represents her children, or it could represent an intelligent and good-natured boy who accepts what he learns from his teacher. Receiving a blackboard from someone in authority in a dream means gaining power. If a pregnant woman sees a blackboard in a dream, it means that she will give birth to a son."}, {"id": "tahayyat", "label": "Tahayyat", "category": "Action", "meaning": "(arb. Testimonial greetings) The last segment of the regular Islamic prayers is recited in a sitting posture. Once completed, one may ask for their personal needs or pray for others. If one reaches this segment of his prayer in a dream, it represents a condition or an agreement that must be fulfilled between two partners, or it could mean finding a guardian for one's intended wife (i.e., her father, uncle, brother, etc.), without whom the marriage is not legitimate. Reciting the Tahayyat in a dream also means bartering material property for spiritual gains."}, {"id": "tail", "label": "Tail", "category": "Human Body", "meaning": "Having a tail in a dream means having a following of people or students."}, {"id": "tailor", "label": "Tailor", "category": "Types of People", "meaning": "(Couturier, Marriage) A tailor in a dream represents unity, a peacemaker, a scribe, a secretary, or an officiant who conducts the marriage ceremony and witnesses the signing agreement. A tailor in a dream also represents someone who regrets his wrongdoing, or amends his conduct for the better. To become a tailor and sew one's garments in a dream means struggling to build one's livelihood. If one sees himself unable to do a good sewing job in a dream, it means that he is trying to bring opposites together but to no avail. Sewing a robe for a woman in a dream means that he will be afflicted with a major trial. If one sees himself as a tailor or altering garments in a dream, it means prosperity, setting up a business venture, getting married, having a progeny, or putting things where they belong. A tailor in a dream also represents piety and a good character. (Also see Shoemaker, Alterations)"}, {"id": "tailoring", "label": "Tailoring", "category": "Action", "meaning": "(See Alterations)"}, {"id": "take-flight", "label": "Take flight", "category": "Action", "meaning": "(Flee, Run away) If one sees himself turning and running away in the face of a battle in a dream, it means that he may contract a venereal disease or suffer from syphilis. Taking flight in a dream also may mean reverting to what is proper. On the other hand, it may mean falling into sin to earn God's wrath and the despise of the common people. If one sees himself taking refuge in a group of people, enticing them to fight in a dream, it means that he is adventuring with his head by walking the path of evil, or by backbiting others. (Also see Escape from danger, Running away, Turning)"}, {"id": "taking-the-middle-course", "label": "Taking the middle course", "category": "Action", "meaning": "(See Middle course)"}, {"id": "taking-the-road", "label": "Taking the road", "category": "Action", "meaning": "(See Wending one's way)"}, {"id": "talbiyyah", "label": "Talbiyyah", "category": "Action", "meaning": "(See Responding)"}, {"id": "talisman", "label": "Talisman", "category": "Objects", "meaning": "(See Amulet)"}, {"id": "talkative", "label": "Talkative", "category": "Feelings", "meaning": "(See Exhaustion from speaking, Spool)"}, {"id": "talking", "label": "Talking", "category": "Action", "meaning": "(See Exhaustion from speaking, Speaking)"}, {"id": "tall-person", "label": "Tall person", "category": "Types of People", "meaning": "(See Figure, Tallness)"}, {"id": "tallness", "label": "Tallness", "category": "Feelings", "meaning": "(Height, Size) To see oneself taller than usual in a dream means an increase in knowledge and wealth. If a man of authority sees that, it means expansion of his power. If he is a merchant, it means business prosperity. If one sees himself extremely tall and beyond the tallest human being in a dream, it means the nearing of his death, or it could mean his downfall. It is ominous for a tall person to see himself short in a dream, for it also denotes falling in rank, losing respect, or nearing one's death. Even seeing oneself shorter in a dream means death. If one sees his figure taller in a dream, it means that his authority will expand and he will win victory over his enemies. Tallness of one's figure in a dream also denotes longevity. If a short person sees himself tall in a dream, it denotes self-deception and boastfulness, or it could represent his stinginess. (Also see Figure)"}, {"id": "tallow", "label": "Tallow", "category": "Objects", "meaning": "(See Fat)"}, {"id": "tallow-chandler", "label": "Tallow-chandler", "category": "Types of People", "meaning": "(Wax-chandler) In a dream, a chandler represents festivities, joy, happiness, death, illness, guidance, knowledge, desire, or crying."}, {"id": "tamarisk", "label": "Tamarisk", "category": "Trees", "meaning": "(bot.) In a dream, tamarisk represents someone who hurts the rich and benefits the poor. (Also see Tree)"}, {"id": "tamarisk-tree", "label": "Tamarisk tree", "category": "Trees", "meaning": "(See Tamarisk, Tree)"}, {"id": "tambourine", "label": "Tambourine", "category": "Objects", "meaning": "(Drum, Musical instruments) In a dream, a tambourine means adversities, pain, and suffering. It also means fame for the one carrying it. If a girl dancer carries it in a dream, it means that she may win a lottery or acquire a publicly known fortune. The sound of a tambourine in a dream represents a recognized and baseless fallacy. Seeing a man carrying a tambourine means fame for him and for whoever accompanies him in the dream. A woman carrying a tambourine in a dream also means that she will become famous, or it could indicate a new social trend. In general, when musical instruments are used in one's dream, playing them in a festival, a wedding, or in any type of celebration means trials. (Also see Musical instruments)"}, {"id": "tan", "label": "Tan", "category": "Other", "meaning": "(Brown skin) In a dream, tan skin represents mixed ancestry."}, {"id": "tangle", "label": "Tangle", "category": "Other", "meaning": "(See Fog)"}, {"id": "tank", "label": "Tank", "category": "Objects", "meaning": "(See Cistern, Vat)"}, {"id": "tankard", "label": "Tankard", "category": "Drinks", "meaning": "(Dull-witted, Dummy, Idiot, Mug) In a dream, a tankard represents a housekeeper or a servant. A tankard or a mug in a dream represents the household servants who consent to sexual abuse or a sexual relationship with their employer. Drinking from a tankard in a dream also means earning money through one's servants or employees. A broken tankard in a dream signifies the death of one's servant or employee. (Also see Mug)"}, {"id": "tanner", "label": "Tanner", "category": "Types of People", "meaning": "(Changing hide into leather or curing it, Dye) Seeing a tanner in a dream is interpreted the same as seeing a cupper. (See Cupping). Both specialties cure something. If one sees a physician becoming a tanner in a dream, it denotes his expertise and the large number of people who benefit from his treatments. Unless one finds the tanning to be faulty, it indicates a non-professional person. If seeing a tanner in a dream is understood to denote material benefits, then in reality, he represents an escape from death. If he is understood in relationship with religious matters, then seeing him means feeding the poor and hungry during a drought or a famine. A tanner in a dream also represents a peacemaker, a physician, or a guardian. However, it is possible to interpret a tanner in a dream to mean distress, adversities, or an unjust person. (Also see Dye, Vat)"}, {"id": "tannery", "label": "Tannery", "category": "Objects", "meaning": "(Leather dying factory) A tannery in a dream has the same interpretation as that of a slaughterhouse. It also represents a school, a fellowship house, or similar places where the mind and spirit are taught and reared to correct oneself, to hold to what is true, and to discard what is false. A tannery in a dream also represents a patient, forbearing, and hard-working woman, a housekeeper, or a child. Perhaps a tannery in a dream also could denote a harsh, wretched, and contemptible woman, though she likes cleanliness and guards herself from others' impurities. (Also see Dye, Vat)"}, {"id": "tanning-drum", "label": "Tanning drum", "category": "Objects", "meaning": "(See Vat)"}, {"id": "tap-dancer", "label": "Tap dancer", "category": "Types of People", "meaning": "(See Dancer, Tap)"}, {"id": "tap-first-meaning", "label": "Tap-first-meaning", "category": "Objects", "meaning": "(African steps, Footsteps, Loud steps, Tap dancing, Sound of walking) In a dream, loud steps represent distinguished, wealthy merchants who are envied for their wealth by everyone, and who are despised for their stinginess."}, {"id": "tap-second-meaning", "label": "Tap-second-meaning", "category": "Objects", "meaning": "(See Suck)"}, {"id": "tapeworm", "label": "Tapeworm", "category": "Animals", "meaning": "Intestinal worms in a dream represent one's relatives and their children. (Also see snake)"}, {"id": "tar", "label": "Tar", "category": "Objects", "meaning": "Hot tar in a dream represents a guard who prevents saboteurs or subversive people from causing damage to one's property. Wearing a garment drenched with tar in a dream means indulging in sin and mixing with its people."}, {"id": "tarantism", "label": "Tarantism", "category": "Other", "meaning": "(See Tarantula)"}, {"id": "tarantula", "label": "Tarantula", "category": "Animals", "meaning": "(Hairy spider, Spider) A tarantula in a dream represents a loathsome and evil woman who interferes with people's business and damages their interests, or who destroys what they repair and denies having anything to do with their sufferings. In a dream, this interpretation is based on the legendary nervous disease, formerly believed to be caused by a poisonous bite of a tarantula. Thus, when this harmless hairy spider is seen in a dream, it also could represent a lethal enemy of a fierce sting, scowling, or a despising look. (Also see Spider)"}, {"id": "tarawih", "label": "Tarawih", "category": "Action", "meaning": "(arb. See Five times prayers)"}, {"id": "taro", "label": "Taro", "category": "Plants", "meaning": "(Edible roots of a tropical plant, Colocasia antiquorum, bot., Large Egyptian potato) Eating taro in a dream means suffering, adversities, and trouble."}, {"id": "tarragon", "label": "Tarragon", "category": "Plants", "meaning": "(bot.) In a dream, tarragon represents a vile person. Tarragon is originally grown from African rue and is sprouted in vinegar for a full year before it is planted to grow a new herb. Tarragon in a dream also represents someone who has learned about pious conduct by associating with pious people before he developed his own. Tarragon in a dream also signifies treachery or betrayal."}, {"id": "tart", "label": "Tart", "category": "Food", "meaning": "(See Pastry)"}, {"id": "tasbih", "label": "Tasbih", "category": "Objects", "meaning": "(arb. See Five times prayers)"}, {"id": "tassels", "label": "Tassels", "category": "Objects", "meaning": "(Fringes) In a dream, tassels represent money, power, evil, falsehood, or a following. A tassel maker in a dream represents evil and doubt, or he could represent a school teacher, or perhaps having a large progeny."}, {"id": "tatter", "label": "Tatter", "category": "Objects", "meaning": "(See Lice)"}, {"id": "tattoo", "label": "Tattoo", "category": "Other", "meaning": "If a person sees his hands tattooed with henna in a dream, it means that he cheats to earn his livelihood, or that he tricks others to get what he needs. Consequently, he will be exposed, and his enemy will rejoice at his misfortune. If a woman sees her hands tattooed in a dream, it means that she will trick someone to repossess her rightfully owned jewellery. If the tattoo is made with gold in the dream, it means performing an old but polite trick. If the tattoo is done with mud in the dream, it means praising God Almighty. If a woman sees the lines of her tattoo mixing, or as though the dye has started to run in the dream, it means difficulties with her children. If a man sees his feet dyed and tattooed in a dream, it means that he will be tried with family problems. If a woman sees her feet dyed and tattooed in a dream, it means that she will suffer from an abusive husband. (Also see Dye, Henna)"}, {"id": "taurus", "label": "Taurus", "category": "Celestial Bodies", "meaning": "(astr. See Moon)"}, {"id": "tavern", "label": "Tavern", "category": "Other", "meaning": "A tavern in a dream means getting high after feeling low and depressed. It also means dispelling one's strains and distress, or it could represent a prostitute, an abused woman, or advertise because of the damages and liabilities a tavern may bring. If one promises to do something, then if he sees a tavern in his dream, the tavern then represents the terms of his agreement, or that he is engaged in a shabby or covert action against his boss. If a sick person sees himself in a tavern in a dream, it means that his time is up. If a pious person sees himself entering a tavern in a dream, it means that he may be lured into temptation."}, {"id": "tax-collector", "label": "Tax collector", "category": "Types of People", "meaning": "Collecting taxes in a dream means compelling someone or forcing him to pay due alms, or it could mean coercing someone to live with him. If one sees himself as a tax collector in a dream, it means that he will earn respect, or that he will be forced to ask everyone for permission regarding everything he does. A tax collector in a dream also means paying one's debts, or he could represent a policeman, an emissary, a treasurer, or a safe."}, {"id": "tax-refund", "label": "Tax refund", "category": "Other", "meaning": "If a ruler or a governor sees himself vomiting in a dream, it means that he will refund the taxes he unjustly collected from them. (See Vomiting)"}, {"id": "taxes", "label": "Taxes", "category": "Other", "meaning": "(Due alms, Property taxes)"}, {"id": "tayammum", "label": "Tayammum", "category": "Action", "meaning": "(arb.) Performing one's ritual ablution but without water in a dream means the nearing of solutions to one's problems. Tayammum is usually performed instead of the regular ablution in the absence of water, or because of a preventing illness, etc.. However, observing the religious rites and substance of the act remains solemn. Tayammum in a dream may also mean a journey or an illness. If the act is performed with a dry surface such as wood, stone, dry sand, earth, or a substance that does not stick to the skin in a dream, it means that one's travel plans may be infeasible, or it could mean that he will become cheap, or pursue his evil desires. To perform tayammum while water is accessible in a dream means falsehood and hypocrisy. It also means hoping for forgiveness while adamantly pursuing the avenues of wrongdoing, giving preference to one's interests in the world over his lasting benefits in the hereafter, preferring masturbation over lawful sexual intercourse, or being a hypocrite, and it could mean recovering from a terminal illness, or release from prison. (Also see Enacting, Ablution)"}, {"id": "teacher", "label": "Teacher", "category": "Types of People", "meaning": "(Bucket, Grammar teacher, Language teacher) In a dream, a teacher represents a strong person who does people favours and particularly those who learn at his hand, unless he takes monetary compensation for his work in the dream. An elementary school teacher in a dream represents a commander, a judge, a scholar, or a trainer. A grammar teacher and a language teacher in a dream represent honour, dignity, exalted rank, helping others, having important connections with people in authority, scholars, or they could represent understanding, clarity of speech, easy life, profits, marriage, children, or parents. A teacher in a dream also represents a bird hunter who presides over the affairs of ignorant people. (Also see Educator, Engraver, Grammarian, Language, Writer)"}, {"id": "teak", "label": "Teak", "category": "Trees", "meaning": "(Indian oak, Timber) In a dream, teak represents a feverish illness."}, {"id": "tearing-down-one's-shirt", "label": "Tearing down one's shirt", "category": "Action", "meaning": "To tear open one's garment in a dream means divorce."}, {"id": "tears", "label": "Tears", "category": "Human Body", "meaning": "(Pearls) In a dream, cold tears mean happiness while warm tears mean sadness. Running tears over one's cheeks without crying in a dream means slander that carries weight. Guarded tears in someone's eyes that do not flow over his cheeks in a dream mean storing illegal money, or disguising the unlawful source of one's income, which one's adversaries will eventually unveil or expose. If such tears are finally shed in the dream, they mean that one will willingly spend such money, or get rid of it, to conceal their act. If one sees tears running from his right eye and entering his left eye in the dream, it means that his son and daughter may engage in sexual intercourse, and he must immediately separate their rooms and teach them about the lawful and the unlawful. Tears that come during yawning in a dream signify payment of an unjust fine. Seeing tears during the daylight time, or under the sun, or in front of a fire in a dream means business losses caused by one of these three elements. Tears in a dream also signify loneliness, leaving one's homeland, or yearning to see one's beloved, or they may represent pearls. (Also see Pearl)"}, {"id": "teasing-bow", "label": "Teasing bow", "category": "Objects", "meaning": "(See Carder, Cotton)"}, {"id": "teenage-boy", "label": "Teenage boy", "category": "Types of People", "meaning": "(See Young man)"}, {"id": "teenage-girl", "label": "Teenage girl", "category": "Types of People", "meaning": "(See Young woman)"}, {"id": "teeth-first-meaning", "label": "Teeth-first-meaning", "category": "Human Body", "meaning": "(Acrimony, Dice, Grasping, Longevity, Migration) Falling teeth in a dream means longevity, or living past one's contemporaries. Collecting one's lost teeth in a dream means longevity, or it could mean having a large progeny. If one cannot find his teeth in the dream, it means that his family will die before him, or that a member of his clan will emigrate to a new land. If one finds a lost tooth in a dream, it means the return of an immigrant to his homeland. If the upper teeth fall into one's hand in a dream, they represent profits. If they fall in his lap in the dream, they mean a son, and if they fall on the floor in the dream, they mean death. If the lower teeth fall in a dream, they mean pain, suffering, sorrows, and distress. Falling teeth in a dream also means paying one's debts. If a tooth falls in a dream, it means payment of a loan, while the number of fallen teeth represents the number of debts to be satisfied. If one's teeth fall without pain or a cause in the dream, then they represent worthless deeds. If they fall because of gum disease or cause pain in a dream, then they mean being forced to part with something from one's house. If the front teeth fall and cause pain and bleeding in the dream, they represent one's incompetence or inability to complete a project. If the front teeth fall without pain or bleeding in the dream, then they mean losing one's property. Falling teeth in a dream also denote a long illness that may not necessarily culminate in death. If one collects his fallen teeth in a dream, it also means that he can no longer conceive children. If one's teeth fall into his lap in a dream, it means having a large progeny. If one's wife is pregnant, and if he pulls out a tooth without difficulty or pain in the dream, it means that his wife will give birth to a son. If his gums bleed, it means that he will forsake his family, except if he owes someone money, then it means that he will be asked to pay, or that he will be forced to comply. Collecting fallen teeth in a dream also means saying something one will regret. If a religious person loses his teeth in a dream, it means that he should be more assiduous in his devotion, and votive fasting will surely help him as a start. If one loses his teeth and finds himself unable to eat properly in a dream, it also means poverty. Falling teeth in a dream also denote spending one's money to acquire spiritual knowledge, then recuperating one's investment through a new and blessed business. (Also see Body, Pain, Tooth)"}, {"id": "teeth-second-meaning", "label": "Teeth-second-meaning", "category": "Human Body", "meaning": "(Setting the tooth on its edge.) To set one's tooth on its edge in a dream means a betrayal carried by a member of one's family, the tooth represents. This includes one's children, wife, partners, or employees. To set one's teeth on edge in a dream also could mean changes in one's behaviour that may lead to a changing attitude on the part of such family members. (Also see Body, Tooth)"}, {"id": "telescope", "label": "Telescope", "category": "Tools", "meaning": "(See Binoculars)"}, {"id": "tell-a-lie", "label": "Tell a lie", "category": "Action", "meaning": "(See Lying)"}, {"id": "telling-the-future", "label": "Telling the future", "category": "Action", "meaning": "(See Perspicacity)"}, {"id": "temple", "label": "Temple", "category": "Other", "meaning": "(Altar, Retreat, Sanctuary) Temples, sanctuaries, or retreats in a dream represent security, peace, finding a shelter away from fear, and victory over one's enemy. A temple in a dream also represents children, weddings, benefits, profits, prudence, or having reservations about one's dealings with others. A Christian temple in a dream represents the clergyman who officiates the masses, or it could represent the recital of Psalms or Gospels therein, and it may denote offerings. (Also see Church, Hermitage, Retreat)"}, {"id": "temples", "label": "Temples", "category": "Human Body", "meaning": "(anat.) In a dream, one's temples represent two noble and blessed sons. Anything that affects them in the dream will affect their sons. Temples in a dream could also mean recovering from an illness. If one is suffering from a migraine headache and sees their temples turn into iron in a dream, it means that they will find a cure for their illness. One's temples in a dream may also be interpreted as money. Plucking out the facial hair from someone's temples in a dream means borrowing money from him, and the lender will take pride in lending him money. If a rich person sees himself plucking out his facial hair in a dream, it means that he may lose his wealth. If a poor person sees that dream, it means that he will repay his debts. (Also see Body¹)"}, {"id": "temptation", "label": "Temptation", "category": "Mood", "meaning": "(See Trouble, Wine)"}, {"id": "tender", "label": "Tender", "category": "Mood", "meaning": "(See Fresh)"}, {"id": "tennis-ball", "label": "Tennis ball", "category": "Objects", "meaning": "(See Ball)"}, {"id": "tent", "label": "Tent", "category": "Objects", "meaning": "(Canopy, Pavilion) In a dream, a tent means travels, a grave, a wife, or a house. A camp of tents in a dream represents clouds. If a tent is raised over someone, and if he is a merchant, it means that his business will grow. If he is a soldier, it means that he will rise in rank. If he is unwed, it means that he will get married. If one sees a white tent raised beside his tent in a dream, it represents a righteous person who commands what is good and forbids what is evil. It also means that he will repent for a hideous sin. If one sees the moon inside his tent in a dream, it means that he will illicit sexual intercourse with a boy or with a young girl from a noble family. Seeing unknown white or green tents in a valley represents the graves of martyrs. (Also see Canopy, Pavilion)"}, {"id": "tent-peg", "label": "Tent peg", "category": "Objects", "meaning": "(See Peg)"}, {"id": "termite", "label": "Termite", "category": "Animals", "meaning": "(Broker, Stockbroker, Wood warm) In a dream, termites represent jealousy, envy, perfidy, competition in knowledge, or the search for arguments. If one sees termites in their carry-on bag, or eating from their staff in a dream, they means their death. Termites in a dream also represent a slanderer who tricks wealthy people to make his commission by advising them to place their money into bad investments. If a sick person sees termites inside his house or clinging to his skin in a dream, it also means his death. If one sees termites eating their wooden door, table, or bed in a dream, they means an illness. Termites in a dream also mean having a large family with little income."}, {"id": "terra-firma", "label": "Terra firma", "category": "Earth", "meaning": "(See Dry Land)"}, {"id": "terror", "label": "Terror", "category": "Feelings", "meaning": "(See Fear, Fright)"}, {"id": "terrorization", "label": "Terrorization", "category": "Action", "meaning": "(Oppression, Suppression, Tyranny) Terrorizing others or oppressing them in a dream denotes a mental sickness, depression, psychological weakness, or actions that will bring their author closer to hellfire. Terrorizing others in a dream represents one's losses and humiliation. Terrorizing people in a dream also means poverty, loss of business, a severe illness, or it could represent profits that will turn into losses. (Also see Oppression)"}, {"id": "testator", "label": "Testator", "category": "Types of People", "meaning": "(See Legal guardian)"}, {"id": "testicles", "label": "Testicles", "category": "Human Body", "meaning": "(Male reproductive glands) In a dream, testicles represent the elements of husband and wife, one's two children, trade, business, doors, doormen, money pouch, or the female members of one's family, including sisters, daughters, mother, or aunts. Whatever affects one's testis in a dream may manifest in events affecting any of the above."}, {"id": "testifying-to-god's-oneness", "label": "Testifying to God's Oneness", "category": "Action", "meaning": "(See Carnelian-red, Tahayyat)"}, {"id": "testimonial-greetings", "label": "Testimonial greetings", "category": "Action", "meaning": "(See Carnelian-red, Tahayyat)"}, {"id": "testis", "label": "Testis", "category": "Human Body", "meaning": "(See Testicles)"}, {"id": "tetter", "label": "Tetter", "category": "Human Body", "meaning": "(med. See Herpes)"}, {"id": "the-frame-of-a-person", "label": "The frame of a person", "category": "Human Body", "meaning": "(See Figure)"}, {"id": "theft", "label": "Theft", "category": "Action", "meaning": "(See Robbery)"}, {"id": "theologian", "label": "Theologian", "category": "Types of People", "meaning": "(See Legist, Scholars)"}, {"id": "thief", "label": "Thief", "category": "Types of People", "meaning": "(Assassin, Illness, Robber) In a dream, a thief represents an illness, a deficiency in one's character, or a physical ailment. If the thief is a black man, it means that the illness relates to one's black bile. If the colour of his skin is red, then it relates to one's blood. If the colour of his skin is yellow, then it relates to his gallstones. If the colour of his skin is white, then it relates to his chest and phlegm. Whatever a thief takes in the dream should be interpreted according to the substance of what he took. If he takes nothing from one's house, then it denotes a passing ailment. If one catches the thief, or holds to his shirt in the dream, it means that he knows the cure. A thief in a dream also represents an assassin, the angel of death, a visitor, or someone asking for marriage. If there is a sick person in the house and a thief enters that house in a dream, it means the death of the ailing person. If a thief comes to one's house and takes nothing from it in a dream, it means the recovery of a sick person from his illness. A thief in a dream can also be interpreted to represent a cunning person, a deceiver, an adulterer, a hunter, a backbiter, someone who asks for things that do not belong to him, a lion, a snake, Satan, eavesdropping, or one's mind, desire, and passions. If a scholar sees a thief in his dream, it means that he will learn wisdom from an anecdote. A thief in a dream also represents a liar, or the humiliation inflicted upon such a person. (Also see Crocodile, Illness, Robbery)"}, {"id": "thigh", "label": "Thigh", "category": "Human Body", "meaning": "(Limb) One's thighs in a dream represent his family or clan. Anything that affects them in the dream will manifest in their family or clan. If one sees his thighs missing something in a dream, it means that he is a foreigner, or that he does not know his lineage or ancestry. Experiencing pain in one's thigh in a dream means harming one's own family or clan. If one sees that a piece of skin is crafted to his thigh in a dream, it means that someone will attribute a son to him, and it will turn out to be a false allegation. Thighs in a dream also represent the pillars of one's house, the head of a household, one's wife, one's husband, son, master, earnings, business, vehicle, or wealth. One's thighs in their beautiful condition in a dream also represent the correctness of one's prayers, or they may represent his garment, tools, or chair. Imputation of one's thigh in a dream means taking a long journey and dying in a foreign country. (Also see Body, Foot, Leg)"}, {"id": "thigh-pain", "label": "Thigh pain", "category": "Human Body", "meaning": "(See Body, Pain)"}, {"id": "thimble", "label": "Thimble", "category": "Tools", "meaning": "A thimble in a dream means money, a child, a wife, a young intelligent worker, a vehicle, travels, or a needed competitor for the better promotion of one's business. A thimble in a dream also means dire need, tight circumstances, difficulties, or perhaps it could represent one who is crafty and who deceives children. Placing a thimble on the wrong finger in a dream means committing adultery, neglecting one's prayers, or falling sick, as the person such finger is falling sick in the dream. (Also see Fingers, Five fingers)"}, {"id": "thinning", "label": "Thinning", "category": "Human Body", "meaning": "(Skin inflammation) If one sees his skin thinned or inflamed between his legs in a dream, it means that he may marry a rich woman who will give him her wealth. If one sees himself shedding his skin or skinning himself in a dream, it represents money he will part with, and if he is sick, it means his death."}, {"id": "thirst", "label": "Thirst", "category": "Feelings", "meaning": "(Desire, Dryness) In a dream, thirst represents stagnation of businesses, dullness of the real estate market, and unsalability of farm products. Thirst in a dream also means poverty, slump, recession, or yearning for a beloved, desiring to be with him, and missing him. Thirst in a dream could also represent religious corruption. If a thirsty person sees himself searching for water but cannot find it in a dream, it means that he will escape from a misfortune. If one sees himself standing thirsty before a source of water or a well but cannot drink from it or reach it in a dream, it means that he will fail to reach his goal. Thirst in a dream also means being corrupt, or it could represent one's need to get married to preserve his chastity."}, {"id": "thorns", "label": "Thorns", "category": "Plants", "meaning": "(Affliction, Bristling with perplexity) In a dream, thorns represent a harsh, difficult, repulsive, and distressful person. Thorns in a dream also represent indebtedness, signing a loan, temptation, degeneration of moral standards, or social unrest. If a thorn pierces someone in a dream, it means that he will be tried with temptations, or that he will be hurt by something he hates. Walking on thorns in a dream means delaying or postponing payment of one's debts upon maturity. Thorns in a dream also represent ignorant and evildoing people who uphold respect for nothing, and who have won neither material nor spiritual success in their lives. Thorns in a dream also represent pain and suffering, complexity of matters, sorrows, distress, difficulties, love, injustice, or harm caused by women. "}, {"id": "thread", "label": "Thread", "category": "Objects", "meaning": "Holding a thread in one's hand in a dream means looking for an alibi or proof to support one's argument and win a case. Twisting a thread, or tying it around someone's neck, then dragging him or her in a dream, represents a pimp soliciting clients for a prostitute. Knots in a thread mean sorcery or evil spells. A white thread in a dream represents the dawn, and a black thread represents the night. (Also see Ball of thread, Pimp, Rope, Spool)"}, {"id": "threat", "label": "Threat", "category": "Action", "meaning": "Receiving a threat in a dream means victory over one's assailant, opponent, or adversary, or it could mean developing a defence mechanism against any danger from that side. If the threat comes from an unknown person, such a person is Satan, particularly if the threat is directed against one's prayers, charitable actions, or devotion. A threat in a dream also represents the trials of a love story. (Also see Slapping on the cheek)"}, {"id": "threshing", "label": "Threshing", "category": "Action", "meaning": "To beat grains out of husks in a dream represents the savings one accumulates from a long and hard-working job. Threshing in a dream could represent money that is earned through someone else's labour, or it could mean acquiring knowledge."}, {"id": "threshold", "label": "Threshold", "category": "Other", "meaning": "In a dream, a threshold represents one's gown, garment, one's adornment, makeup, money, or it may denote closing a subject, spreading it, or it could represent a beautiful woman who embodies all the attributes a man desires, including beauty, good character, intelligence, wealth, and fertility. Buying a new threshold or sitting on one in a dream means that either the husband or the wife may suffer a bodily injury. If one sees himself sitting under the threshold of his door in a dream, it represents an adversity or an illness. If one sees himself being carried over the threshold of his door in a dream, it represents his funeral. (Also see Doorstep, Door lintel, Doorplate)"}, {"id": "thrift-shop", "label": "Thrift shop", "category": "Other", "meaning": "(Also see Used clothing)"}, {"id": "throat", "label": "Throat", "category": "Human Body", "meaning": "(Life, chastity. See Body¹)"}, {"id": "throbbing", "label": "Throbbing", "category": "Human Body", "meaning": "(Also see Palpitation)"}, {"id": "throne", "label": "Throne", "category": "Objects", "meaning": "(See Carriers of the Divine Throne, Chair, Divine Throne)"}, {"id": "throng", "label": "Throng", "category": "Other", "meaning": "(See Crowd)"}, {"id": "throw", "label": "Throw", "category": "Action", "meaning": "(See Cast¹, Thrust)"}, {"id": "throw-in-the-towel", "label": "Throw in the towel", "category": "Action", "meaning": "(See Towel)"}, {"id": "throw-pillow", "label": "Throw pillow", "category": "Objects", "meaning": "(See Pillow)"}, {"id": "throwing-apples", "label": "Throwing apples", "category": "Action", "meaning": "If one sees the ruler or the governor throwing apples at him in a dream, it means that he is sending him his emissaries, and usually, such a dream carries glad tidings. (Also see Cast²)"}, {"id": "throwing-stones", "label": "Throwing stones", "category": "Action", "meaning": "Throwing stones from a high altitude down in every direction in a dream means being unjust toward others, though from a position of strength. (Also see Cast², Stoning, Hazelnut, Rocks)"}, {"id": "thrust", "label": "Thrust", "category": "Action", "meaning": "(Hurl, Press, Shove, Squeeze, Throw) In a dream, thrust means engaging in a narrow-sighted project, entering a close race, entertaining a project of little importance, participating in a project with a narrow or difficult way out, or perhaps it could mean death."}, {"id": "thrusting", "label": "Thrusting", "category": "Action", "meaning": "(See Bullfight, Thrust)"}, {"id": "thumb", "label": "Thumb", "category": "Human Body", "meaning": "If one measures a house or a shop with his thumb in a dream, it means that he will own that place. (Also see Measure)"}, {"id": "thunder", "label": "Thunder", "category": "Weather", "meaning": "(Curse, Omen, Policeman, Warning sign) In a dream, thunder without rain means a scare, a warning, or an ultimatum. It also represents good promises, gracious orders, or the sound of drums. Seeing thunder in a dream means repayment of one's debts, and for a sick person, it means recovering from his illness. Thunder, lightning, and rain in a dream represent fear for a traveller or the greed of a merchant. Hearing about an awesome blast in a distant land in a dream means that the dwellers of that place will be struck with a major calamity or sudden mass casualties. The sound of thunder in a dream represents a murder, a fight, a dispute, an argument, a lack of religious attendance, loss of money, or the release of a prisoner. A thunderstorm with rain when needed in a dream represents a good harvest for that year. Hearing a thunderous sky without seeing the lightning in a dream means an assassination, deception, falsehood, or slander. Hearing the sound of thunder in a dream also means being reprimanded by a higher authority. There are no benefits in hearing the sound of thunder in the darkness without seeing lightning in the dream, this would be interpreted as apostasy or disloyalty. This can be particularly true when it is accompanied by an earthquake. If one hears thunder in its season in a dream, it means good news and blessings. Otherwise, out of its usual season, thunder in a dream represents an army on the move, or a foreign occupation of a country. Hearing the sound of thunder in a dream also represents hymns, praising God Almighty, glorifying Him, or it could mean a sickness, fear, deafness, or the sound of drums in a wedding. If the one seeing the dream is an atheist, it means that he will be guided and have faith in God Almighty. If he is a sinner, it means that he will repent for his sins. Hearing the roaring of thunder in a dream on the first day of October means death. If it is heard during the first six days of that month, it means benefits, or lower prices, but if it is heard near the end of the month, then it means a plague or a disaster. Hearing the sound of thunder at any other time during October in a dream means evil. If it is heard during November in a dream, it means blessings for the land, prosperity, the spreading of God's words in a new land, the falling of a comet in a populated area, the death of a leader, a pollution that will devastate bird life, or a heavy rainstorm with limited damage. If the sound of thunder is heard during the first ten days of December in a dream, it means the death of famous people within the Western hemisphere, inflation, rising prices, degradation of social behaviour, a decrease in harvest, inflation, or playing dirty politics. Hearing the sound of thunder during the last seven days of December in a dream means that the winter will be cold and dry, though the forthcoming spring will be cool and wet. Hearing the sound of thunder in the first six days of the month of January in a dream means that a major event will take place, such as an earthquake, death, destruction, or a war in Iraq. If this dream is witnessed during the last week of the month of January, then it represents a solar eclipse, or the death of a Western leader, a plague, or the birth of a planet that signifies the destruction of a great city on earth. Hearing the sound of thunder on the first day of February in a dream means a good harvest, lowering or stabilization of prices, discovering a new disease in the East, death in the seas, heavy rains in Mecca, fear, devastation and famines in Ethiopia, or that a Western leader will move his armies to the East and control the land for a short period. Hearing the sound of thunder during the first six days of March in a dream means a good harvest, lowering of prices, stabilization of the market, and prosperity. Hearing the sound of thunder at the end of March in a dream means famines, destruction, or that a swarm of locusts may devastate the lands, or it could mean a drought that will kill African cattle. Also in this type of dream, if the sound of thunder is heard on the twenty-first day of April, it means that Western armies will drive East and establish military bases there. If the first of April happens to be a Sunday, then March will be a month of great fear and disturbances in the East, meanwhile, a conflict between the Western armies will end by the death of a Western leader and the defeat of his army. If the dream is seen on the eleventh day of April, it may mean that earthquakes or cyclones will devastate many countries. If the dream takes place on the thirteenth day of April, then it means that inflation will strike and price hiking will burden the common people. If the dream is seen on the seventeenth day of April, it portends a major political dispute between the leaders of the world, and if it is seen on the twenty-second day of April, it means that a disastrous evil will contaminate many societies. If the dream takes place on the twenty-third day of April, it means abundance, falling prices, fertility in the lands, while if it is seen on the twenty-fifth day of April, it will mean price hiking. If it is seen on the twenty-ninth day of April, it means that blessings, fertility, relief, and joy will spread in the land. If the sound of thunder is heard during the first nine days of May in a dream, it means the death of noble and leading people in Turkey. During that period, rain will be in abundance, the land will be fertile, and the farms will be most productive. If the dream takes place between the tenth and the twentieth day of May, it means plagues. If the sound of thunder is heard in a dream during the first ten days of June, it means the death of renowned scholars, people of knowledge, religious leaders, or noble people in Egypt. Meanwhile, prices will fall, and abundance will ease the economy into a major economic turnaround. If the dream is seen during the first six days of July, it means that good rain will fall during the following December and that the land will be fertile. During that year, several Western leaders will die, and a war may take place in Persia. Meanwhile, evil will spread throughout Egypt, and it will be brought about by its leaders. If the dream takes place during the last seven days of July, it means that peace will spread throughout the earth, prices will fall in Iraq and East Africa, and a new disease will affect fruit trees, banana trees, date trees, though wheat will be available in abundance, even if the farmers were concerned about it in the early part of the year. If the sound of thunder is heard during August in a dream, it means blessings for the people in Syria and the people of Azerbaijan on the Caspian Sea. At that time, sea passages will be blockaded, the highways will be forsaken, and a war may take place in China. If the sound of thunder is heard at the end of August in a dream, it means the end of a drought in Egypt, rising prices, death, earthquakes, or major political changes. If the sound of thunder is heard during the first eight days of September in a dream, it. announces a drought during the early part of the year that will be followed by heavy rains and result in a good harvest. It also means that a long and destructive war will take place. If the thunder takes place on the tenth day of September in one's dream, then it means a drought in Morocco. God knows best what He has reserved for His creation, and He is the best of judges."}, {"id": "thunderbolt", "label": "Thunderbolt", "category": "Weather", "meaning": "Thunderbolts in a dream are signs of punishment, illness, or death. If a thunderbolt hits and burns something in the dream, it means false rumours, damages, financial losses, recession, or dumping of merchandise. A thunderbolt in a dream also means a warning for a sinner, the punishment for his crime, devastation, calamities, diseases, tornadoes, plagues, a blast, a major political shift, tyranny, decapitation, a bad death, incineration, burning people alive, or a robbery. If one is under surveillance, then seeing a thunderbolt in a dream means a crackdown on their house or business. If thunderbolts strike people's homes in a dream, they mean the arrival of covetous and despicable criminals in the company of decent and innocent people who are not aware of the true identity of their companions. If thunderbolts strike the fields and damage the crop in a dream, they represent taxes or an investigation. If one sees a town hit and burnt with a thunderbolt in a dream, it means that an unjust governor will rise in that town, and his government will bring fear, rising prices, economic chaos, injustice, or war. If a thunderbolt does not carry fire in the dream, then it represents a new leader. (Also see Earthquake)"}, {"id": "thyme", "label": "Thyme", "category": "Plants", "meaning": "(See Wild thyme)"}, {"id": "tiara", "label": "Tiara", "category": "Objects", "meaning": "(See Headgear)"}, {"id": "tickling", "label": "Tickling", "category": "Action", "meaning": "Tickling someone in a dream means interfering in his business, or denying him access to it."}, {"id": "tides", "label": "Tides", "category": "Water", "meaning": "(Ocean) In a dream, swimming in troubled waters or high tides means adversities or having to face a strong opponent."}, {"id": "tie", "label": "Tie", "category": "Objects", "meaning": "(Bond, Knot) A tie in a dream represents longevity, old age, and the possible bending of one's back. (Also see Band, Bond, Captivated, Contract, Cord, Knot, Untying something)"}, {"id": "tied-up", "label": "Tied-up", "category": "Action", "meaning": "(See Handcuff)"}, {"id": "tiger", "label": "Tiger", "category": "Animals", "meaning": "(Leopard) In a dream, a tiger represents a tyrant, an unjust ruler, or an avowed enemy. Killing a tiger in a dream means vanquishing such an enemy. Eating the flesh of a tiger in a dream means money, profits, and honour. Riding on a tiger in a dream means power and sovereignty. A tiger inside one's house in a dream represents an insolent person who attacks one's family. Seeing a tiger or a leopard in one's dream means receiving money from an insolent or an artful person. A struggle with a tiger in a dream means fighting with an insolent person. A tiger's bite in a dream represents damage caused by such a person. A tiger in a dream also represents either a man or a woman. It also represents deceit, trickery, an illness, or eye irritation. Tigress milk in a dream represents enmity. Seeing a tiger in a dream could also mean repenting from sin. (Also see Fur, Milking a tiger)"}, {"id": "tight-shirt", "label": "Tight shirt", "category": "Objects", "meaning": "Wearing a buttoned and tight shirt, a blouse, or other apparel in a dream means experiencing tight circumstances, or reuniting with a traveller returning home, or it could mean marriage for an unwed person. (Also see Clothing)"}, {"id": "tile-maker", "label": "Tile maker", "category": "Types of People", "meaning": "A tile maker in a dream represents distress, adversities, trouble, hoarding money for the benefit of others, or he could represent anyone who has no descendants or posterity. In a dream, a tile maker also represents wealth, a palace, the high society, beauty, unity, and love. Laying tiles in a dream means preparing oneself for something important, or building a corridor or a pathway."}, {"id": "tiller", "label": "Tiller", "category": "Tools", "meaning": "(See Helm)"}, {"id": "timber", "label": "Timber", "category": "Objects", "meaning": "(See Firewood, Teak)"}, {"id": "timepiece", "label": "Timepiece", "category": "Objects", "meaning": "(See Clock)"}, {"id": "tinner", "label": "Tinner", "category": "Types of People", "meaning": "(See Fuller)"}, {"id": "tinsmith", "label": "Tinsmith", "category": "Types of People", "meaning": "In a dream, a tinsmith represents a cadet, a procurer, or a pimp."}, {"id": "tinsmithing", "label": "Tinsmithing", "category": "Action", "meaning": "(See Plumber, Tinsmith)"}, {"id": "tippler", "label": "Tippler", "category": "Types of People", "meaning": "In a dream, a tippler represents an alcoholic, a drunkard, or an inebriate. (Also see Wine)"}, {"id": "title", "label": "Title", "category": "Other", "meaning": "(See Fame)"}, {"id": "title-tax", "label": "Title (tax)", "category": "Other", "meaning": "Alms giving, Charity. See Alms Tax, Title collector)"}, {"id": "title-collector", "label": "Title collector", "category": "Types of People", "meaning": "(Atonement, Penance) In a dream, a title collector represents someone who interferes in people's business. Seeing the title collector in a dream also denotes adversities, calamities, heavy losses, disasters, or trials that befall a believer to deter him to repent, to wash his heart from impurities, and to free him from the burdens of his sins. (Also see Atonement)"}, {"id": "toaster-oven", "label": "Toaster oven", "category": "Objects", "meaning": "(See Oven)"}, {"id": "tobacco", "label": "Tobacco", "category": "Plants", "meaning": "(See Snuff)"}, {"id": "toes", "label": "Toes", "category": "Human Body", "meaning": "Toes in a dream represent good deeds. (Also see Body¹, Foot)"}, {"id": "toga", "label": "Toga", "category": "Objects", "meaning": "(Persian toga, Roman toga. See Cap)"}, {"id": "toil", "label": "Toil", "category": "Action", "meaning": "(See Labor)"}, {"id": "toilet", "label": "Toilet", "category": "Objects", "meaning": "(Lavatory) In a dream, a toilet means relief from distress, satisfying one's innate needs, a bathhouse, taking a ritual ablution, a place where one's secrets are exposed, a place where one hides his money, a treasury, a coffer, a restroom, or a place to reflect. Washing the toilet's floor in a dream means becoming poor. A flooded toilet in a dream means distress, pregnancy, or prosperity. To fall into a toilet in a dream means imprisonment. Pouring honey or milk into the toilet bowl, or urinating blood in a dream, means sodomizing. Looking into the toilet bowl and finding blood in it in a dream implies that one engages in forbidden sexual intercourse with his wife during her menstrual period. A toilet in a dream also represents a guard. (Also see Bathroom)"}, {"id": "tomb", "label": "Tomb", "category": "Other", "meaning": "(See Shrine)"}, {"id": "tomcat", "label": "Tomcat", "category": "Animals", "meaning": "(Book of records, Cat, Reckoning, Siamese cat, Thief) In a dream, a tomcat means a thief or a servant. A cat in a dream also represents an evil and treacherous woman. The same interpretation is given for anyone who compasses people, or guards them, or someone who harms the interests of his employer more than he benefits him. If a tomcat scratches someone or bites him in a dream, it means that he will fall sick for a full year. The bite of a wildcat in a dream is more dangerous and has greater implications. If one sees a tomcat sitting peacefully and quietly in its house in a dream, it means that he will have a comfortable, peaceful, and profitable year. Otherwise, a large wildcat in the dream represents a troublesome year. Selling a tomcat in a dream means spending one's money in various charities. Eating a cat in a dream means learning about sorcery. If one sees himself transformed into a tomcat in a dream, it means that he lives from stealing and seeks what is harmful. A tomcat entering one's house in a dream represents a robber. Whatever a tomcat takes from one's house in the dream will be looted by such a thief. Killing or beating a tomcat in a dream means catching a thief and killing him. If one extracts fat from a cat in a dream, it means that he will receive stolen money or a share thereof. Fighting with a tomcat in a dream means an affliction with a long and debilitating illness that will be followed by a complete recovery. If the tomcat loses the fight, and if the man is already sick, it means that he will recover from his illness shortly thereafter. Otherwise, if he loses in the dream, it means that his illness has reached its peak. A cat or a tomcat in a dream also represents reckoning, estrangement of one's wife, her roughness with her husband, or they could represent ill-behaved children with their parents, fights, theft, adultery, lack of loyalty, eavesdropping, taunting, roaring, clamour, a bastard son, a foundling, or an orphan. On the other hand, a cat in a dream could represent a toadying person, dancing, being playful and kind, though awaiting to jump at the first opportunity to spoil others' peace. If the cat, the tomcat, and the mouse, or the lamb and the wolf, become friends in the dream, it means hypocrisy, affectation, and loss of moral standards. A civet cat in a dream represents a man who may have a suspicious look, though his character and conduct are exemplary. (Also see Cat)"}, {"id": "tongue", "label": "Tongue", "category": "Human Body", "meaning": "(Interpreter, Pen, Speech writer, Stinger, Translator) In a dream, one's tongue represents his translator or his business manager. One's tongue in a dream also represents the chief cause of sin. Moving one's tongue without speaking in a dream means sinning. Seeing an increase in size, width, or length of one's tongue in a dream means strength and overcoming one's enemy. If one's tongue becomes elongated with no cause for dispute or argument in a dream, it means having a bad tongue, or backbiting others, speaking ill about others, or using base and despicable language. Having a long tongue in a dream could also mean clarity in speech and eloquence in one's expressions. Having two tongues in a dream means acquiring a second language or a second trade, using a proof other than one's own in a court of justice, or winning a victory over one's enemy. If one finds his tongue tied in a dream, it means stagnation of his business, or it could mean poverty. If black hair grows over one's tongue in a dream, it means a fast-coming evil. If grey hair grows over one's tongue in a dream, then it means a slow coming adversity. Hair growing over one's tongue in a dream also means writing or reciting a poem. One's tongue in a dream also represents the perfect alibi, the beauty and eloquence of one's presentation, a professional presentation, good fame, and good conduct. If a governor's tongue is cut off in a dream, it means the death of his interpreter or his speech writer. The human tongue in a dream also represents his pen and his signing authority. If one's tongue becomes long and reaches the skies in a dream, it means that he will be impeached or deposed from his leadership position following his tyranny and injustices. If the tongue of a leader or a ruler becomes long in a dream, it also signifies the expansion of his power and the infallibility and effectiveness of his commands. One's tongue in a dream also symbolizes a milk suckling baby, a lion in its den, or an intelligent warrior. Thus, if one lets a lion out of a lair in a dream, it denotes his tongue, or hurting people's feelings or reputation with one's tongue. If one sees himself without a tongue in a dream, it may mean the death of an infant. If one has to appear in court and sees his tongue cut off in a dream, it means that his proof will be rejected by the judge. If only the side of one's tongue is cut off in a dream, it means that he has doubts about the testimony of his witness. If he is a merchant, it means that he will lose an important business deal. If he is a student, it means that he will not complete his schooling. It is also said that when one's tongue is cut off in a dream, it means that he is a forbearing person. If the wife's tongue is cut off in a dream, it means that she is a chaste and pious woman. If a wife cuts off the tongue of her husband in a dream, it means that she will flirt with him and show him tenderness and love. Cutting off the tongue of a poor person in a dream means giving something to an impudent person to shun off his evil. If a poor person cuts off the tongue of another poor person in a dream, it means a fight between them. If one's tongue sticks to his palate in a dream, it means that he will deny or reject someone's right, refute the truth, or lie about a trust he received to keep for a time. Eating one's tongue or biting on it in a dream represents an act one will regret. If a governor sees that in a dream, it means that he swindles people's money and receives bribes. Biting one's tongue in a dream also means remaining mostly silent, withholding one's advice, or controlling one's fury and anger. Biting one's tongue in a dream could also denote gluttony. Cutting off one's tongue in a dream means invalidating one's argument or proof, or preventing him from asking for anything. The cutting off of a poet's tongue in a dream means giving him money for his recitation. Seeing one's tongue black in a dream means that one may preside over his people. If he is a wretched person, it means that he is a liar. If someone scared of something sees his tongue in a dream, it means that he will lose his battle and become subject to defamation and humiliation. If a wretched person sees himself having many tongues in a dream, it means that he will have a large family. Having many tongues in a dream also means speaking many foreign languages. tongue is split in half in a dream, it means that he is a liar. Having many tongues and of many colours in a dream means telling different and contradictory stories, or it could represent a music writer. If people touch one's tongue or suck it in a dream, it means that they are acquiring their knowledge. It also represents people toadying or lobbying in official business. One's tongue in a dream also represents a hidden treasure, a hidden knowledge, a toadying servant, an employee, one's house, a vehicle, a skilled enemy, a seedling of a fruit bearing tree, a bad wife, a barren woman, one's spoken and irretrievable words, earnings, collecting garbage, following someone's traces, a policeman, or a prisoner. An animal's tongue in a dream represents one's life or death, because for an animal, its tongue is like a hand through which it takes things. If a scholar's tongue is cut off in a dream, it means that he will lose his argument, or it could mean the death of his assistant, student, or son. Losing one's tongue in a dream represents the malicious joy of one's enemy, family, or neighbours for one's losses, or it could mean the death of a beloved, severing a relationship, or a plant disease that will affect one's fruit-bearing trees. Perhaps losing one's tongue in a dream could mean separation between husband and wife, divorce, job, or moving to a new town. Having two tongues in a dream also means backbiting others, or having two faces with people, for people say that so-and-so has two tongues or two faces. If the second tongue does not impede the person from speaking in the dream, then it denotes his truthfulness, love, and affection toward others. One's tongue in a dream may also represent something one fears, such as the collapsing of a roof over his head, or it could represent an enemy. It also means isolating oneself from people of knowledge and wisdom, or it could mean remaining mostly silent, minding one's own business, or offering devotion and being grateful to God Almighty for His gifts and blessings. One's tongue in a dream also represents a captured prisoner of war, or a snake hiding in its pit. Looking at one's tongue in a dream means controlling what comes out of it. (Also see Body, Exhaustion from speaking, Language, Spell out)"}, {"id": "tongues", "label": "Tongues", "category": "Human Body", "meaning": "(See Tweezers)"}, {"id": "tooth", "label": "Tooth", "category": "Human Body", "meaning": "(1) Teeth in a dream represent one's identity, age, clan, a boy, a girl, his family, money, servants, domestic animals, employees, weapons, life, death, unity, separation, trusts, or savings. In a dream, a male's or a female's upper teeth represent the male members of one's family from the father's side, and the teeth of the lower jaw represent the female members of one's family from the mother's side. The closer the teeth are to the incisors, the closer the relative is. Divided into two sections, the upper right incisor represents the father, and the upper left incisor represents the paternal uncle, or it could represent one's sisters, sons, or a close friend. The upper canines represent one's cousin. Or two friends who are as close as cousins. The bicuspids represent one's uncles from the mother's side and their children, while the molars represent the grandparents and the grandchildren. The lower right incisor represents the mother, and the lower left incisor represents one's aunt from his father's side, or they could represent two sisters, two daughters, or two close friends who have the same compassion, concern, and love. The lower canines represent one's female cousin from either the father's or the mother's side. The lower canine tooth, or the eye-tooth, represents the sire of the house, or the landlord. The upper and the lower molars also represent the furthest members of one's family, including the grandmother and her granddaughters. If a tooth moves in its place in the dream, it means an illness. If it falls, or if it is lost, then it means death of the person to whom it is attributed, or it could mean that he will be separated from him and can no longer see him. If one saves his lost tooth and does not bury it in the dream, it means that someone will come forth and be to him as good as that relative. Otherwise, if he does bury it, then it means the death of his relative. (2) In a dream, the human limbs also represent the members of his family, and whatever condition they portray in one's dream may become visible in the members of his family. Similarly, whatever may affect one's teeth in a dream can be interpreted as affecting such family members. If one's incisors look beautiful and bright in a dream, they denote the power, honour, and prosperity that his father or uncle will gain. If extra incisors grow in one's mouth in a dream, it means that one's family will grow by either a newborn brother or a new son. If one finds his teeth slightly deteriorating in a dream, it means a trial, or that his family will engage in a disgraceful act that will bring him shame. If one attempts to pull out his teeth in a dream, it means that he may spend his money unwillingly, pay a fine, or separate from his parents, thus cutting off his blood ties, or he may become untrue to his relatives. If one's teeth turn yellow or black in a dream, such a dream also represents a disgraceful act that will disgrace the family. Yellow teeth in a dream mean spending money to restore one's reputation, or it could mean being knowledgeable in one's esteem. Developing a bad mouth odour in a dream represents bad connotations resulting from praises one's family may receive. Deteriorating teeth in a dream represent weakness in one's family. If one sees people biting him in a dream, it means that he could have pretended something in public, though he fortunately restrained himself. (31If one's mouth in a dream is interpreted to represent his household, then the teeth of the right side represent the boys, and those on the left side represent the girls. On the other hand, the teeth on the right side could represent the older generation, and the teeth on the left side could represent the younger generation. The incisors represent the young men in the family, and the canines represent the young girls. As to the molars, they represent elderly people. If one loses a molar tooth in a dream, it means the death of an elderly person in his household. (4lHuman teeth in a dream also represent one's business and management of his life. In that case, the molars represent one's private life, the eye-tooth represents what is semi-public, while the front incisors represent what is openly practiced, one's public character, words, and deeds. If one sees his teeth broken in a dream, it means that he pays his debts slowly. Long teeth in a dream mean enmity or a fight between members of one's household. If one sees his teeth curved and deteriorating, and if one decides that it is better to pull them out in a dream, it means that he will escape from great adversities and dangers. If one's teeth turn gold in a dream, they represent benefits for a teacher or a preacher. Otherwise, golden teeth for everyone else in a dream mean fire, illness, Candida, or an illness that is caused by one's bile. If one's teeth become glass or wood in a dream, it means his death. If they turn silver in the dream, it means harm or losses. If one's front teeth fall and new ones grow instead in the dream, they represent major changes in one's life. If one sees himself forcefully pushing his tongue against his teeth in a dream, it means that he speaks ill of his own family, or it could mean problems in one's house. If the crown or the enamel of one's eye-tooth is damaged, or if it falls in a dream, it means the death of one's son. (')Teeth in a dream represent one's clan, close relatives, or distant cousins. The molar teeth represent the male members, and the incisors represent the female members. Unnecessarily pulling out one's teeth in a dream means paying a fine, losing one's capital, or severing a relationship with members of one's family. Discovering one or two cavities in one's teeth in a dream means that one may beget one or two sons. Developing a bad mouth odour in a dream means belittling someone's ideas, or it could mean a family dispute. Fallen teeth in a dream may denote that the husband and the wife sleep in separate beds, or it may mean poverty, or that one may die in a foreign land, or that the term of one's life span in this world may be extended. If one pulls out his teeth and buries them in the dream, it means that his entire clan or family will die before him. Pulling out one's teeth in a dream also means exposing one's secrets. Losing a tooth in a dream may imply a punishment for wrongdoing. If one finds the teeth of his upper jaw and those of the lower jaw intermixed in the dream, it means that the women control the men in his or her family. Flossing one's teeth in a dream means dispersal of one's family, or loss of money and property. If after flossing one's teeth, some meat fibre remains stuck between the teeth in the dream, it means that he backbites his family members. (8) Teeth in a dream also represent a pearl necklace, a grinder, or an army formation. The right wing, the left wing, and the front assault formation, or they could mean severing blood ties. The incisors may represent the heart of a human being. Teeth in one's pocket or the palm of one's hand in a dream represent one's brothers. If one has an incarcerated relative, and if he sees his teeth pulled out in a dream, it means the release of his relative from prison. Pulling out one's teeth in a dream could mean the return of a traveller to his homeland. Tartar in a dream represents weaknesses in the family. Black or broken teeth in a dream mean sorrow caused by one's relatives. Wisdom teeth in a dream represent one's followers, while the incisors and the canines represent his wealth, adornment, pride, or child. The changing of their colour into yellow or black in a dream means changes in one's life. If one's teeth turn into iron in a dream, it means strength. Losing one's teeth in a dream could also mean a job. Pulling out one's teeth in a dream so that no one can see them means infertility, or loss of one's business, loss of one's savings, a bad relationship with one's family, an evil act toward one's family, or it could mean that he will try to sustain his business through a loan, then suffer from bankruptcy. Having a bad tooth in wakefulness and pulling it out in a dream means trying to comfort or appease a difficult person whose hurtfulness will eventually cease. Replacing a tooth with a bridge in a dream means recovering losses or balancing one's business. Having an extra tooth in a dream means losing one in wakefulness. (Also see Body, Pain, Teeth)"}, {"id": "tooth-ache", "label": "Tooth ache", "category": "Feelings", "meaning": "(See Pain, Teeth, Tooth)"}, {"id": "toothbrush", "label": "Toothbrush", "category": "Objects", "meaning": "(Boy, Broom, Employee) A toothbrush in a dream is a sign of hygienic conditions, prosperity, purity, cleanliness, repentance, or asking someone for forgiveness. Brushing and cleaning one's teeth in a dream is also a sign of being religious, a family person, a concerned relative, and a generous kin. If one sees himself brushing his teeth, and if his gums bleed in the dream, it means that he will become free from his sins and curtail his evildoing, or it could mean the opposite, that is, to proceed with abhorrent actions, cause harm to one's own family, steal their money, or defame them. Brushing one's teeth in a dream also could mean reservation and prudence with one's words, purifying oneself from sin, faith after disbelief, paying one's debts, doing what pleases God Almighty, fulfilling one's promises, a pregnancy, or a marriage. (Also see Broom)"}, {"id": "topaz", "label": "Topaz", "category": "Objects", "meaning": "(Chrysolite, Gem) In a dream, topaz represents a good man who is courageous, well-behaved, a true friend, a pious person, or a religious person. If topaz is understood to denote money in the dream, then it represents lawful earnings. Topaz in a dream also represents the substance of speech, the essence of knowledge, and the good quality of a true human being."}, {"id": "torah", "label": "Torah", "category": "Other", "meaning": "Reciting the Torah but not recognizing what it is in a dream means that one may become a fatalist. To own a copy of the Torah for a king or ruler in a dream means that he will conquer a land or make peace with its people on his terms. If he is learned in real life, it means that either his knowledge will increase, or that he will invent what is not ordained, or he may tend to lean toward jovial company. Seeing the Torah in a dream also means finding what is lost, welcoming a long-awaited traveller, or it could represent someone who follows the Jewish faith. As for an unmarried person, owning a Torah in a dream means getting married to a woman from a different religion, or it could mean marrying a woman without her parents' consent. Seeing the Torah in a dream may also mean extensive travels. If one's wife is pregnant, it means that she will bear a child who resembles his father. If one's wife is pregnant, and if he sees himself holding the Torah in a dream, it means that she will beget a daughter, for the gender of the word Torah is feminine. It also means that he will mix with evil companions. Similar interpretations are given to carrying other scriptures. To see the Torah, or the Evangel, or the Gospel in a dream is as though one has seen God's Prophet Muhammad, upon whom be peace, because his name is mentioned in all three of them. It could also mean betrayal, negating a covenant, or desiring what is shoddy."}, {"id": "torch", "label": "Torch", "category": "Objects", "meaning": "(Beacon) Carrying a torch in a dream means knowledge, wisdom, guiding and leading the people on the straight path, or it could represent someone people depend on to learn about the truth. However, such a person will enjoy no luck, and he will receive little appreciation for his work."}, {"id": "torn-garments", "label": "Torn garments", "category": "Objects", "meaning": "(Goodwill, Secondhand. Also see Used clothing)"}, {"id": "tornado", "label": "Tornado", "category": "Weather", "meaning": "(Changing course, Storm, Wind) A tornado in a dream means death and destruction. (Also see Cloud of destruction, Wind)"}, {"id": "torpor", "label": "Torpor", "category": "Mood", "meaning": "(Apple tree)"}, {"id": "torrent", "label": "Torrent", "category": "Water", "meaning": "(Inundation, Tumultuous outburst. See Flood)"}, {"id": "torturer", "label": "Torturer", "category": "Types of People", "meaning": "(See Executioner)"}, {"id": "toss", "label": "Toss", "category": "Action", "meaning": "(See Cast²)"}, {"id": "tourist", "label": "Tourist", "category": "Types of People", "meaning": "A tourist in a dream represents a student seeking knowledge, a buyer, a customer, or a merchant."}, {"id": "towel", "label": "Towel", "category": "Objects", "meaning": "(Apron, Serviette) A towel in a dream represents one's servant, employee, housekeeper, or it could represent a pilgrimage to Mecca. In a dream, a towel also represents one's wife, and for a woman, it represents her husband. If a towel is used as a mat during sexual intercourse in a dream, then it represents a discrete servant who protects his mistress's secrets, or it could represent money that serves a woman's needs and those of her children. To throw a towel at someone in a dream means to slam the door in his face, or it could mean separation between two people. To throw in the towel in a dream also means to give up one's fight."}, {"id": "tower", "label": "Tower", "category": "Objects", "meaning": "Standing inside a tower in a dream means that one should not feel safe from the blows of his enemy, or expect to be secured and safe in his environment when someone calls upon him for something. If he is sick, it means that he may die from his illness. Standing on top of a tower or a wall in a dream means that one will conquer or capture a dangerous person. If one stands over or inside a tower that is no longer in use in a dream, then it represents his grave. (Also see Grave)"}, {"id": "town", "label": "Town", "category": "Other", "meaning": "(See Village)"}, {"id": "toy", "label": "Toy", "category": "Objects", "meaning": "(Swing)"}, {"id": "tracer", "label": "Tracer", "category": "Types of People", "meaning": "(See Snake charmer, Tracker)"}, {"id": "traces", "label": "Traces", "category": "Other", "meaning": "(See Water)"}, {"id": "tracing-footsteps", "label": "Tracing footsteps", "category": "Action", "meaning": "(See Tracker)"}, {"id": "tracker", "label": "Tracker", "category": "Types of People", "meaning": "(Spoor, Tracing footsteps) A tracker in a dream connotes divulging secrets, exposing people's private lives, or he could represent knowledge, or a student who is investigating the works of masters from the past. (Also see Snake charmer)"}, {"id": "trade", "label": "Trade", "category": "Action", "meaning": "Any product that is touched by fire in the process of its manufacturing means arguments and disputes."}, {"id": "trader", "label": "Trader", "category": "Types of People", "meaning": "A garment trader in a dream represents a person who loves the world and who is proud of his success in it. A milk merchant represents a knowledge seeker. A cattle trader represents an effective person who loves to show off. A sheep merchant in a dream may represent a good man who is intuitive and who spends his money on the path of seeking knowledge or to propagate the same."}, {"id": "tragacanth", "label": "Tragacanth", "category": "Plants", "meaning": "(See Safflower)"}, {"id": "trail", "label": "Trail", "category": "Other", "meaning": "(See Road)"}, {"id": "trait", "label": "Trait", "category": "Other", "meaning": "(Caprice, Distinguishing quality, Temper) In a dream, a trait represents someone who is impulsive, or who has an arbitrary change of mind, or someone who does not know rest in his work, or someone who does not know an end to his pursuit of success, or it could represent an argumentative person. The good or bad of such a character may show depending on the place, circumstance, or temper of the moment in the dream."}, {"id": "tramp", "label": "Tramp", "category": "Types of People", "meaning": "(See Destitute, Hobo)"}, {"id": "transfixed", "label": "Transfixed", "category": "Feelings", "meaning": "(See Eyes)"}, {"id": "transformation", "label": "Transformation", "category": "Action", "meaning": "(Changing form) Transformation by substitution in a dream where one thing is converted into something else. If a withered tree is transformed into a blossoming one in a dream, it means political changes, changes in worldly conditions, or reversal of conditions from good to bad, or from bad to good. This element includes the transformation of inner substances or physical ones. For example, if he sees himself as an old person in a dream, when in real life he is young, it means progress in his spiritual life and gaining honour.  If he is an old person and sees himself as a young boy in a dream, it means indulging in wrongdoing. If one sees a known old person regaining his youth, it means that the material conditions of the person seeing the dream will turn around to one's advantage or otherwise. i.e., richness into poverty and vice-versa, or if he is sick, he will recover from his illness. If one is transformed into a beautiful shoot of green or a blossoming branch of a tree in a dream, it means that he may die within a short time. Becoming taller in a dream means longevity, prosperity, or begetting a son. If one finds himself missing partial mental keenness or physical abilities or a limb in a dream, it means that he may suffer losses relating to his worldly interests. If a man sees himself transformed into a woman, and wears her apparel, ornaments, and make-up in a dream, it means that he may suffer humiliation, adversities, and abuse. If a woman sees herself transformed into a man, or if she grows a beard in a dream, it means that she will reestablish her connection with a missing child. As a man in the dream, and if she is pregnant, it means that she will beget a son who may die in his early youth, but if she is not pregnant, it means that she is no longer fertile. If one sees himself flying with wings in a dream, it means travel. If one sees himself transformed into a wooden staff in a dream, it represents his insolence. If one sees himself transformed into an iron rod in a dream, it means longevity. If one sees himself transformed into a bridge in a dream, it means that he may become a ruler, a wise man, or a man of knowledge whom people will seek to benefit from his wisdom. If a person sees his sick child turn into a bird in a dream, it means the death of the child. If one sees himself turned into a beast in a dream, it means that he will be segregated from the believers to live alone because of his evil qualities. If one sees himself turned into a deer, a gazelle, or an antelope in a dream, it means that he will become obsessed with his sexual life, or that he will become mentally deranged to the degree of indulging in bisexual practices. If he turns into a pig in a dream, it means prosperity surrounded by the absence of human dignity. If one sees a steer transformed into a wolf in a dream, it represents a government employee who will turn unjust. However, according to Islamic interpretations of the human transformation into a lower category of creatures, if such a transformation takes place in real life, it connotes a curse and a punishment, and it does not last for more than three days, and it will culminate in death. (Also see Changing form)"}, {"id": "transgression", "label": "Transgression", "category": "Action", "meaning": "(See Infringement, Injustice)"}, {"id": "transient", "label": "Transient", "category": "Other", "meaning": "(Dwellings, House, Interim, Loan, Temporary)"}, {"id": "translator", "label": "Translator", "category": "Types of People", "meaning": "(Tongue)"}, {"id": "transparent-hood", "label": "Transparent hood", "category": "Objects", "meaning": "(See Canopy)"}, {"id": "transportation", "label": "Transportation", "category": "Other", "meaning": "(See Car, Driver)"}, {"id": "transvestite", "label": "Transvestite", "category": "Types of People", "meaning": "(See Vagina)"}, {"id": "trap", "label": "Trap", "category": "Objects", "meaning": "(Hunter's snare, Hunting trap, Net, Snare) In a dream, a trap means deception, duplicity, and fraud. If one falls victim to a hunting trap in a dream, it means that he will be victimized. If one sets a trap and catches an animal or a bird with it in a dream, it means that he earns his money through deception and fraud. In a dream, a trap also represents a man who fosters little moral standards, or one who does not subscribe to any religious code of conduct, and who is smart but deceitful. Setting a trap or a net to catch a bird in a dream means setting a trap to bring a powerful person to his knees. If a woman sees herself setting a trap in a dream, it means that she desires to bear a child from her husband, though if she does get pregnant, she may have a miscarriage."}, {"id": "trash", "label": "Trash", "category": "Objects", "meaning": "(Debris, Scraps) In a dream, trash represents the unavoidable a traveller hates to see, or fears of what he may reap from his journey. (Also see Trash collector)"}, {"id": "trash-collector", "label": "Trash collector", "category": "Types of People", "meaning": "(Garbage) A trash collector in a dream represents a deprived person, someone who toils hard to serve others, or someone who struggles hard to comfort others. A trash collector in a dream also represents a short-lived richness, a short-lived poverty, or a stingy person who keeps hoarding money. (Also see Garbage, Sanitation, Sweeping the floor, Trash)"}, {"id": "traveller's-pouch", "label": "Traveller's pouch", "category": "Objects", "meaning": "(See Food basket)"}, {"id": "travels", "label": "Travels", "category": "Action", "meaning": "(Hotel, Inn, Millstone, World) In a dream, travels mean discovering people's substance or character. If a poor person sees himself travelling in a dream, it means that he will become rich. If one hosts travellers in a dream, it means that he may receive news from that direction. Travelling in a dream also means changing condition, state, environment, or that one may have to wash the floor of a house, or change his employer, repent for his sin, or satisfy what his heart desires. Travelling on foot in a dream means owing a debt that is weighing heavily on one's heart. Moving out of an unknown house in a dream means travelling. If a sick person sees himself travelling from one land to another that he could not recognize in his dream, it means his death. If a traveller sees himself carrying a food basket in a dream, it means that he will take a positive look at things, or that he will make a practical move that will benefit him and his family. (Also see Reckoning, Saddle-mount, Stairway, Tent)"}, {"id": "treasure", "label": "Treasure", "category": "Objects", "meaning": "(Hidden treasure, Knowledge, Wheel) Discovering a treasure in a dream means acquiring knowledge. If one is a merchant, then it means profits from his business, or spending money generously on God's path. If one is a ruler, it means expansion of his powers, and it denotes his justice. Seeing a treasure in a dream is interpreted as one's type of trade. A treasure in a dream also represents a business. Discovering a hidden trunk with little money inside it in a dream means a short-lived difficulty, but if the trunk is stashed with money, then it means distress, sadness, and sorrow. In many instances, discovering a treasure in a dream may mean death, or it could mean becoming rich, or complying with a court order. Discovering a great treasure in a dream means martyrdom. Discovering a treasure and rejoicing in the dream means loss of one's money or business. Discovering a treasure in a dream also could mean ease in one's life, receiving an inheritance, distress, trouble, wearing a new garment, a wife, cheating on one's taxes, or it could mean avoiding paying alms tax, or hindering the distributions of charitable endowments. A treasure in a dream also represents a profitable business, or it could represent a money changer, a jeweller, or remembering something. Discovering a treasure that is difficult to reach in a dream represents a stingy person who hinders the distribution of charities, or if he is a scholar, it means that he does not like to share his knowledge with others, and if one is a judge, it means that he is unjust. If a woman discovers a treasure in her dream, it means that she is careful about spending money and managing her household. If the trunk has no cover or lid in the dream, then it means the opposite."}, {"id": "treasure-box", "label": "Treasure box", "category": "Objects", "meaning": "(Jar, Preserves) If one finds a treasure box that is filled with jewellery in a dream, it means that he may acquire a large property, or it could mean joy or marriage. A treasure box in a dream also means being proud of one's child, or it could represent a wife who is concerned about the welfare of her family. It could also represent a book. Seeing a jar of preserves, which is used in fermenting liquids in a dream, connotes adversities and distress, or it may mean satisfying one's debts."}, {"id": "treasure-hunting", "label": "Treasure hunting", "category": "Action", "meaning": "(See Diving, Pearl diver)"}, {"id": "treasure-trove", "label": "Treasure-trove", "category": "Objects", "meaning": "(See Hidden treasure)"}, {"id": "tree", "label": "Tree", "category": "Trees", "meaning": "An apple tree in a dream represents a good man who serves and cares about his community. A crack in a tree in a dream represents members of one's family who will brace against him. A palmyra tree in a dream represents a wise man, a poet, or an astronomer. Seeing one, or sitting under it in a dream, means meeting such a person. An oak tree in a dream means profits, prosperity, honour, associating with heedless people who live in the mountains, or perhaps it could mean visiting righteous people or a renunciate who lives in the wilderness or uninhabited ruins. A mimosa tree in a dream represents stinginess, evil, or pursuing the actions of the dwellers of hellfire. A buckthorn tree that grows date-like fruit in a dream represents a noble and generous woman, or it could represent a noble and generous man. The greener its colour, the greater the person. Seeing this tree in a dream means that one will rise in station, acquire knowledge, and grow in piety. Eating its fruit in a dream means an illness. Climbing this tree in a dream means stress and difficulties. If one acknowledges the condition of a specific tree in wakefulness, then sees the same in his dream, it means that such a condition will last. In general, trees in a dream represent women or men of different temperaments or personalities. Trees in a dream also represent fights. Unknown trees mean distress, worries, adversities, and fears, particularly if one sees them in the dark in their dreams. Sitting under the shade of a tree in a dream means profits and money, or it could mean dependence on people in authority, or befriending rich people for their money. As for one who is pursuing the path of innovation, it means that he will repent and follow the path of righteousness if it is a fruit-bearing tree. Taking shelter under a tree that bears no fruit in the dream means pursuing something that will bear no comfort or benefits. Fragrant trees, flowering trees, a Moringa tree, or a henna plant in a dream represent people of knowledge, religious scholars, teachers, or preachers who teach what they do not practice. As for citrus trees in a dream, they represent righteous people, wise men, and people of inner and outer awareness who practice what they preach. Palm trees, walnut trees, or the like trees in a dream represent people of the upper social class from whom no one can get anything, or no one will even attempt to ask them for anything. As for the poplar trees, the evergreen cypress trees, or the saint trees in a dream, they represent stinginess and avariciousness. In a dream, any kind of maple or other trees that renew their leaves annually represent poverty, richness, memorizing things, forgetfulness, celebrations, or sadness. In a dream, any kind of large trees that do not shed their leaves in the winter represent longevity, richness, jealousy, or steadfastness in one's religion. Climbing a tree in a dream means escaping from danger, or carefully avoiding something worrisome. Seeing an unknown tree inside one's house in a dream means that fire may consume such a house, or that a fight may break the family apart. Common types of trees and city trees in a dream represent enemies, or men seeking lawful earnings. Planting a seedling in a dream means getting married to a girl from a renowned family and gaining rank. A plane tree, a sycamore, or the like trees in a dream represent great, strong, and famous men who have no wealth, nor do they benefit anyone. A thorny tree in a dream represents a perplexed man. If one cuts a tree in a dream, it may mean the death of his wife, or that he will infringe upon a contract, or break a covenant. If a tree dries out in a dream, it means that a traveller may die in an accident, or that a sick person may die from their illness. If one sees a king or a man in authority carving some emblems on the trunk of a tree in a dream, it means that he is designing a plan to destroy someone. If he cuts it down with a scythe or a sickle in the dream, it means that he is demanding something, the other party cannot deliver. If one takes money from a tree in his dream, it means that he will earn lawful and blessed money from people who deal with the same type of trees, or that he will live in their vicinity. Planting trees in one's garden in a dream means bearing children. A plane tree represents longevity. Peach or plum trees in a dream represent a short life. Seeing a group of trees surrounded by aromatic plants in a dream means that a group of men will gather to mourn someone, or to lament a loss. Tree leaves in a dream represent money. A tree outside one's house in a dream represents one's clan or servants. A female tree inside a house represents a woman, and a male tree represents a man. It is a bad omen to see the forbidden tree in a dream. In a dream, to see the tree near which God Almighty spoke to Moses, upon whom be peace, means nearness to God Almighty. A dead tree in a dream represents guidance and wealth, for it is a source of fuel. Sitting under the shade of a tree along with a group of people, praising and glorifying God's attributes in a dream, means receiving God's blessings in this world and the hereafter. Seeing the heavenly Tuba tree in a dream means a good end, or living an ascetic life, or it could mean helping others. Seeing mountain trees in a dream means performing supererogatory devotion, work, or receiving unexpected profits. A palm tree in a dream represents a good word and a true one. It also represents Muslims' testimony of faith: 'There is no God except Allah, Muhammad is the Messenger of Allah.' Seeing a garlic tree, or an onion plant, or a perennial vine of the gourd family, or the colocynth tree, Citrullus colocynth (bot.), in a dream means hearing harsh words or evil talk. Plucking fruits other than what the mother tree bears in a dream means carrying someone else's money or property. A tree bearing a fruit other than its own in a dream represents an adulterous wife who bears a child from someone other than her husband. Cutting a tree in a dream means killing someone, or it could mean an illness. Climbing a tree in a dream means meeting a strong man. Coming down from a tree in a dream means parting with someone. Falling from a tree in a dream means death resulting from a fight. If one's right hand breaks from such a fall in the dream, it means the death of his brother or his sister in a fight. If the leg breaks in the dream, it means losing one's money. If one sees blessed trees, such as an olive tree with thorns, in a dream, it means that such thorns will prevent him from wrongdoing or from falling into sin. A walnut tree in a dream represents hard-earned money. Trees in a dream also represent shops, businesses, tables, festivities, servants, cattle, restaurants, money, hidden treasures, storage houses, religions, or sects. If a storm damages a tree, burns it, or causes it to fall in a dream, it means the death or murder of a man or a woman. A date or a palm tree in a dream also represents a famous person, a man of knowledge, the wife of a king, or the mother of a president. If it is an olive tree, then it represents a man of knowledge, a preacher, a passenger, a judge, or a physician. Like that, trees are interpreted according to their substance, value, or the harm or benefit they bring, their roots, origin, or age. Seeing a vineyard bearing grapes in the winter in a dream means that one will be deceived by a woman or a man during a business transaction, thinking that they are rich. A quince tree in a dream represents an intelligent person who does not use his intelligence to benefit himself or others. An almond tree in a dream represents a foreigner or a passenger. Cane or reed plants in a dream represent opposition, punishment, or help. A pomegranate tree in a dream represents a pious and religious person, and its thorns represent the obstacles that could prevent him from falling into sin. A lotus tree in a dream represents a noble and gracious person. A colocynth tree in a dream represents a good but cowardly and easily scared man who has no real devotion and fails to practice his religious duties. An oak tree in a dream represents a king, a gnostic, a poet, or a fortune-teller. An indigo plant in a dream represents a knowledgeable Arab. A dried-out palm tree in a dream represents a hypocrite. If a storm uproots a tree in a dream, it means a calamity or a plague. A banana tree in a dream represents a rich person who correctly manages his religious and material life. A jujube tree in a dream represents a joyful person, or it could represent power and leadership. A fig tree in a dream represents someone who benefits his family and who treats his enemy with justice. A berry tree in a dream represents a generous person. A pistachio tree in a dream represents a wealthy person who also possesses good humour and is generous with his family and friends. A peach tree in a dream represents a correct person, though few can benefit from him, or it could represent a hypocrite or a handsome-looking person, or perhaps a rich woman. If one plucks its fruits in a dream, it means that he will marry her. An apple tree in a dream represents a person with steadfastness and determination. A plum tree in a dream represents a rich and courageous man. A pear tree in a dream represents a Persian who practices herbal medicine. A tamarisk tree in a dream represents a hypocrite, or it could mean a thief who benefits poor people and harms the rich. A bullace, a wild small plum tree, or a damson tree in a dream represents someone who benefits everyone. A sycamore tree in a dream represents a good person who is steadfast in his servitude to others, though he is also firm, equitable, powerful, and rich. A carob tree in a dream represents a man of little benefit to others. A lemon tree in a dream represents a beneficial person, or a rich woman who is known for her charities. (Also see Sycamore tree, Evergreen, Oak tree, Palm tree, etcetera)"}, {"id": "tree-leaves", "label": "Tree leaves", "category": "Plants", "meaning": "(Leaf) In a dream, tree leaves represent clothing, except for the leaves of a fig tree, for they represent sorrow."}, {"id": "trellis", "label": "Trellis", "category": "Objects", "meaning": "(See Vineyard)"}, {"id": "tremble", "label": "Tremble", "category": "Action", "meaning": "(Shake, Shiver, Tremor) Seeing one's head trembling in a dream means gaining honour and rising in station. If one's right hand trembles or shakes in a dream, it means difficulties in earning his livelihood. If one's right leg trembles in a dream, it means profits from one's family or clan. If one's left leg trembles in a dream, it means business losses. The same applies to the trembling or the shocking of any part of one's body. (See Body Tremor)"}, {"id": "tremor", "label": "Tremor", "category": "Other", "meaning": "(Labor pangs, Labor throes, Quake, Shaking, Shock) A tremor in a dream represents plants blooming, grass growing, vegetation sprouting, the blossoming of garden flowers, and the ripening of fruits. If a pregnant woman sees an earthquake in her dream, it represents labour throes. (Also see Earthquake, Shock, Tremble)"}, {"id": "trench", "label": "Trench", "category": "Earth", "meaning": "(Defences) If it relates to the king or the ruler and his army in the dream, a trench then means one's men and wealth. If the trench relates to a scholar in the dream, then it represents his advisors, or his circle of intimates who support his theories. If it relates to one's wife, the trench then represents her guardian or her father. If it relates to one's son, the trench then represents his parents. Noticing a city without a trench or a castle to defend it in a dream means failure to pay alms or charities, wasting money, losing knowledge, the spread of evil, or an enemy attack against that city."}, {"id": "trench-coat", "label": "Trench coat", "category": "Objects", "meaning": "(See Raincoat)"}, {"id": "trespassing", "label": "Trespassing", "category": "Action", "meaning": "(Allurement) In a dream, trespassing means corruption, straying from God's path, denying the truth, or refusing to follow common sense."}, {"id": "trials", "label": "Trials", "category": "Other", "meaning": "(See Trouble)"}, {"id": "triangulum", "label": "Triangulum", "category": "Celestial Bodies", "meaning": "(See Constellations)"}, {"id": "tribadism", "label": "Tribadism", "category": "Other", "meaning": "(See Hone, Sexual intercourse)"}, {"id": "trickery", "label": "Trickery", "category": "Action", "meaning": "In a dream, trickery means betrayal, deception, misleading others, or it could mean war. (Also see Advice, Tricks)"}, {"id": "trickling-sand", "label": "Trickling sand", "category": "Other", "meaning": "(See Hourglass)"}, {"id": "tricks", "label": "Tricks", "category": "Action", "meaning": "(Conjuring, Juggler, Magic arts) In a dream, tricks represent deceit, chicanery, pride, artificiality, or temptation. (Also see Magician)"}, {"id": "trickster", "label": "Trickster", "category": "Types of People", "meaning": "(See Juggler, Tricks)"}, {"id": "tricktrack", "label": "Tricktrack", "category": "Other", "meaning": "(See Backgammon)"}, {"id": "tripe-shop", "label": "Tripe shop", "category": "Other", "meaning": "(See Sheep, Trotter)"}, {"id": "tripping", "label": "Tripping", "category": "Action", "meaning": "(Debts, Slipping, Step lightly, Stumble) To stumble by catching one's foot or hurting one's toe in a dream means accumulating debts. If one's toe bleeds from tripping out in the dream, it means acquiring unlawful or tainted money to pay other debts, or it could mean suffering a great financial loss. (Also see Walking)"}, {"id": "trotter", "label": "Trotter", "category": "Animals", "meaning": "(Tripes) In a dream, trotters represent an orphan's property or money. Eating trotters or licking up their marrow in a dream signifies swindling the trusted inheritance of an orphan by his guardian. Eating tripe in a dream means defrauding rich and honourable people of their money, for a sheep is the most noble animal, comparatively speaking, after the human being. (Also see Sheep)"}, {"id": "trouble", "label": "Trouble", "category": "Other", "meaning": "(Money, Temptation, Trial) In a dream, trouble means money, and money means trouble. Seeing oneself in a dream as wealthy and having many children means trouble, trials, and temptations."}, {"id": "troubled-waters", "label": "Troubled waters", "category": "Water", "meaning": "Swimming in troubled waters or high tides in a dream means adversities or having to face a strong opponent."}, {"id": "trough", "label": "Trough", "category": "Objects", "meaning": "(See Manger)"}, {"id": "trousers", "label": "Trousers", "category": "Objects", "meaning": "(See Pants)"}, {"id": "trout", "label": "Trout", "category": "Fish", "meaning": "(See Fish)"}, {"id": "trowel", "label": "Trowel", "category": "Tools", "meaning": "(See Shovel)"}, {"id": "truce", "label": "Truce", "category": "Other", "meaning": "(Armistice, Cease fire, Cessation) Negotiating a truce, or witnessing one between two armies in a dream, means cessation of fear, relaxing, recovery of a sick person from his illness, caring for the wounded, extending the chances of one's survival, profits, business, marriage, rebuilding, doing good, or performing one's prayers."}, {"id": "truffle", "label": "Truffle", "category": "Food", "meaning": "In a dream, a truffle represents an honest and likeable man whose company is sought by noble people. A truffle in a dream also represents money earned through a woman. Eating truffles in a dream means earning money from a relative through legitimate means. "}, {"id": "trumpet", "label": "Trumpet", "category": "Objects", "meaning": "Hearing the sound of a trumpet or a horn in a dream means going to war. If one blows into a horn in a dream, it means that he will face adversities, and if one sees himself playing the trumpet, it means that he will receive glad tidings. (Also see Trumpet of Resurrection)"}, {"id": "trumpet-of-resurrection", "label": "Trumpet of Resurrection", "category": "Other", "meaning": "Hearing the sound of the trumpet of the Day of Resurrection in a dream means hearing the truth. Blowing on the trumpet of the archangel Israfil in a dream means the salvation of the righteous ones. In a dream, the sound of this trumpet invokes fear, bringing news that causes shivers and trembling in people's hearts. If one hears it alone, then the news is exclusive to him. If everyone hears its sound in the dream, then it is a public affair. If one hears the sound of the trumpet and anticipates that everyone has heard it too in a dream, it means plagues and adversities, for the first blow indicates the end of the world and the death of everyone in it. The second blow indicates their resurrection back to life, which will be followed by the Grand Gathering for the Day of Judgment. If a sick person hears the first blow in a dream, it means that he will shortly recover from his illness. If the town is afflicted with a calamity, then hearing it in a dream means that people's adversities will be lifted. If there is a drought, it will end, and food prices will go back to normal. If one hears the second blow of the trumpet of resurrection in a dream, it means prosperity, revealing what is hidden, exposing long-kept secrets, recovering from an illness, release from prison, reunion of beloveds, or meeting with people who have just arrived from a long journey. (Also see Blowing, Rising of the dead, Resurrection)"}, {"id": "trunk", "label": "Trunk", "category": "Objects", "meaning": "In a dream, a trunk represents a wife, a beautiful woman, one's house, or one's shop. In a dream, a trunk also represents marriage for an unwed person, prosperity for a poor person, travels, or an ambassador. (Also see Sack, Suitcase, Treasure box)"}, {"id": "trust", "label": "Trust", "category": "Feelings", "meaning": "(See Deposit)"}, {"id": "trust-in-god", "label": "Trust in God", "category": "Action", "meaning": "To express one's trust in God Almighty in a dream signifies the end of adversities and the achievement of one's goals. To proclaim one's trust in God in a dream is an indication of true faith, recognition of God's supremacy, cessation of adversities, and victory over one's enemy. Putting one's trust in God Almighty in a dream also means repenting from sin. Otherwise, perhaps it may indicate the infallibility of one's destiny, though the result of one's encounter with his adversities will prove him triumphant."}, {"id": "trustee", "label": "Trustee", "category": "Types of People", "meaning": "(See Legal guardian)"}, {"id": "trusting-someone", "label": "Trusting someone", "category": "Feelings", "meaning": "(See Deposit)"}, {"id": "truth", "label": "Truth", "category": "Other", "meaning": "Recognizing the truth through seeing a light or hearing the admonition of the holy Qur'?n in a dream means walking on the straight path and abstaining from falsehood or from mixing with its people. In the case of a sick person, it means their death. (Also see Almond, Sanding)"}, {"id": "truthfulness", "label": "Truthfulness", "category": "Other", "meaning": "In a dream, truthfulness represents one's faith and certitude. Being truthful in a dream means avoiding adversities."}, {"id": "tuba-tree", "label": "Tuba tree", "category": "Trees", "meaning": "(See Tree)"}, {"id": "tuberculosis", "label": "Tuberculosis", "category": "Human Body", "meaning": "In a dream, it represents an illness, debts, a journey that necessitates living a simple life, being filthy, or it could represent a rare form of art."}, {"id": "tuft-first-meaning", "label": "Tuft-first-meaning", "category": "Other", "meaning": "(Crest) A tuft in a dream represents a little boy."}, {"id": "tuft-second-meaning", "label": "Tuft-second-meaning", "category": "Other", "meaning": "(See Strand of hair)"}, {"id": "tumour", "label": "Tumour", "category": "Human Body", "meaning": "(Abscess, Boil, Ulcer. See Pimple)"}, {"id": "tunnel", "label": "Tunnel", "category": "Other", "meaning": "(Burrow, Hole, Underground passage) In a dream, a tunnel represents trickery and deception. If one sees himself digging a tunnel or a hole for someone else in a dream, it means tricking and deceiving him. If one enters the tunnel that he dug in the dream, it means that he will fall into his trap. If one enters a tunnel or a burrow and cannot see light at the end of it, or if a traveller digs a hole, enters it and can no longer see the skies or the stars above him in the dream, it means that thieves will rob him from his luggage, or that he will be highjacked, or stopped by a band of highway robbers. If one sees himself taking an ablution or a bath inside the tunnel or in the hole in a dream, it means that he will arrest the robbers and recover his property. If one enters a tunnel and takes a bath inside it in a dream, it means that he will pay his debts, or repent for his sins, or if he is incarcerated, it means that he will be released. If one digs a tunnel and draws water from it or discovers a hole filled with still water inside it in a dream, it means that he earns his livelihood from trickery and deception. (Also see Piercing a hole)"}, {"id": "turban", "label": "Turban", "category": "Objects", "meaning": "(Crown, Headgear, Tiara) In a dream, one's turban represents his family tree, his paternal uncle, or his paternal aunt. In a dream, one's turban also represents his crown, strength, integrity, state, or wife. Hone's turban is taken away from him in a dream, which means that he may lose his job, divorce his wife, or lose his wealth. The same interpretation is given for one who sees himself wearing a golden turban in a dream. If a prophet of God Almighty, or a ruler, crowns someone with a turban in a dream, it means that he will receive an important appointment, or that he may marry a pious woman. Putting on a turban in a dream means an increase in one's strength, expansion of one's control, growth in one's business, or it could mean becoming wealthy. If the turban is made of wool in the dream, it means a spiritual appointment, and if it is made of silk in the dream, then it means living a corrupt state of mind, or earning unlawful money. Wearing a second turban on top of the first one in a dream means an increase in one's power. Fixing a turban for oneself in a dream means taking a journey. A yellow turban means sickness. A black turban means happiness and unity. Wearing a turban in a dream could also mean that one may lose their sight. If a bewildered person sees himself wearing a turban in a dream, it means that his fears will dissipate. (Also see Crown, Headgear)"}, {"id": "turkish", "label": "Turkish", "category": "Other", "meaning": "(See Language)"}, {"id": "turkish-bath", "label": "Turkish bath", "category": "Other", "meaning": "(Bathhouse, Rest room, Sauna, Steam room, Sweat room) Seeing the attendant of a public bath facility in a dream means paying one's debts, dispelling one's problems, ending one's difficulties, and washing oneself from sin. On the other hand, seeing him in a dream could also mean depression or a sickness. If one sees himself as the attendant of a Turkish bath facility or a bathhouse, and if he stood by and did not serve the customers in the dream, it means that he is a pimp and a bastard who brings benefits to no one but rather wrath. If one sees himself wearing a white uniform and serving people in a dream, it means that he washes people's hearts and dispels their troubles. Public bath in itself denotes many meanings. (Also see Toilet)"}, {"id": "turning-in-one's-sleep", "label": "Turning in one's sleep", "category": "Action", "meaning": "If one sees himself turning in his sleep and putting his face down, or resting on his stomach in a dream, it means that he will turn away from his faith and lose both his earnings in this world and the hereafter. If one sees the reverse, which is turning from resting on one's stomach to lying on his back in a dream, it means that he will repent for his sins. It also represents his willingness to face the people and to correct his wrongdoing. If the subject is a woman, then sleeping on her stomach in a dream means that she is refusing to sleep with her husband. (Also see Running away, Take a flight, Sleep)"}, {"id": "turnip", "label": "Turnip", "category": "Plants", "meaning": "In a dream, a turnip represents a strong woman from a village, a curious villager, or it could mean distress and worries. If one sees turnips growing in the field in a dream, it means having unhappy children."}, {"id": "turquoise", "label": "Turquoise", "category": "Objects", "meaning": "(Precious stone) Turquoise in a dream signifies victory and success in one's life, or it could mean longevity. If a pregnant woman sees herself holding a dagger or a knife with a turquoise haft in a dream, it means that she will give birth to a son who will live to an advanced age."}, {"id": "turtle", "label": "Turtle", "category": "Animals", "meaning": "In a dream, a turtle represents a woman who likes to adorn herself and to make herself noticeable to please men. A turtle in a dream is also interpreted as a man of knowledge, or a chief justice, because she is the most knowledgeable and God fearing amongst the sea creatures. In a dream, a turtle therefore could represent a devout worshipper who reads the scrolls of God's prophet Abraham, upon whom be peace, or any of the holy scriptures. Seeing a pet turtle in a house or a town in a dream means that the people of knowledge in that locality are well respected. Seeing a turtle living in a dump, then it represents a knowledgeable person living in the midst of ignorant people who care little about learning anything from him. Eating a turtle in a dream means profits, benefits, or money. If one sees a turtle inside his house, or if he owns one in a dream, it means that he will benefit from the company of a learned person who is acquainted with ancient manuscripts, or in interpreting ancient scrolls. If one sees a turtle lying on its back in a dream, it means that there is a man of knowledge in that town whom people do not recognize. If one sees a well-kept and fed turtle sitting on a brocade in a dream, it means that the people of that town honour their scholars. However, a turtle in a dream can also be interpreted as deception, trickery, spying, hiding, evil, and the acquisition of weapons."}, {"id": "turtledove", "label": "Turtledove", "category": "Animals", "meaning": "(Dove, Pigeon, Ringdove) A turtledove in a dream represents a poet or a singer. Seeing a turtledove in a dream during the springtime means benefits and goodness, or it could mean the return of a long-awaited traveller, satisfaction of one's need, fulfillment of one's intent, or overcoming distress. Seeing a turtledove during other seasons in a dream means adversity. As for a pregnant woman, seeing a turtledove in a dream means that she will give birth to a son. A turtledove in a dream also represents a pious woman or a blessed son. (Also see Pigeon, Ringdove)"}, {"id": "tutelage", "label": "Tutelage", "category": "Other", "meaning": "(See Sponsorship)"}, {"id": "tutoring", "label": "Tutoring", "category": "Action", "meaning": "(See School)"}, {"id": "twanging", "label": "Twanging", "category": "Action", "meaning": "(Nasal speech) If one sees himself speaking with a twang in a dream, it means difficulties, or it could mean that he will be mocked for his opinions."}, {"id": "tweak", "label": "Tweak", "category": "Action", "meaning": "(See Pinch)"}, {"id": "tweezers", "label": "Tweezers", "category": "Tools", "meaning": "(Tongues) In a dream, a pair of tweezers represents a hard-working and patient boy. It also means blabber, or employment for a jobless person."}, {"id": "twilight", "label": "Twilight", "category": "Weather", "meaning": "(Dusk) Twilight in a dream means taking an oath, or it could represent the political or military move of a ruler and his deputies."}, {"id": "twine", "label": "Twine", "category": "Objects", "meaning": "(See Twist)"}, {"id": "twist", "label": "Twist", "category": "Action", "meaning": "(Bend, Curve, Perverseness) In a dream, twisting something means hypocrisy, absurdity, or twisting and changing God's words, or attributing a personal saying to God Almighty, and making it sound like an authentic revelation. Twisting one's turban, a cap, or a rope in a dream also means travel. (Also see Twisting a rope)"}, {"id": "twisting-a-rope", "label": "Twisting a rope", "category": "Action", "meaning": "(Splice, Entwine, Twine) To splice a rope or a thread, or to twist a rope around oneself, or to whirl it around a spindle, or to make a bobbin in a dream means undertaking a journey. If it comes out thin in the dream, then the outcome of one's journey is meager. If the rope comes out thick and strong in the dream, it means that the outcome of one's journey is beneficial. If the twisting of the rope or the thread is easy in the dream, it means that one's endeavour is free from constraint. If one sees himself plucking the hair of his beard and twisting it like a rope in a dream, it means that he will receive a bribe to make a false testimony in court. Twisting a rope or a thread in a dream could also mean signing a contract, establishing a partnership in a business, or signing a marriage contract. (Also see Beard, Twist)"}, {"id": "tying-a-knot", "label": "Tying a knot", "category": "Action", "meaning": "(See Contract)"}, {"id": "tyke", "label": "Tyke", "category": "Types of People", "meaning": "(See Dog)"}, {"id": "tyranny", "label": "Tyranny", "category": "Other", "meaning": "If one suspects himself to be a tyrant in a dream, it means that his desires and passions are uncontrollable, that he has strayed from the straight path, and that his wantonness has incriminated him. In this case, he can be justly considered as one of the dwellers of hellfire. (Also see Terrorization)"}]