[{"id": "ud", "label": "Ud", "category": "Objects", "meaning": "(arb. Aloe perfume, Civet, Incense burning Ud) Aloe or Ud wood chips or incense sticks in a dream represent a vocative and articulate person who has a praiseworthy reputation. Carrying a chip of Ud or aloe incense in a dream means finding a lost object or hearing comforting words. Smelling the fragrance of Ud or seeing the smoke of Ud burning in a dream means receiving a commendation and experiencing fright along with it. Seeing Ud or an Aloe tree growing inside one's house in a dream means begetting a son who will grow to be a sire or a leader in his community. (Also see Aloe perfume, Civet)"}, {"id": "ulcer", "label": "Ulcer", "category": "Human Body", "meaning": "(Abscess, Boil, Tumour. See Pimple)"}, {"id": "umbilicus", "label": "Umbilicus", "category": "Human Body", "meaning": "(See Body¹)"}, {"id": "umrah", "label": "Umrah", "category": "Action", "meaning": "(arb. Minor Hajj, Pilgrimage, Visiting God's House in Mecca) Performing the minor pilgrimage to God's House in Mecca during the great pilgrimage season signifies the end of one's life, or it could mean reaching the peak of one's illness. Performing the minor pilgrimage, also known in Arabic as Umrah, in a dream could also mean an increase in one's wealth, longevity, success in one's life, or acceptance of one's prayers. (Also see Pilgrimage, Rituals of the pilgrimage, Sahi)"}, {"id": "unbalance", "label": "Unbalance", "category": "Mood", "meaning": "(See Delirium, Distraction)"}, {"id": "unbeliever", "label": "Unbeliever", "category": "Types of People", "meaning": "(See Irreligious)"}, {"id": "uncertainty", "label": "Uncertainty", "category": "Mood", "meaning": "(Doubt) In a dream, uncertainty means heedlessness or being allured by Satan. Uncertainty and doubt about all religions in a dream represent adjuration and ingratitude. If a person who is concerned about religious explanations sees himself unable to recognize what faith he belongs to, or what direction to turn to in a dream, it represents doubt and lack of knowledge or certitude. If a seeker or a student on the path sees himself searching at no avail for a place to pray in a dream, it represents a blockage on his path, or an obstruction of his learning. As for a merchant, uncertainty in a dream represents obstacles hindering his efforts to receive any significant benefits from his business."}, {"id": "uncle's-beard", "label": "Uncle's beard", "category": "Human Body", "meaning": "Holding one's uncle's beard in a dream means inheriting him through unlawful means."}, {"id": "unclothed", "label": "Unclothed", "category": "Action", "meaning": "(See Naked)"}, {"id": "under-garment", "label": "Under garment", "category": "Objects", "meaning": "(See Slip)"}, {"id": "underground-granary", "label": "Underground granary", "category": "Other", "meaning": "(Granary, Pantry, Storage room, Subterranean storehouse) An underground grain storage house in a dream represents a caring mother, a single parent, or a foster mother. This interpretation comes from the example of a fetus in its mother's womb and its dependence on her to supply the necessary nourishment. Once the stored food is consumed, it is necessary to depend on a new source. If one sees an underground granary demolished or filled with dirt in a dream, and if his mother is sick, it means that she may die from her illness. If one's wife is pregnant, it means that she will soon deliver her infant. A demolished underground granary in a dream means finding a buyer for one's grains, and the dirt that fills the storehouse in the dream represents money. If the stored grain turns into dirt in a dream, it means that market prices will come down, or it could mean the loss of one's investment. Seeing a granary filled with food in a dream means that one's wife is pregnant. If a fire consumes the stored grain in a dream, it means rising prices. If one sees a granary filled with sugar or dates in a dream, it means that prices will stabilize and become attainable, while the type of food stored therein will be in limited supplies, and consequently, its price will rise. If a sick person falls into an underground granary in a dream, it means his death, or drowning in the sea, or facing highway robbery. As for one who is engaged in a fight, an underground granary in his dream represents a prison or a visit to a brothel."}, {"id": "underground-passage", "label": "Underground passage", "category": "Other", "meaning": "(See Tunnel)"}, {"id": "undertaker", "label": "Undertaker", "category": "Types of People", "meaning": "If a sick person sees an undertaker washing and shrouding him in a dream, it means his death or relief from his agony. An undertaker in a dream also means payment of one's debts, or repentance. If one sees himself washing a deceased person with boiling water in a dream, it means that the latter is suffering in hellfire. (Also see Grave digger, Hot water, Mortician, Ritual bath, Shrouding)"}, {"id": "underwear", "label": "Underwear", "category": "Objects", "meaning": "(Panties, Underpants) One's underwear in a dream represents his chastity. If one discovers wetness in his underpants in a dream, it means that his wife is pregnant. Seeing one's underpants soiled with feces in a dream means divorce. Wearing one's underpants inside-out in a dream means indulging in a loathsome and forbidden act of anal intercourse with one's wife. Wearing one's underpants without the underwear shirt in a dream means poverty. Wearing fancy underpants in a dream means travel or financial growth. Wearing a new set of underpants in a dream means modesty and protection of one's chastity. Giving away one's old underpants in a dream means relief from pressure."}, {"id": "undressed", "label": "Undressed", "category": "Action", "meaning": "(See Disrobe, Naked)"}, {"id": "undutiful-child", "label": "Undutiful child", "category": "Types of People", "meaning": "(See Recalcitrant child)"}, {"id": "uneasiness", "label": "Uneasiness", "category": "Feelings", "meaning": "(See Worries)"}, {"id": "unfinished-business", "label": "Unfinished business", "category": "Other", "meaning": "(See Incomplete job)"}, {"id": "unfold", "label": "Unfold", "category": "Action", "meaning": "(See Hanging clothes)"}, {"id": "ungodly", "label": "Ungodly", "category": "Types of People", "meaning": "(See Irreligious)"}, {"id": "uniform", "label": "Uniform", "category": "Objects", "meaning": "Wearing a soldier's uniform in a dream means a war. Wearing any uniform in a dream represents the type of work involved in using such a uniform. (Also see Bodyguard)"}, {"id": "unit-of-weight", "label": "Unit of weight", "category": "Other", "meaning": "(Measure, Weight) In a dream, a unit of weight may signify distress, or it could mean relief. A unit of weight in a dream also represents the elements that are measured or weighed with it. In a dream, a unit of weight could also represent one's confidant or personal secretary. (Also see Half a bushel, Measure², Weight)"}, {"id": "unjust-ruler", "label": "Unjust ruler", "category": "Types of People", "meaning": "When injustice is practiced by a ruler in a dream, it means the opposite. Seeing an unjust ruler in a dream could signify comfort, peace, safety, tranquillity, protection of society, or urban developments. (Also see Injustice, Justice)"}, {"id": "unlawful", "label": "Unlawful", "category": "Other", "meaning": "(Unlawful earnings, Impermissible, Illegal) Earning illegal money in a dream means falling into sin, or that a religious person will go astray. The opposite represents the lawful."}, {"id": "unloading", "label": "Unloading", "category": "Action", "meaning": "Unloading one's burdens, or unloading one's cargo in a dream, means paying charity and doing good for the benefit of those who appreciate and those who do not appreciate."}, {"id": "unlock", "label": "Unlock", "category": "Action", "meaning": "(Open) To unlock a closed or sealed door, or to open a sealed container, in a dream, means easing of one's difficulties, and it could represent the way to prosperity."}, {"id": "unmarried", "label": "Unmarried", "category": "Types of People", "meaning": "(See Virgin)"}, {"id": "unseen", "label": "Unseen", "category": "Other", "meaning": "(See Perspicacity)"}, {"id": "untying-something", "label": "Untying something", "category": "Action", "meaning": "Untying something in a dream means bewilderment, loneliness, being reprimanded, or stinginess. (Also see Knot)"}, {"id": "upholsterer", "label": "Upholsterer", "category": "Types of People", "meaning": "In a dream, an upholsterer represents someone proud of himself or his work, or he could represent a singer, a helper, a teacher, resting after a long working day, or someone who curbs the intentions of hypocrites, obliges them, and defrauds them of their assets."}, {"id": "upholsterer's-needle", "label": "Upholsterer's needle", "category": "Tools", "meaning": "(See Sacking needle)"}, {"id": "upper-room", "label": "Upper room", "category": "Other", "meaning": "(See Stairway)"}, {"id": "uptight", "label": "Uptight", "category": "Mood", "meaning": "(Anxious, Disheartened, Dispirited) Feeling uptight in a dream may mean an illness or death. (Also see Despair)"}, {"id": "urge", "label": "Urge", "category": "Feelings", "meaning": "(Entice, Incite, Induce, Lure. See Prompting)"}, {"id": "urinating", "label": "Urinating", "category": "Action", "meaning": "Urinating in a dream means wasting money unnecessarily or unlawfully. It also means a marriage to an unsuitable or an non-compatible person. The frequency of urination in a dream means receiving regular income. On the other hand, suppression of urine in a dream means the opposite, or it may mean hastiness, or making an incorrect decision. If one sees himself urinating in an unknown place, in someone else's house, a lodge, a town, etc., in a dream, it may mean kinship with its people. Wetting one's underpants in a dream means a newborn in the family. Urinating in the sea in a dream means paying taxes or giving charity. Urinating in a valley in a dream means expansion of one's progeny. Emitting a bad odour after urination while others are looking with despise in a dream means defamation, or exposing one's ills in public. Drinking urine in a dream means earning unlawful income. If one sees his servant or employee urinating inside a well or a stream in a dream, it means that someone from his family will betray his interests. Urinating in a dream also means dispelling distress."}, {"id": "urine", "label": "Urine", "category": "Human Body", "meaning": "(Also see Excretion, Glass bottle, Impurity, Urinating)"}, {"id": "urn", "label": "Urn", "category": "Objects", "meaning": "(Cistern, Container, Storing, Waterskin) In a dream, each type of urn is interpreted differently. A large urn represents a prostitute. In a dream, a cistern or any large conical jar made of porous clay and used in storing water represents a caretaker, a custodian, or a curator, the head of the household, his safe, or his shop. If the urn is seen inside a house in a dream, it represents a rich woman who is always in grief. If it is connected to a water wheel in the dream, it represents a rich man who carries heavy responsibilities and who spends his money on God's path. A waterskin in a dream represents a chaste woman. Drinking from a waterskin in a dream means receiving money or benefits from such a woman. If one sees himself drawing water from a storage tank, then pouring it into an urn in the dream, it means that he will take advantage of such a woman. A wine pitcher in a dream means discovering a treasure. If one sees an urn containing vinegar in a dream, it represents a pious and God-fearing person. If it stores butter or ghee for cooking in the dream, it represents a rich man who hides his wealth. If it stores pickles in the dream, it denotes a sick person. If an urn falls from one's hands and breaks in the dream, it means a divorce. (Also see Pitcher)"}, {"id": "ursa-major", "label": "Ursa Major", "category": "Celestial Bodies", "meaning": "(See Constellations)"}, {"id": "ursa-minor", "label": "Ursa Minor", "category": "Celestial Bodies", "meaning": "(See Constellations)"}, {"id": "urticaria", "label": "Urticaria", "category": "Human Body", "meaning": "(See Hives)"}, {"id": "used-clothing", "label": "Used clothing", "category": "Objects", "meaning": "(Attire, Goodwill, Secondhand) Buying used clothing in a dream means poverty, but selling worn garments in a dream means good deeds, for in that case, one repels his aggravation or unwarranted adversities. A thrift shop salesperson in a dream represents a layman. Selling used clothing in a dream also means putting an end to one's problems."}, {"id": "uthman", "label": "Uthman", "category": "Prophets", "meaning": "(Uthman bin Affan, God be pleased with him. The third of the four righteous califs) Seeing him in a dream means celebrating knowledge, being a godly person, friendship and love for others, lowering one's wings before God Almighty and to the believers among His creation, and he represents a trustworthy leadership. Seeing Uthman bin Affan in a dream also could mean facing the aggression of one's enemy and losing to them by winning martyrdom. It also means having great luck, prosperity, kinship with noble people, or being a pious and religious person. One who sees 'Uthman, God be pleased with him, in a dream will become a scholar. If one sees him doing business in a dream, it means that one is seeking worldly profits, though he likes to adorn himself with a religious garb and titles, but lacks true piety. If one sees him besieged inside his own house in a dream, it means that he will persecute and oppress a great scholar or a man of God. Seeing him alive and dealing with people in a dream means being chaste, pious, reverent, and earning the jealousy of one's circles."}, {"id": "uvula", "label": "Uvula", "category": "Human Body", "meaning": "If one's uvula is swollen to the extent of blocking his mouth or impeding his breathing in a dream, it means covetousness. Love to hoard money, frugality, miserliness, or the nearing of one's death. "}, {"id": "uzair", "label": "Uzair", "category": "Prophets", "meaning": "(See Ezra)"}]