[{"id": "vagabond", "label": "Vagabond", "category": "Types of People", "meaning": "(See Destitute)"}, {"id": "vagina", "label": "Vagina", "category": "Human Body", "meaning": "A vagina in a dream signifies relief for someone who is experiencing hardship, pressure, or sorrow. It also could mean satisfaction of one's needs, fulfillment of one's desire, marriage, partnership, exposing a secret, working with minerals, protecting women's chastity, imprisonment, the house entrance, the front door, travels, the prayer niche inside a mosque, one's innermost secret, running water, heat, an oven, a garment, a canyon, discovering a cure for an illness and feeling happy about it, finding an elixir, feeling relief after having sexual relationship with one's spouse, a grave, distress, one's wife, fire, a burning desire, family reunion, having children, dispelling doubt about what is right and what is wrong, clearly identifying true from false, finding guidance, or heeding admonition. If a man looks at a woman's vagina in a dream, it represents his wicked state of mind, needs, desires, humiliation, or it could represent the high standard a woman has achieved in his eyes. If a woman looks at a man's sexual organ in a dream, it represents her strength and manlike drive. If a prisoner finds himself having a vagina in a dream, it means his release from prison, and for someone who is depressed, it means relief from his depression. If one has to appear in court, it means that they will win their case. If one is facing an opponent, it means that he will conquer him. Seeing the vagina of an elderly woman in a dream means loss of business. If one re-enters the womb of a woman through her vagina in a dream, it means his death. A vagina in a dream also could represent a bloodsucker, a murderer, or a deceitful person who portrays piety during the day, then shows his teeth at night. A vagina in a dream also represents a shameless and insolent worker, or it could represent a bird's nest. In this sense, capturing a bird, or looking inside a bird's nest in a dream, means getting married. If a woman sees water entering her vagina in a dream, it means that she will conceive a child. If a woman's vagina turns into iron or any metal in the dream, it means that she has lost all hope in accomplishing her aspirations, satisfying her desires, or needs. (Also see Blowing into the vagina, Looking at a sexual organ, Semen, Effeminate, Sexual intercourse, Sodomy)"}, {"id": "vain-talk", "label": "Vain talk", "category": "Action", "meaning": "(See Naked)"}, {"id": "vainglory", "label": "Vainglory", "category": "Mood", "meaning": "(See Pride)"}, {"id": "valley", "label": "Valley", "category": "Earth", "meaning": "(See Wadi)"}, {"id": "vanity", "label": "Vanity", "category": "Mood", "meaning": "(See Pride)"}, {"id": "vapor", "label": "Vapor", "category": "Weather", "meaning": "In a dream, vapor represents a symptom of cataract that makes one's eye cloudy and obscures his sight. If, during the summer, one sees vapor exhaling from his mouth in a dream, which is a common phenomenon in cold weather, it means an internal disease, or exposing one's secrets. If the person in question in such a dream is a believer on the path, he may become heedless. If he is a man of knowledge, he may invent a provoking trend. On the other hand, vapor in a dream may imply falsehood, lies, and idle talk. (Also see Clouds)"}, {"id": "varanidae", "label": "Varanidae", "category": "Animals", "meaning": "(See Monitor²)"}, {"id": "vascular-blockage", "label": "Vascular blockage", "category": "Human Body", "meaning": "(Clot, Coagulation) When one is suffering from blood thickening or clotting, then retaining or flushing any part thereof in a dream means liquidation of stagnant merchandise, or recovering from an illness. When such an illness is not common, then seeing it in a dream means cognizance of a bad action, discovering a robbery in one's house, desecration of the grave of a relative, body snatching, or exhuming a body and moving it to another grave. Vascular blockage in a dream also represents abrogating one's promise, failing to fulfill a vow, denying a promise, or other related matters. (Also see Blood)"}, {"id": "vast-control", "label": "Vast control", "category": "Other", "meaning": "(See Finished business)"}, {"id": "vat", "label": "Vat", "category": "Objects", "meaning": "(Tank, Tanning drum, Tannery, Woman) A vat in a dream holds the same interpretation as a tannery, except if a tannery represents an independent woman in a dream, then a vat will represent an inhibited woman. A vat in a dream also represents a bathhouse, death by drowning, or dying under a collapsing structure."}, {"id": "vegetables", "label": "Vegetables", "category": "Food", "meaning": "(See Boiled vegetables)"}, {"id": "vehicle", "label": "Vehicle", "category": "Objects", "meaning": "(See Car)"}, {"id": "veil", "label": "Veil", "category": "Objects", "meaning": "(Attire) In a dream, a woman's veil represents her religion. For a woman, wearing a veil in a dream means marriage, prosperity, and beauty. Wearing a black veil in a dream means marrying a poor man. If a man sees himself wearing a veil in a dream, it means that he will commit adultery with his female servant. (Also see Apparel, Climbing a mountain, Closet, Khimar, Protection, Uncertainty, Wife, Yashmak)"}, {"id": "veins", "label": "Veins", "category": "Human Body", "meaning": "(Blood ties, Family, Relative, Vessel) The veins of the children of Adam represent their tribal belonging or clan. The parable of one's veins is like that of a tree and its branches. One's veins in a dream represent their family members, depending on which part of the body they belong to. The condition and beauty of one's veins in a dream denote their counterpart in one's family. If one sees his vein split open in a dream, it means the death of a relative. The same dream also could denote deceit, evil, an accident, or a calamity. Otherwise, it could represent a divided family. Exposed veins in a dream mean difficulties. The point of pulsation in one's veins or the arteries, or the veins of the carpal tunnel in a dream, represents one's livelihood, job, income, or the elderly people of his family. If a rich person sees a specific quantity of blood running through his veins in a dream, it means that he will lose an equal portion or percentage of his money. Otherwise, if a poor person sees that dream, it means that he will earn an equal amount of money. (Also see Aorta, Blood, Body¹, Jugular vein)"}, {"id": "vela", "label": "Vela", "category": "Celestial Bodies", "meaning": "(See Constellations)"}, {"id": "venereal-disease", "label": "Venereal disease", "category": "Human Body", "meaning": "(Piper)"}, {"id": "venter", "label": "Venter", "category": "Human Body", "meaning": "(See Abdomen)"}, {"id": "venus", "label": "Venus", "category": "Celestial Bodies", "meaning": "(Planet, Woman) In a dream, the planet Venus represents a beautiful woman. Seeing the planet Venus in a dream means getting married to an attractive woman of no kinship to him, though her beauty will lead many people into temptation. The planet Venus in a dream could also mean allegations, playfulness, complaisance, jokes, images, and idolatry. jewellery, nudity, pictures of beautiful women, or it could mean beautiful clothing. Seeing the planet Venus in a dream also means allegations, accusations, or that one may pursue any of the aforementioned elements, or he may establish a friendship with someone who follows such avenues, or perhaps he may marry an attractive woman, a foreign woman, or a famous singer. If one sees the planet Venus mixing with the moon, or if its position is lower than the moon, or if it is burning in the dream, then Venus represents one's daughter, or it could mean mixing with crazy or stupid people, or listening to vain talk. (Also see Constellation, Heavens)"}, {"id": "verbal-abuse", "label": "Verbal abuse", "category": "Action", "meaning": "(See Fire)"}, {"id": "vermin", "label": "Vermin", "category": "Animals", "meaning": "(zool. Game, Graveyard) A vermin or any bird that kills game or dwells near the graveyards in a dream represents a procurer or a prostitute."}, {"id": "vertical-wound", "label": "Vertical wound", "category": "Human Body", "meaning": "In a dream, a vertical wound represents a friendship, commendation, or unity."}, {"id": "vestige", "label": "Vestige", "category": "Other", "meaning": "(See Question)"}, {"id": "veteran", "label": "Veteran", "category": "Types of People", "meaning": "(See Salt)"}, {"id": "veterinarian", "label": "Veterinarian", "category": "Types of People", "meaning": "In a dream, a veterinarian is a person who adorns and beautifies distinguished and honoured people, and who supports and assists them in developing strength. Seeing a veterinarian in a dream also means performing a marriage ceremony, traveling, a pharmacist, or a merchant. In a dream, a veterinarian also means nursing the wounded soldiers on the battlefield. A veterinarian in a dream also may be interpreted as one's physician, one who practices righteousness, a wise man, a specialist in setting broken bones, cupping, or practicing bloodletting medicine."}, {"id": "viaduct", "label": "Viaduct", "category": "Other", "meaning": "(See Arched bridge, Bridge)"}, {"id": "vice-regent", "label": "Vice-regent", "category": "Types of People", "meaning": "(Calif, Caliphate, Deputy, Human being, Minister, Ruler, Secretary of state, Vizier) In a dream, a vice-regent represents someone whom people seek for his knowledge, or to learn the mastery of his craft, or he could represent an appointed justice of the peace. He also represents someone who inherits good and bad qualities, or whose character is different privately from the way he portrays himself in public. If one sees the vice-regent of the land in a stately appearance, or if he sees himself in such a form in a dream, it denotes his good state in this world and his success in the hereafter. Seeing him wearing an unsuitable garment in a dream reflects one's state, or it may mean that his current religious state is weak, though it may become better at a later stage of his life. A vice-regent or a caliph in a dream also represents someone who establishes the laws of his religion and follows the example of God's Prophet, upon whom be peace. Whatever he is wearing in the dream connotes one's state, or the growing or diminishing of his devotion. If one who is promised something sees the vice-regent or the caliph in his dream, it means that his promise will be fulfilled, and his wishes will come true. Seeing him in a dream also means that someone from a different circle is backbiting him, or speaking of him without his consent, or that people are reporting him to the authorities, or that scholars are discussing him, or mentioning his work. A vice-regent or a caliph in a dream also represents aloofness, seclusion, truthfulness, volunteering one's services, commanding what is good and forbidding what is evil, developing one's certitude and faith, repentance, abstaining from sinful actions, imprisonment, sickness, or travels. If one sees himself being awarded the seat of the vice-regent or caliph in a dream, though he does not suit the position, it means that adversities and temptations will befall the land, though the people of knowledge and the righteous ones will escape such danger. It could also mean that he will suffer humiliation, and that the people whom he manages may rise to preside over him."}, {"id": "vigilance", "label": "Vigilance", "category": "Mood", "meaning": "(See Wakefulness)"}, {"id": "vilify", "label": "Vilify", "category": "Action", "meaning": "(See Insult)"}, {"id": "village", "label": "Village", "category": "Other", "meaning": "(City, Suburban area, Town) A village in a dream represents injustice that will be followed by destruction as a consequence of people's sins. Entering a well-fortified village in a dream means fighting with someone. Crossing a village into a city in a dream means changing a menial job into a more respectable one, or perhaps it could mean downgrading a good deed one has performed, thinking of it as unimportant, or regretting it, or it could mean doing something good and thinking of it as evil, or perhaps it could mean showing indecisiveness and doubt. Entering a village in a dream also means governing it, or presiding over its people, or it could mean commencing a new job. Walking out of a village in a dream means escaping from evil. Seeing a destroyed village in a dream means heedlessness or a calamity caused by the sins of its dwellers. Seeing a well-built village in a dream shows the piety and righteousness of its people. Seeing ancient edifices or ruins inhabited again in a dream represents repentance from sin. A village in a dream could also signify injustice, innovations, corruption, disregarding the divine laws, or discarding the moral standards set by the community. A village in a dream also could represent an ant's underground nest or colony, while an anthill in a dream represents a village. If a village is destroyed by fire, or floods, or freezing temperatures, or by locusts, or plagues in one's dream, it means suffering under the oppression of an unjust ruler or a tyrant, or it could mean destroying an anthill. Moving from a village into a city in a dream means leaving one's toiling and hardships behind him. Moving from a city into a village means the opposite, and signifies leaving comfort and safety to meet with discomfort and fear. (Also see City)"}, {"id": "vinegar", "label": "Vinegar", "category": "Drinks", "meaning": "(Servant) In a dream, vinegar means money that is earned and spent in piety with blessings contained therein, or it could mean longevity, or wasting the least time possible in doing one's work. Vinegar sediments in a dream represent ignoble or evil money that carries meager benefits, or which is deemed shoddy. In a dream, vinegar and its container represent a servant and her dwellings. Drinking vinegar in a dream means enmity with one's household, or it could mean a family quarrel. As for a prisoner, drinking vinegar in a dream means his release from prison. Good vinegar in a dream means income and blessings, though when rarefied or stale, it means struggling to earn one's livelihood. It also means toiling to make ends meet, or it could mean hardships. Vinegar in a dream may also mean marital problems, difficulties with one's children, or a conflict at work. Vinegar in a dream also represents one's bosom friend. To water one's garden with vinegar in a dream means sleeping with one's mother."}, {"id": "vineyard", "label": "Vineyard", "category": "Plants", "meaning": "(Espalier, Grapevine, Trellis, Woman) A vineyard in a dream represents honour and strength, and the same goes for all fruit trees. A vineyard in a dream is also interpreted to represent a wealthy woman. Cutting branches from a grapevine in a dream means receiving money from a noble woman. Thus, an espalier in a dream represents a generous woman. A grapevine in the wintertime in a dream represents a woman who has lost her wealth, though one still thinks that she is rich. Plucking a bunch of grapes from an espalier in a dream means spending one's money on a woman. If one sees it but does not pluck any grapes from it in the dream, it means that he will be spared unnecessary expenses. A grapevine in a dream also represents marriage. A trellis for grapevines in a dream represents a beautiful, noble, and rich woman. The same interpretation is given for the garden surrounding it. To see a close-up view of a vineyard with its clusters of grapes and leaves in a dream means gaining financial benefits from associating with a community of believers. (Also see Wine press)"}, {"id": "vintage", "label": "Vintage", "category": "Other", "meaning": "(See Wine press)"}, {"id": "vintager", "label": "Vintager", "category": "Types of People", "meaning": "(See Wine press)"}, {"id": "violation", "label": "Violation", "category": "Action", "meaning": "(Rights, See Destruction)"}, {"id": "virgin", "label": "Virgin", "category": "Types of People", "meaning": "(Chaste, Girl, Unmarried) Seeing a virgin woman in a dream means distress, adversities, or business difficulties, while seeing a woman in a dream means comfort and success. (Also see Bride)"}, {"id": "virgo", "label": "Virgo", "category": "Celestial Bodies", "meaning": "(See Constellations)"}, {"id": "virgo", "label": "Virgo", "category": "Celestial Bodies", "meaning": "(astr. See Constellations, Moon)"}, {"id": "visibility", "label": "Visibility", "category": "Other", "meaning": "(See Appearance)"}, {"id": "visiting-god's-house-in-mecca", "label": "Visiting God's House In Mecca", "category": "Action", "meaning": "(See Pilgrimage, Umrah)"}, {"id": "visiting-holy-sites", "label": "Visiting holy sites", "category": "Action", "meaning": "Visiting the Prophet's Mosque in Medina in a dream means seeking God's nearness and his pleasure through good deeds. It also means feeling safe, mixing with people of knowledge, associating with people of religious ranks, joining the company of knowledge seekers, and developing sincere love for the family of God's Prophet, upon whom be peace, serving and loving those who love his progeny. Visiting the Prophet's Mosque in a dream also means love, knowledge, and guidance. Visiting Al-Aqsa Sacred Mosque in Jerusalem in a dream means blessings, understanding the inner meaning of important spiritual subjects and miraculous events, or reflecting upon the Nocturnal Journey of God's Messenger, the night in which the eight heavens were decorated to receive and honour him when he was called upon to come before God Almighty. Visiting the grave of God's Prophet Abraham, upon whom be peace, in a dream means obedience to one's parents, being true to them, seeking their love, blessings, and pleasure with sincerity and truthfulness with one's words and actions. Visiting holy sites in a dream also means seeking knowledge and wisdom, having love for charitable people, associating with good people, seeking to learn religion at the hand of a pious teacher, to receive blessings and benefits in this life and the next. (Also see Muhammad, upon whom be peace, Mecca, Medina)"}, {"id": "vizier", "label": "Vizier", "category": "Types of People", "meaning": "(Calif, Caliphate, Minister, Ruler, Secretary of state, Vice-regent)"}, {"id": "voice", "label": "Voice", "category": "Other", "meaning": "In a dream, the human voice represents one's reputation or fame, and its strength or weakness reflects one's state of mind or the condition of his health. Raising one's voice in a dream means unjustly presiding over a crowd of people. Hearing a human voice in a dream means bearing an important responsibility. If the human voice emanates from an animal in the dream, it denotes great benefits and particularly if the animal speaks pleasing and soothing words or words of truth. If one raises his voice above the voice of a man of knowledge, a shaikh, or a teacher in a dream, it means that he will sin. A weak voice in a dream represents a man. Intentionally lowering one's voice in a dream means being indebted to someone, or it could mean humility. If a man of authority or a policeman lowers his voice in a dream, it means that he may be dismissed from his job, or he may be reprimanded or disciplined for his misconduct. The sound produced by the ringing of coins in a dream represents temptation, allurement, or a fight between stockbrokers or money exchangers. The clank of money in a dream also means either good or bad news, or it could mean hearing good words, a wise speech, or words one likes to hear more about, if they are given as a sign of friendship or as a dower. If the clanking of money is made in jest in the dream, then it represents a fight one does not wish to end. The sound of a hornet represents a person who defames or discredits others, or whose evil cannot be removed without acquiring the help of a like person. The bleating of a ewe in a dream means kindness shown by one's mistress, his wife, or by a gracious man. The bleating of a billy goat or a ram in a dream means happiness and prosperity. The neighing of horses in a dream means receiving guidance from a noble person, or it could represent a courageous soldier. The braying of a donkey in a dream means hideousness, or the ugly character of a despicable enemy. The braying of a mule in a dream means a hardship that is combined with a difficult person, or it could mean vain talk, or indulging in suspicious acts. The mooing of a calf, a cow, or a steer in a dream means a riot. The gurgling of a camel in a dream represents a blessed journey, a pilgrimage, a successful business trip, or toiling and hardships. The roaring of a lion in a dream represents alarm, esteem, fear, or being threatened by someone in authority. In general, the sound of animals in a dream connotes adversities or fear. The neighing of horses in a dream means an invasion or might. The barking of dogs in a dream means vain talk, interference in others' business, regret, intending to harm others, hostility toward others, or dissonance. The blaring of a leopard in a dream means coquetry, vanity, and wantonness. The blaring of a lynx in a dream means a false promise from an unsteady, oft-hesitant, or greedy person, and taking advantage of him. The cooing of pigeons in a dream means lamenting, or having marital intercourse. The chirp of swifts in a dream means good words or an admonition from a wise person. The croaking of frogs in a dream represents the ringing of bells, feeling overjoyed, employment for a teacher, rising to leadership, or it could mean hearing harsh words. The hissing of a snake in a dream means a warning or a fight with someone who hides his enmity. The braying of a donkey in a dream means cursing one's adversaries. The roaring of a lion in a dream means threats or boasts. The yowling of a tomcat in a dream means uproar, backbiting, defamation, and insinuations. The squeak of a mouse in a dream means profits, reunion, love, and peace, or it could mean harm one could suffer because of an interfering person or a robber. The crying of a female gazelle in a dream means longing for one's homeland. The yapping of foxes in a dream means a warning to escape, to move from one field into another, or it could mean suffering from jealousy, perfidy, or lies. The howling of a wolf in a dream means a robbery, or fear of a brutal thief. The barking of a jackal in a dream means a mission of good intent, a forthcoming evil, women's cries for help, or the cry of people who have abandoned all hope. The sound of a pig in a dream means taking advantage of a stupid enemy and stripping him of his money. The sound of an ostrich in a dream means hiring a trustworthy and courageous servant, or bringing a new employee into one's business. Most dream interpreters dislike interpreting the meaning of the sound of peacocks or chickens and note that they mostly mean sorrow and distress, while others interpret the cawing of crows to mean separation or announcing someone's death. However, in a dream, any ugly or coarse sound represents sorrow and distress, while any pleasant sound in a dream represents happiness and joy. (Also see Invisible caller)"}, {"id": "volleyball", "label": "Volleyball", "category": "Objects", "meaning": "(See Ball)"}, {"id": "vomit", "label": "Vomit", "category": "Action", "meaning": "(Repentance, Throw up) Vomiting in a dream means returning things to their rightful owner, divulging secrets, or regaining one's health through control of his stomach. Throwing up clean food in a dream means ease in one's life. If a poor person vomits blood in his dream, it means receiving money, begetting a son, or the return of a relative from a journey, If the blood is collected in a bowl in the dream, it means that one's son will survive a major illness, or it could mean that one's relative may come to stay with him. However, if the blood is spilled on the floor, then it may mean the death of either the son or the relative. If one's intestines or bowels come out during vomiting in a dream, it means the death of a child. As for a sick person, vomiting in a dream means his death. Vomiting a snake in a dream also means death, or distancing oneself from one's enemies. Vomiting in a dream also means wasting money on food or unnecessary dieting for a poor person. Vomiting in a dream also has positive connotations for a poor person, but has negative ones for a rich person. If a ruler or a governor sees himself vomiting in a dream, it means that he will refund the taxes he has unjustly collected from them. If one licks back what he vomits in the dream, it means that he is indifferent about repaying a debt that he can easily afford. If one vomits inside a basin in a dream, it means repentance from his wrongdoing, or it could mean giving a woman a share from unlawful money. If one suffers from vomiting and finds the taste disgusting in his dream, it means that he is forced to confess and apologize for his wrongdoing, though he does not like being caught. It could also mean paying damages, health problems, or it could mean a financial misfortune. Vomiting blood in one's dream means repentance from sin, restraining oneself from indulging in what is forbidden, or it could mean satisfying one's debts, or fulfillment of a vow. If one drinks wine, then vomits the same in his dream, it means that he has received some tainted or unlawful money that he will remit to its rightful owner and repent for his sin. If one gets drunk and then throws up in their dream, it means that he is a stingy person who does not take good care of their own family. If one swallows a pearl and then throws up honey in his dream, it means that he will render a correct interpretation of some Qur'anic verses. Drinking milk and then vomiting it in a dream means turning away from the truth. Drinking milk and vomiting honey in a dream means repentance from sin. Drinking blood in a dream, then vomiting it as milk, also means repentance from sin. If one's vomit is yellow and bitter in the dream, it means repentance after having paid the price of one's crime. If one vomits mucus in his dream, it means that he will voluntarily repent from wrongdoing. Throwing up food in a dream means giving away something to someone who needs it. Swallowing what one is throwing up before it leaves his mouth in a dream means to go back on one's word. Eating what one has just vomited in a dream means prosperity and fame. Vomiting excessively in a dream means that one will reach near death or die from a severe illness. "}, {"id": "vow", "label": "Vow", "category": "Action", "meaning": "(See Offering)"}, {"id": "vulpecula", "label": "Vulpecula", "category": "Celestial Bodies", "meaning": "(See Constellations)"}, {"id": "vulture", "label": "Vulture", "category": "Animals", "meaning": "(Candor, Eagle, Enemy, Evil, Imbecile, Thieves) A vulture in a dream represents a stupid, abominable, and lewd person. When seen during a daylight dream, it means a grievous illness. If one sees a vulture inside his house in a dream, it means sending help to assist someone in difficulty. Capturing a vulture in a dream means a fight or war. A flock of vultures descending upon a town in a dream represents an occupying army with merciless soldiers who will plunder such a town. If a sick person sees a vulture inside his house in a dream, it means the approach of his death. As for a tanner and a potter, or the like craftsmen, seeing a vulture in a dream means profits or benefits. As for physicians or sick people, a vulture in their dream portends evil. In general, vultures in a dream represent highway robbers, a band of thieves who are not residents of that town, people who refuse to earn their livelihood through honest work, or it could represent an undertaker, a body snatcher, a grave digger, or a lewd and insulting person. (Also see Eagle)"}]