[{"id": "yahya", "label": "Yahya", "category": "Prophets", "meaning": "(God's prophet Yahya, upon whom be peace, John) Seeing him in a dream means being endowed with piety, love for God Almighty, fear of wrongdoing, and being distinct and unequalled in one's time. Seeing God's prophet Yahya in a dream also means that one will acquire power and receive glad tidings."}, {"id": "yapping", "label": "Yapping", "category": "Action", "meaning": "(See Sound of animals)"}, {"id": "yarn", "label": "Yarn", "category": "Objects", "meaning": "(See Ball of thread, Spinning)"}, {"id": "yarn-salesman", "label": "Yarn salesman", "category": "Types of People", "meaning": "(Mill, Spinning, Yarn) A yarn salesman in a dream represents a contract, an agreement, planning, spinning, or womanizing."}, {"id": "yashmak", "label": "Yashmak", "category": "Objects", "meaning": "(Turk. Double veil worn by Muslim women, Apparel, Attire, arb. Khimar, Niqab) A yashmak or a veil covering the lower part of the face up to the eyes in a dream represents a young girl who will live a long life, or it could represent one who devotes her life to religious and spiritual studies. (Also see Khimar, Veil)"}, {"id": "yawning", "label": "Yawning", "category": "Action", "meaning": "(Slumberous) In a dream, yawning means an illness or an affliction. It also represents an insolent act that pleases Satan. Yawning in a dream also means a surprise charge at one's enemy. It also means a reward, because it prevents the person from speaking. Yawning in a dream also means a terminal illness."}, {"id": "year", "label": "Year", "category": "Other", "meaning": "(Age, Period, Time) In a dream, a year represents drought, doubt, difficulties, threats, scientific advancement, trials, and temptations. If one identifies a year in a dream during a drought season, it means a good harvest. As for a pregnant woman, identifying a year in a dream means delivering her child. Seeing a year in a dream means experiencing an adversity, or witnessing someone else's trials and learning a lesson from it, or to repent of one's sins."}, {"id": "yearning", "label": "Yearning", "category": "Feelings", "meaning": "To feel a yearning or a desire to see one's homeland in a dream means divorce between a husband and a wife, or separation between friends, or it could mean becoming rich after being poor. Yearning in a dream also connotes evil if accompanied by crying or lamenting."}, {"id": "yearning-for-one's-homeland", "label": "Yearning for one's homeland", "category": "Feelings", "meaning": "(See Yearning)"}, {"id": "yelling", "label": "Yelling", "category": "Action", "meaning": "(See Call)"}, {"id": "yellow", "label": "Yellow", "category": "Other", "meaning": "(Colour) Wearing a yellow silken garment in a dream means a sickness. If a warrior sees himself wearing a yellow silken garment in a dream, it means that he will be decorated for his chivalry. Yellow in a dream also represents strains. (Also see Colours, Paleness)"}, {"id": "yellow-rose", "label": "Yellow rose", "category": "Plants", "meaning": "(See Rose)"}, {"id": "yellow-scorpion", "label": "Yellow scorpion", "category": "Animals", "meaning": "(See Scorpion)"}, {"id": "yielding", "label": "Yielding", "category": "Mood", "meaning": "(See Driving force)"}, {"id": "yogurt", "label": "Yogurt", "category": "Food", "meaning": "(See Cheese)"}, {"id": "yoke", "label": "Yoke", "category": "Objects", "meaning": "(Bond, Bondage, Harness, Shackles, Yoke of matrimony) In a dream, a yoke means benefits for most people except for people in bondage. In their case, seeing a yoke in a dream means harsher subjugation to their masters. If someone is suffering from bondage, or if a prisoner of war, or a political prisoner sees a broken yoke in a dream, it means that he will be set free. The wooden frame, which is attached to the plough-iron or the colter in a dream, means marriage, bearing children, or work. A yoke in a dream also represents the turning of circumstances against one's liking, or meeting with obliging conditions."}, {"id": "yoke-of-matrimony", "label": "Yoke of matrimony", "category": "Other", "meaning": "(See Marriage, Yoke)"}, {"id": "young-boy", "label": "Young boy", "category": "Types of People", "meaning": "(See Boy)"}, {"id": "young-man", "label": "Young man", "category": "Types of People", "meaning": "(Teenage boy) An unknown young man in a dream represents an enemy. If the young man is known in the dream, then whatever strength, harshness, weaknesses, deceit, perfidy, or character he displays, they denote the same character in wakefulness. Walking behind an unknown young man in a dream means pursuing one's enemy and conquering him. If one meets an unknown young man whom he dislikes in a dream, it means that such an enemy will surface, and people will abhor him. If one happens to like him in a dream, then it means that he will face an enemy whom most people like and sympathize with. If a young man sees himself turned into an old person in a dream, it means that he will suffer major losses in his life. A young man or a teenager in a dream mostly represents an enemy, for a teenager rarely respects or heeds the advice of his peers. A young man in a dream also represents deceit, betrayal, energy, or stubbornness, though he also could represent blessings and gratitude."}, {"id": "young-woman", "label": "Young woman", "category": "Types of People", "meaning": "(Teenage girl) A young girl in a dream represents an enemy, however she may look. Seeing a well-dressed and pleasingly adorned young woman in a dream means hearing pleasing news coming from an unexpected person. Seeing a young and beautiful-looking female servant in a dream means blessings, a favour, joy, and festivities. In a dream, seeing an unknown young girl is more advantageous than seeing a known one. The strongest in meaning are those teenage girls who are presentable, well-mannered, and beautifully dressed. If she is seen dressed modestly in the dream, then she represents goodness, chastity, discretion, and following the correct religious conduct. If she adorns herself and plays up her charms in the dream, then such goodness will be public. If a young girl sees herself as an old woman in a dream, it means that she will live with modesty and preserve her chastity. If an old woman sees herself turned young again in the dream, it means regaining her strength, sexual desire, and fertility. If she engages in lawful sexual intercourse in marriage, it denotes strong religious adherence. If she engages in sexual intercourse with someone without marriage in the dream, then her dream represents her love for the world and attachment to its glitters. If one sees an old woman turned young in a dream, then the above explanation becomes stronger. However, if one is poor, it means that their basic needs will be secured. If one has lost her chances in this world, it means that she will have a new opportunity, or if she is sick, it means that she will recover from her illness. Seeing a young girl frowning in a dream means that one may hear disturbing news. If she looks emaciated, then one's dream denotes poverty. If she is naked in the dream, it means business losses and defamation. Marrying a virgin teenage girl in a dream means wealth. (Also see Little girl)"}, {"id": "yowling", "label": "Yowling", "category": "Action", "meaning": "(See Lamenting, Sound of animals)"}, {"id": "yunus", "label": "Yunus", "category": "Prophets", "meaning": "(See Jonah)"}, {"id": "yusuf", "label": "Yusuf", "category": "Prophets", "meaning": "(See Joseph)"}]