[{"id": "zachariah", "label": "Zachariah", "category": "Prophets", "meaning": "(Zachar, to remember + ya, God, The prophet Zachariah, upon whom be peace.) If one sees the Prophet Zachariah in a dream, it means that God Almighty will restore fertility to him and his wife at an advanced age. Seeing God's prophet Zachariah in a dream also means begetting a righteous son who will grow to be a sire. (Also see Zikr)"}, {"id": "zacharias", "label": "Zacharias", "category": "Prophets", "meaning": "(See Zachariah)"}, {"id": "zamzam", "label": "Zamzam", "category": "Water", "meaning": "(Well of Zamzam, Kaaba, Mecca) If one sees the well of Zamzam quenching the thirst of people and if it is situated in a particular neighbourhood, or a town other than Mecca, it signifies that a gnostic will come to reside in that place and whose knowledge and wisdom will benefit its people. Drinking water from the blessed well of Zamzam in a dream also means recovering from an illness. If one drinks Zamzam water after having placed an intention in his dream, for example, to acquire knowledge, grow in wisdom, become wealthy, to recover from an illness, to conceive a child, to receive forgiveness for one's sins or any lawful desire in a dream, it means that God willing, one's wish will come true. (Also see Gutter, Well)"}, {"id": "zebra", "label": "Zebra", "category": "Animals", "meaning": "(Donkey, Ingratitude, Sin) If one sees a domesticated zebra in a dream, it means benefits and profits. The transformation of a donkey into a zebra in a dream means evil. If a zebra enters one's house in a dream, it means that an evil person will enter that house, or that one will bring an evil person to their house. (Also see Donkey)"}, {"id": "zendik", "label": "Zendik", "category": "Types of People", "meaning": "(arb. Atheist. See Cent)"}, {"id": "zikr", "label": "Zikr", "category": "Action", "meaning": "(Hymn, Remembrance of God, Songs of God's love, Supplications) If one sees himself in a dream participating in a circle of people remembering God Almighty, or calling upon His most beautiful name, or invoking His divine attributes, or reading the Qur'an, or reciting devotional songs, it means that such a location will be built as a holy place to celebrate God's praises. The goodness of that place depends on the quality of reading, or the degree of devotion seen in the dream. When it is an ascetic song in the dream, it means that one's deputyship is established correctly, but if one sees himself singing a sensual love song, then it means temptations. If one sees himself repeatedly calling God's name in a dream, it means that he will win victory over his enemy. Calling people to God and reminding them of His attributes in a dream represents the work of a preacher who admonishes people, helps them to the shore of safety, and distances them from their sins and their consequences. If a merchant sees himself calling upon God's beautiful names in a dream, it means that his business will be saved from bankruptcy. If a disbeliever, a profane or a secular person sees himself in a state of remembering God Almighty and calling upon His most holy attributes in a dream, it means that he may fall sick, or face great adversities, while in his heart, he will remain pleading with God Almighty for mercy and relief, though he may remain silent in public regarding his inner faith, and in fear of being ridiculed by his circles. If, during his dream, one speaks words of truth and wisdom, it means that he will recover from his adversity and be cured of his illness. Furthermore, he will move into a more comfortable life and begin a life of sharing and doing good deeds in this world, or he may receive guidance and light, and faith will permeate his heart. If one says his prayers with a twang in a dream, it means that he will linger in difficulties, and that people will mock him too. (Also see Supplications)"}, {"id": "zircon", "label": "Zircon", "category": "Objects", "meaning": "(Gem, Mineral, Ring, Stone) In a dream, zircon represents unity and affection between husband and wife, or it could mean a contract between two partners, or reconciliation between two enemies, or it could represent the correctness of one's faith. (Also see Stone)"}, {"id": "zodiac-signs", "label": "Zodiac signs", "category": "Celestial Bodies", "meaning": "(See Celestial spheres, Constellations, Dog, Star)"}, {"id": "zucchini", "label": "Zucchini", "category": "Plants", "meaning": "(See Pumpkin)"}, {"id": "zuhur", "label": "Zuhur", "category": "Other", "meaning": "(arb. See Five-time prayers)"}, {"id": "zul-hijjah", "label": "Zul-Hijjah", "category": "Months", "meaning": "(See Arabic months, 'Arafat)"}, {"id": "zul-qarnain", "label": "Zul-Qarnain", "category": "Types of People", "meaning": "(Zul-Qarnain, peace be upon him.) Seeing him in a dream means that one will intercede before a great person on behalf of someone else and satisfy his needs."}, {"id": "zul-qi'dah", "label": "Zul-Qi'dah", "category": "Months", "meaning": "(See Arabic months)"}]